;WITH спр_ВидиПараметровВипускаПродукции AS ( -- ../spr/спр_ВидиПараметровВипускаПродукции.sql
    SELECT
        спр_ВидиПараметровВипускаПродукции._IDRRef AS ID_ВидиПараметровВипускаПродукции,
        спр_ВидиПараметровВипускаПродукции._Code AS Code_ВидиПараметровВипускаПродукции,
        спр_ВидиПараметровВипускаПродукции._Description AS Назва_ВидиПараметровВипускаПродукции,
        спр_ВидиПараметровВипускаПродукции._Marked AS ПоміткаВидалення_ВидиПараметровВипускаПродукции,
        спр_ВидиПараметровВипускаПродукции._Folder AS ГрупаНоменклатури_ВидиПараметровВипускаПродукции
    FROM _Reference56 AS спр_ВидиПараметровВипускаПродукции

    WHERE 
        спр_ВидиПараметровВипускаПродукции._Marked = 0 -- ПоміткаВидалення
)
SELECT *
FROM спр_ВидиПараметровВипускаПродукции