;WITH 
спрТехнологическиеХарактеристикиНоменклатуры AS (
    SELECT
        спрТехнологическиеХарактеристикиНоменклатуры._Fld24298RRef AS FK_Номенклатура,
        спрТехнологическиеХарактеристикиНоменклатуры._IDRRef AS ID,
        спрТехнологическиеХарактеристикиНоменклатуры._Code AS Code,
        спрТехнологическиеХарактеристикиНоменклатуры._Description AS Назва,
        спрТехнологическиеХарактеристикиНоменклатуры._Marked AS ПоміткаВидалення,
        спрТехнологическиеХарактеристикиНоменклатуры._Fld24300 AS Активна
    FROM _Reference24296 AS спрТехнологическиеХарактеристикиНоменклатуры
    WHERE 
        спрТехнологическиеХарактеристикиНоменклатуры._Marked = 0
        AND 
        спрТехнологическиеХарактеристикиНоменклатуры._Fld24300 = 1
)
,TbptСписокХарактеристик__спрТХН AS (
    SELECT
        TbptСписокХарактеристик__спрТХН._Reference24296_IDRRef AS FK_Характеристика,
        TbptСписокХарактеристик__спрТХН._Fld24304RRef AS СвойствоRref,
        TbptСписокХарактеристик__спрТХН._Fld24305_TYPE AS ТипЗначення,
        TbptСписокХарактеристик__спрТХН._Fld24305_S AS ЗначенняСимвольне,
        TbptСписокХарактеристик__спрТХН._Fld24305_N AS ЗначенняЧислове,
        TbptСписокХарактеристик__спрТХН._Fld24305_T AS ЗначенняДата,
        TbptСписокХарактеристик__спрТХН._Fld24305_L AS ЗначенняЛогічне,
        TbptСписокХарактеристик__спрТХН._Fld24305_RRRef AS ЗначенняRRRef,
        TbptСписокХарактеристик__спрТХН._Fld24305_RTRef AS ЗначенняRTRef,
        TbptСписокХарактеристик__спрТХН._Fld24306 AS Відхилення
    FROM _Reference24296_VT24302 AS TbptСписокХарактеристик__спрТХН
)
,спрНоменклатура AS (
    SELECT
        спрНоменклатура._IDRRef AS ID,
        спрНоменклатура._Code AS Code,
        спрНоменклатура._Description AS own__Наименование__спрНоменклатура,
        спрНоменклатура._Marked AS ПоміткаВидалення,
        спрНоменклатура._Folder AS Група
    FROM _Reference149 AS спрНоменклатура
)
,спрЗначенияСвойствОбъектов AS (
    SELECT
        спрЗначенияСвойствОбъектов._IDRRef AS ID,
        спрЗначенияСвойствОбъектов._Code AS Code,
        спрЗначенияСвойствОбъектов._Description AS НазваСвойства,
        спрЗначенияСвойствОбъектов._Marked AS ПоміткаВидалення,
        спрЗначенияСвойствОбъектов._Folder AS Група
    FROM
        _Reference93 AS спрЗначенияСвойствОбъектов
)
,планвидхарТехнологическиеСвойстваОбъектов AS (
    SELECT
        планвидхарТехнологическиеСвойстваОбъектов._IDRRef AS ID,
        планвидхарТехнологическиеСвойстваОбъектов._Code AS Code,
        планвидхарТехнологическиеСвойстваОбъектов._Description AS NameN,
        планвидхарТехнологическиеСвойстваОбъектов._Marked AS ПоміткаВидалення,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24417RRef AS ТипВластивості,
        планвидхарТехнологическиеСвойстваОбъектов._Type AS Тип,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24398RRef AS ВаріантРозрахунку,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24399_TYPE AS ТипДанихДляРозрахунку,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24399_RRRef AS РозрахунокПосилання,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24399_N AS РозрахунокЧисло
    FROM _Chrc24297 AS планвидхарТехнологическиеСвойстваОбъектов
)
,Props__МатінкоРіднаПростиМене__спрТХН AS (
    SELECT
        спрТехнологическиеХарактеристикиНоменклатуры.FK_Номенклатура AS FK_Номенклатура_Характеристики,
        спрТехнологическиеХарактеристикиНоменклатуры.Code AS КодХарактеристики,
        спрТехнологическиеХарактеристикиНоменклатуры.Назва AS НазваХарактеристики,
        планвидхарТехнологическиеСвойстваОбъектов.NameN AS НазваСвойства,
        TbptСписокХарактеристик__спрТХН.Відхилення AS Відхилення,
        CASE -- все конвертується, бо кейс приймає тільки один тип даних (в півоті будуть нормальні типи)
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x1 
                THEN CONVERT(NVARCHAR(100), TbptСписокХарактеристик__спрТХН.ЗначенняДата, 120)
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x2 
                THEN 
                    CASE 
                        WHEN TbptСписокХарактеристик__спрТХН.ЗначенняЛогічне = 1 
                            THEN N'Так'
                        ELSE N'Ні'
                    END
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x3 
                THEN CAST(TbptСписокХарактеристик__спрТХН.ЗначенняЧислове AS NVARCHAR(100))
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x5                -- знаходила вручну
                THEN CAST(TbptСписокХарактеристик__спрТХН.ЗначенняСимвольне AS NVARCHAR(100))
            WHEN TbptСписокХарактеристик__спрТХН.ЗначенняRTRef = 0x00000095
                THEN спрНоменклатура.own__Наименование__спрНоменклатура
            WHEN TbptСписокХарактеристик__спрТХН.ЗначенняRTRef = 0x0000005D
                THEN спрЗначенияСвойствОбъектов.НазваСвойства
            ELSE NULL
        END AS Значення
    FROM спрТехнологическиеХарактеристикиНоменклатуры
        LEFT JOIN TbptСписокХарактеристик__спрТХН
            ON спрТехнологическиеХарактеристикиНоменклатуры.ID = TbptСписокХарактеристик__спрТХН.FK_Характеристика
        LEFT JOIN спрНоменклатура
            ON TbptСписокХарактеристик__спрТХН.ЗначенняRRRef = спрНоменклатура.ID
        LEFT JOIN спрЗначенияСвойствОбъектов
            ON TbptСписокХарактеристик__спрТХН.ЗначенняRRRef = спрЗначенияСвойствОбъектов.ID
        LEFT JOIN спрЗначенияСвойствОбъектов AS спрЗначенияСвойствОбъектов_base
            ON TbptСписокХарактеристик__спрТХН.СвойствоRref = спрЗначенияСвойствОбъектов_base.ID
        LEFT JOIN планвидхарТехнологическиеСвойстваОбъектов
            ON TbptСписокХарактеристик__спрТХН.СвойствоRref = планвидхарТехнологическиеСвойстваОбъектов.ID
)
SELECT * FROM Props__МатінкоРіднаПростиМене__спрТХН
ORDER BY КодХарактеристики