;WITH 

-- Цехи, Лінії

спр_ВидыПодразделений AS ( -- ../spr/спр_ВидыПодразделений.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений._IDRRef AS ID_ВидыПодразделений
        -- imp
        -- ,спр_ВидыПодразделений._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений._Description AS Назва_ВидыПодразделений
        -- other
        -- system
        -- ,спр_ВидыПодразделений._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений

    WHERE 
        спр_ВидыПодразделений._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2 (Лінія1)' -- вже нема
)

,Viz AS (
    SELECT
        спр_ВидыПодразделений.ID_ВидыПодразделений
            [ID Лінії]
        ,спр_ВидыПодразделений.Назва_ВидыПодразделений
            [Лінія]
    FROM
        спр_ВидыПодразделений
)

SELECT *
FROM Viz