;WITH 
спрТехнологическиеХарактеристикиНоменклатуры AS (
    SELECT
        спрТехнологическиеХарактеристикиНоменклатуры._Fld24298RRef FK__Номенклатура__спрНоменклатура_спрТХН,
        спрТехнологическиеХарактеристикиНоменклатуры._IDRRef ID__Ссылка__спрТехнологическиеХарактеристикиНоменклатуры,
        спрТехнологическиеХарактеристикиНоменклатуры._Code imp__Код__спрТехнологическиеХарактеристикиНоменклатуры,
        спрТехнологическиеХарактеристикиНоменклатуры._Description own__Наименование__спрТехнологическиеХарактеристикиНоменклатуры,
        спрТехнологическиеХарактеристикиНоменклатуры._Marked sys__ПомеченоНаУдаление__спрТехнологическиеХарактеристикиНоменклатуры,
        спрТехнологическиеХарактеристикиНоменклатуры._Fld24300 sys__Активность__спрТехнологическиеХарактеристикиНоменклатуры
    FROM _Reference24296 AS спрТехнологическиеХарактеристикиНоменклатуры
    WHERE 
        спрТехнологическиеХарактеристикиНоменклатуры._Marked = 0
        AND 
        спрТехнологическиеХарактеристикиНоменклатуры._Fld24300 = 1
)
,TbptСписокХарактеристик__спрТХН AS (
    SELECT
        TbptСписокХарактеристик__спрТХН._Reference24296_IDRRef FK_Характеристика,
        TbptСписокХарактеристик__спрТХН._Fld24304RRef СвойствоRref,
        TbptСписокХарактеристик__спрТХН._Fld24305_TYPE ТипЗначення,
        TbptСписокХарактеристик__спрТХН._Fld24305_S ЗначенняСимвольне,
        TbptСписокХарактеристик__спрТХН._Fld24305_N ЗначенняЧислове,
        TbptСписокХарактеристик__спрТХН._Fld24305_T ЗначенняДата,
        TbptСписокХарактеристик__спрТХН._Fld24305_L ЗначенняЛогічне,
        TbptСписокХарактеристик__спрТХН._Fld24305_RRRef ЗначенняRRRef,
        TbptСписокХарактеристик__спрТХН._Fld24305_RTRef ЗначенняRTRef,
        TbptСписокХарактеристик__спрТХН._Fld24306 Відхилення
    FROM _Reference24296_VT24302 AS TbptСписокХарактеристик__спрТХН
)
,спрНоменклатура AS (
    SELECT
        спрНоменклатура._IDRRef ID,
        спрНоменклатура._Code Code,
        спрНоменклатура._Description own__Наименование__спрНоменклатура,
        спрНоменклатура._Marked ПоміткаВидалення,
        спрНоменклатура._Folder Група
    FROM _Reference149 AS спрНоменклатура
)
,спрЗначенияСвойствОбъектов AS (
    SELECT
        спрЗначенияСвойствОбъектов._IDRRef ID,
        спрЗначенияСвойствОбъектов._Code Code,
        спрЗначенияСвойствОбъектов._Description НазваСвойства,
        спрЗначенияСвойствОбъектов._Marked ПоміткаВидалення,
        спрЗначенияСвойствОбъектов._Folder Група
    FROM
        _Reference93 AS спрЗначенияСвойствОбъектов
)
,планвидхарТехнологическиеСвойстваОбъектов AS (
    SELECT
        планвидхарТехнологическиеСвойстваОбъектов._IDRRef ID,
        планвидхарТехнологическиеСвойстваОбъектов._Code Code,
        планвидхарТехнологическиеСвойстваОбъектов._Description NameN,
        планвидхарТехнологическиеСвойстваОбъектов._Marked ПоміткаВидалення,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24417RRef ТипВластивості,
        планвидхарТехнологическиеСвойстваОбъектов._Type Тип,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24398RRef ВаріантРозрахунку,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24399_TYPE ТипДанихДляРозрахунку,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24399_RRRef РозрахунокПосилання,
        планвидхарТехнологическиеСвойстваОбъектов._Fld24399_N РозрахунокЧисло
    FROM _Chrc24297 AS планвидхарТехнологическиеСвойстваОбъектов
)
,Props__МатінкоРіднаПростиМене__спрТХН AS (
    SELECT
        спрТехнологическиеХарактеристикиНоменклатуры.FK__Номенклатура__спрНоменклатура_спрТХН 
            FK__Номенклатура__спрНоменклатура_спрТХН_Характеристики,
        спрТехнологическиеХарактеристикиНоменклатуры.imp__Код__спрТехнологическиеХарактеристикиНоменклатуры 
            КодХарактеристики,
        спрТехнологическиеХарактеристикиНоменклатуры.own__Наименование__спрТехнологическиеХарактеристикиНоменклатуры 
            НазваХарактеристики,
        планвидхарТехнологическиеСвойстваОбъектов.NameN НазваСвойства,
        TbptСписокХарактеристик__спрТХН.Відхилення Відхилення,
        CASE -- все конвертується, бо кейс приймає тільки один тип даних (в півоті будуть нормальні типи)
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x1 
                THEN CONVERT(NVARCHAR(100), TbptСписокХарактеристик__спрТХН.ЗначенняДата, 120)
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x2 
                THEN 
                    CASE 
                        WHEN TbptСписокХарактеристик__спрТХН.ЗначенняЛогічне = 1 
                            THEN N'Так'
                        ELSE N'Ні'
                    END
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x3 
                THEN CAST(TbptСписокХарактеристик__спрТХН.ЗначенняЧислове AS NVARCHAR(100))
            WHEN TbptСписокХарактеристик__спрТХН.ТипЗначення = 0x5                -- знаходила вручну
                THEN CAST(TbptСписокХарактеристик__спрТХН.ЗначенняСимвольне AS NVARCHAR(100))
            WHEN TbptСписокХарактеристик__спрТХН.ЗначенняRTRef = 0x00000095
                THEN спрНоменклатура.own__Наименование__спрНоменклатура
            WHEN TbptСписокХарактеристик__спрТХН.ЗначенняRTRef = 0x0000005D
                THEN спрЗначенияСвойствОбъектов.НазваСвойства
            ELSE NULL
        END AS Значення
    FROM 
        спрТехнологическиеХарактеристикиНоменклатуры
        LEFT JOIN 
            TbptСписокХарактеристик__спрТХН
            ON 
                спрТехнологическиеХарактеристикиНоменклатуры.ID__Ссылка__спрТехнологическиеХарактеристикиНоменклатуры 
                    = TbptСписокХарактеристик__спрТХН.FK_Характеристика
        LEFT JOIN 
            спрНоменклатура
            ON 
                TbptСписокХарактеристик__спрТХН.ЗначенняRRRef = спрНоменклатура.ID
        LEFT JOIN 
            спрЗначенияСвойствОбъектов
            ON 
                TbptСписокХарактеристик__спрТХН.ЗначенняRRRef = спрЗначенияСвойствОбъектов.ID
        LEFT JOIN 
            спрЗначенияСвойствОбъектов AS спрЗначенияСвойствОбъектов_base
            ON 
                TbptСписокХарактеристик__спрТХН.СвойствоRref = спрЗначенияСвойствОбъектов_base.ID
        LEFT JOIN 
            планвидхарТехнологическиеСвойстваОбъектов
            ON 
                TbptСписокХарактеристик__спрТХН.СвойствоRref = планвидхарТехнологическиеСвойстваОбъектов.ID
)
SELECT 
    * 
FROM 
    Props__МатінкоРіднаПростиМене__спрТХН
ORDER BY 
    КодХарактеристики