;WITH спр_ВидиПараметровПроизводства AS ( -- ../spr/спр_ВидиПараметровПроизводства.sql
    SELECT
        спр_ВидиПараметровПроизводства._IDRRef AS ID_ВидиПараметровПроизводства,
        спр_ВидиПараметровПроизводства._Code AS Code_ВидиПараметровПроизводства,
        спр_ВидиПараметровПроизводства._Description AS Назва_ВидиПараметровПроизводства,
        спр_ВидиПараметровПроизводства._Marked AS ПоміткаВидалення_ВидиПараметровПроизводства,
        спр_ВидиПараметровПроизводства._Folder AS ГрупаНоменклатури_ВидиПараметровПроизводства
    FROM _Reference23884 AS спр_ВидиПараметровПроизводства

    WHERE 
        спр_ВидиПараметровПроизводства._Marked = 0 -- ПоміткаВидалення
)
SELECT *
FROM спр_ВидиПараметровПроизводства