;WITH 
TbptВыходИзделия__спрСпецификацииНоменклатуры AS (
    SELECT
        TbptВыходИзделия__спрСпецификацииНоменклатуры._Reference207_IDRRef
        ,TbptВыходИзделия__спрСпецификацииНоменклатуры._Fld2796RRef AS FK_Номенклатура
        ,TbptВыходИзделия__спрСпецификацииНоменклатуры._Fld2798 AS Количество_ВиходногоИзделия
        ,_Reference207_IDRRef AS ID
    FROM _Reference207_VT2794 AS TbptВыходИзделия__спрСпецификацииНоменклатуры
)
,Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН AS ( -- перевірка 1:N на випадок, якщо фірма почне використовувати як N:N, або станеться баг в базі
    SELECT 
        _Reference207_IDRRef AS ID
        ,COUNT(_Reference207_IDRRef) AS Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
    FROM 
        _Reference207_VT2794
    
    GROUP BY 
        _Reference207_IDRRef
    HAVING 
        COUNT(_Reference207_IDRRef) > 1
)
,спрСпецификацииНоменклатуры AS (
    SELECT
        TbptВыходИзделия__спрСпецификацииНоменклатуры.FK_Номенклатура AS FK_Номенклатура
        ,спрСпецификацииНоменклатуры._IDRRef AS ID
        ,спрСпецификацииНоменклатуры._Code AS Code
        ,спрСпецификацииНоменклатуры._Description AS Назва
        ,спрСпецификацииНоменклатуры._Marked AS ПоміткаВидалення
        ,спрСпецификацииНоменклатуры._Fld2757 AS Активна
        ,TbptВыходИзделия__спрСпецификацииНоменклатуры.Количество_ВиходногоИзделия 
        ,Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН.Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН AS Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
    FROM 
        _Reference207 AS спрСпецификацииНоменклатуры
        LEFT JOIN 
            TbptВыходИзделия__спрСпецификацииНоменклатуры AS TbptВыходИзделия__спрСпецификацииНоменклатуры 
            ON 
                спрСпецификацииНоменклатуры._IDRRef = TbptВыходИзделия__спрСпецификацииНоменклатуры.ID
        LEFT JOIN 
            Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН AS Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН -- перевірка 1:N на випадок N:N
            ON 
                спрСпецификацииНоменклатуры._IDRRef = Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН.ID
    WHERE
        спрСпецификацииНоменклатуры._Marked = 0
        AND 
        спрСпецификацииНоменклатуры._Fld2757 = 1
)
,TbptИсходныеКомплектующие__спрСН AS (
    SELECT
        TbptИсходныеКомплектующие__спрСН._Reference207_IDRRef AS FK_спрСпецификацииНоменклатуры
        ,TbptИсходныеКомплектующие__спрСН._Fld2772RRef AS ВидНормативаFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2773_RRRef AS НоменклатураFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2775 AS Кількість
        ,TbptИсходныеКомплектующие__спрСН._Fld2776RRef AS ОдиницяВиміруFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2777RRef AS СтаттяЗатратFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2781 AS Кратність
        ,TbptИсходныеКомплектующие__спрСН._Fld2782RRef AS ВидПроізводстваFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2783RRef AS СпецифікаціяFK
    FROM 
        _Reference207_VT2770 AS TbptИсходныеКомплектующие__спрСН
)
,TbptПараметрыВыпускаПродукции__спрСН AS (
    SELECT
        TbptПараметрыВыпускаПродукции__спрСН._Reference207_IDRRef AS FK_спрСпецификацииНоменклатуры
        ,TbptПараметрыВыпускаПродукции__спрСН._Fld2828RRef AS ВидПараметраFK
        ,TbptПараметрыВыпускаПродукции__спрСН._Fld2829 AS Значення
    FROM 
        _Reference207_VT2826 AS TbptПараметрыВыпускаПродукции__спрСН
)
,спрНоменклатура AS (
    SELECT
        спрНоменклатура._IDRRef AS НоменклатураID
        ,спрНоменклатура._Code AS НоменклатураCode
        ,спрНоменклатура._Description AS НазваНоменклатури
        ,спрНоменклатура._Marked AS ПоміткаВидаленняНоменклатури
        ,спрНоменклатура._Folder AS ГрупаНоменклатури
        ,спрНоменклатура._Fld2306RRef AS FK_ВидНоменклатурьі_Номенклатура
        ,спрНоменклатура._Fld23716 AS КількістьВУпаковці_Номенклатура
        ,спрНоменклатура._Fld25116RRef AS FK_Проект_КаналЗбуту_Номенклатура
    FROM _Reference149 AS спрНоменклатура
)
,спрВидыПараметровПроизводства AS (
    SELECT
        спрВидыПараметровПроизводства._IDRRef AS ID_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Code AS Code_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Description AS Назва_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Marked AS ПоміткаВидалення_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Folder AS ГрупаНоменклатури_ВидиПарамПроізводства
    FROM _Reference23884 AS спрВидыПараметровПроизводства
)
,спрВидыПараметровВыпускаПродукции AS (
    SELECT
        спрВидыПараметровВыпускаПродукции._IDRRef AS ID_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Code AS Code_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Description AS Назва_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Marked AS ПоміткаВидалення_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Folder AS ГрупаНоменклатури_ВидиПарамВипускПрод
    FROM _Reference56 AS спрВидыПараметровВыпускаПродукции
)
,спрЕдиницыИзмерения AS (
    SELECT
        спрЕдиницыИзмерения._IDRRef AS ID_ЕдиницьіИзмерения
        ,спрЕдиницыИзмерения._Code AS Code_ЕдиницьіИзмерения
        ,спрЕдиницыИзмерения._Description AS Назва_ЕдиницьіИзмерения
        ,спрЕдиницыИзмерения._Marked AS ПоміткаВидалення_ЕдиницьіИзмерения
    FROM _Reference89 AS спрЕдиницыИзмерения
)
,спрСтатьиЗатрат AS (
    SELECT
        спрСтатьиЗатрат._IDRRef AS ID_СтатьиЗатрат
        ,спрСтатьиЗатрат._Code AS Код_СтатьиЗатрат
        ,спрСтатьиЗатрат._Description AS Наименование_СтатьиЗатрат
        ,спрСтатьиЗатрат._Marked AS ПометкаУдаления_СтатьиЗатрат
    FROM _Reference216 AS спрСтатьиЗатрат
)
,Props__ГосподиПрости__спрСН AS (
    SELECT
        спрСпецификацииНоменклатуры.FK_Номенклатура AS FK_Номенклатура_Специфікації
        ,спрСпецификацииНоменклатуры.Количество_ВиходногоИзделия                  AS Количество_ВиходногоИзделия
        ,спрСпецификацииНоменклатуры.Code                                         AS КодСпецифікації
        ,спрСпецификацииНоменклатуры.Назва                                        AS НазваСпецифікації
        ,спрСпецификацииНоменклатуры.Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН                     AS Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
        ,'ПараметриВипуску'                                             AS ТипСписку
        ,спрВидыПараметровВыпускаПродукции.Назва_ВидиПарамВипускПрод              AS ВидПараметра_ВипускПродукції
        ,TbptПараметрыВыпускаПродукции__спрСН.Значення               AS Значення_ВипускПродукції
        ,NULL                                                           AS ВидПроізводства_Комплектуючої
        ,NULL                                                           AS Кратність_Комплектуючої
        ,NULL                                                           AS Кількість_Комплектуючої
        ,NULL                                                           AS Номенклатура_Комплектуючої
        ,NULL                                                           AS ОдиницяВиміру_Комплектуючої
        ,NULL                                                           AS Специфікація_Комплектуючої
        ,NULL                                                           AS СтаттяЗатрат_Комплектуючої
    FROM 
        спрСпецификацииНоменклатуры
        INNER JOIN TbptПараметрыВыпускаПродукции__спрСН
            ON спрСпецификацииНоменклатуры.ID = TbptПараметрыВыпускаПродукции__спрСН.FK_спрСпецификацииНоменклатуры
        LEFT JOIN спрВидыПараметровВыпускаПродукции
            ON TbptПараметрыВыпускаПродукции__спрСН.ВидПараметраFK = спрВидыПараметровВыпускаПродукции.ID_ВидиПарамВипускПрод
UNION ALL
SELECT
        спрСпецификацииНоменклатуры.FK_Номенклатура AS FK_Номенклатура_Специфікації
        ,спрСпецификацииНоменклатуры.Количество_ВиходногоИзделия                  AS Количество_ВиходногоИзделия
        ,спрСпецификацииНоменклатуры.Code                                         AS КодСпецифікації
        ,спрСпецификацииНоменклатуры.Назва                                        AS НазваСпецифікації
        ,спрСпецификацииНоменклатуры.Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН                     AS Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
        ,'ІсходніКомплектуючі'                                          AS ТипСписку
        ,NULL                                                           AS ВидПараметра_ВипускПродукції
        ,NULL                                                           AS Значення_ВипускПродукції
        ,спрВидыПараметровПроизводства.Назва_ВидиПарамПроізводства             AS ВидПроізводства_Комплектуючої
        ,TbptИсходныеКомплектующие__спрСН.Кратність               AS Кратність_Комплектуючої
        ,TbptИсходныеКомплектующие__спрСН.Кількість               AS Кількість_Комплектуючої
        ,спрНоменклатура_Комплектуючі.НазваНоменклатури                AS НоменклатураКомплектуючої
        ,спрЕдиницыИзмерения.Назва_ЕдиницьіИзмерения                  AS ОдиницяВиміру_Комплектуючої
        ,спрСпецификацииНоменклатуры_Комплектуючі.Назва                           AS СпецифікаціяКомплектуючої
        ,спрСтатьиЗатрат.Наименование_СтатьиЗатрат                     AS СтаттяЗатрат_Комплектуючої
    FROM 
        спрСпецификацииНоменклатуры
        INNER JOIN TbptИсходныеКомплектующие__спрСН
            ON спрСпецификацииНоменклатуры.ID = TbptИсходныеКомплектующие__спрСН.FK_спрСпецификацииНоменклатуры
        LEFT JOIN спрВидыПараметровПроизводства
            ON TbptИсходныеКомплектующие__спрСН.ВидПроізводстваFK = спрВидыПараметровПроизводства.ID_ВидиПарамПроізводства
        LEFT JOIN спрЕдиницыИзмерения
            ON TbptИсходныеКомплектующие__спрСН.ОдиницяВиміруFK = спрЕдиницыИзмерения.ID_ЕдиницьіИзмерения
        LEFT JOIN спрСтатьиЗатрат
            ON TbptИсходныеКомплектующие__спрСН.СтаттяЗатратFK = спрСтатьиЗатрат.ID_СтатьиЗатрат
        LEFT JOIN спрНоменклатура AS спрНоменклатура_Комплектуючі
            ON TbptИсходныеКомплектующие__спрСН.НоменклатураFK = спрНоменклатура_Комплектуючі.НоменклатураID
        LEFT JOIN спрСпецификацииНоменклатуры AS спрСпецификацииНоменклатуры_Комплектуючі
            ON TbptИсходныеКомплектующие__спрСН.СпецифікаціяFK = спрСпецификацииНоменклатуры_Комплектуючі.ID
)
SELECT * FROM Props__ГосподиПрости__спрСН