;WITH 
TbptВыходИзделия__спрСН AS (
    SELECT
        TbptВыходИзделия__спрСН._Reference207_IDRRef ParentID__спрСпецификацииНоменклатуры__TbptВыходИзделия_спрСН
        ,TbptВыходИзделия__спрСН._Fld2796RRef FK__Номенклатура__спрНоменклатура_TbptВИ_спрСН
        ,TbptВыходИзделия__спрСН._Fld2798 own__Количество__TbptВыходИзделия_спрСН
        ,TbptВыходИзделия__спрСН._Reference207_IDRRef ID__Ссылка__TbptВыходИзделия_спрСН
    FROM _Reference207_VT2794 AS TbptВыходИзделия__спрСН
)
,Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН AS ( -- перевірка 1:N на випадок, якщо фірма почне використовувати як N:N, або станеться баг в базі
    SELECT 
        TbptВыходИзделия__спрСН.ParentID__спрСпецификацииНоменклатуры__TbptВыходИзделия_спрСН
        ,COUNT(TbptВыходИзделия__спрСН.ID__Ссылка__TbptВыходИзделия_спрСН) Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
    FROM 
        TbptВыходИзделия__спрСН
    
    GROUP BY 
        TbptВыходИзделия__спрСН.ParentID__спрСпецификацииНоменклатуры__TbptВыходИзделия_спрСН
    HAVING 
        COUNT(TbptВыходИзделия__спрСН.ID__Ссылка__TbptВыходИзделия_спрСН) > 1
)
,спрСпецификацииНоменклатуры AS (
    SELECT
        TbptВыходИзделия__спрСН.FK__Номенклатура__спрНоменклатура_TbptВИ_спрСН FK__Номенклатура__спрНоменклатура_TbptВИ_спрСН
        ,спрСпецификацииНоменклатуры._IDRRef ID__Ссылка__спрСпецификацииНоменклатуры
        ,спрСпецификацииНоменклатуры._Code Code
        ,спрСпецификацииНоменклатуры._Description Назва
        ,спрСпецификацииНоменклатуры._Marked ПоміткаВидалення
        ,спрСпецификацииНоменклатуры._Fld2757 Активна
        ,TbptВыходИзделия__спрСН.own__Количество__TbptВыходИзделия_спрСН 
        ,Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН.Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
    FROM 
        _Reference207 AS спрСпецификацииНоменклатуры
        LEFT JOIN 
            TbptВыходИзделия__спрСН AS TbptВыходИзделия__спрСН 
            ON 
                спрСпецификацииНоменклатуры._IDRRef = TbptВыходИзделия__спрСН.ParentID__спрСпецификацииНоменклатуры__TbptВыходИзделия_спрСН
        LEFT JOIN 
            Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН AS Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН -- перевірка 1:N на випадок N:N
            ON 
                спрСпецификацииНоменклатуры._IDRRef = Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН.ParentID__спрСпецификацииНоменклатуры__TbptВыходИзделия_спрСН
    WHERE
        спрСпецификацииНоменклатуры._Marked = 0
        AND 
        спрСпецификацииНоменклатуры._Fld2757 = 1
)
,TbptИсходныеКомплектующие__спрСН AS (
    SELECT
        TbptИсходныеКомплектующие__спрСН._Reference207_IDRRef FK_спрСпецификацииНоменклатуры
        ,TbptИсходныеКомплектующие__спрСН._Fld2772RRef ВидНормативаFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2773_RRRef НоменклатураFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2775 Кількість
        ,TbptИсходныеКомплектующие__спрСН._Fld2776RRef ОдиницяВиміруFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2777RRef СтаттяЗатратFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2781 Кратність
        ,TbptИсходныеКомплектующие__спрСН._Fld2782RRef ВидПроізводстваFK
        ,TbptИсходныеКомплектующие__спрСН._Fld2783RRef СпецифікаціяFK
    FROM 
        _Reference207_VT2770 AS TbptИсходныеКомплектующие__спрСН
)
,TbptПараметрыВыпускаПродукции__спрСН AS (
    SELECT
        TbptПараметрыВыпускаПродукции__спрСН._Reference207_IDRRef FK_спрСпецификацииНоменклатуры
        ,TbptПараметрыВыпускаПродукции__спрСН._Fld2828RRef ВидПараметраFK
        ,TbptПараметрыВыпускаПродукции__спрСН._Fld2829 Значення
    FROM 
        _Reference207_VT2826 AS TbptПараметрыВыпускаПродукции__спрСН
)
,спрНоменклатура AS (
    SELECT
        спрНоменклатура._IDRRef НоменклатураID
        ,спрНоменклатура._Code imp__Код__спрНоменклатура
        ,спрНоменклатура._Description own__Наименование__спрНоменклатура
        ,спрНоменклатура._Marked sys__ПомеченоНаУдаление__спрНоменклатура
        ,спрНоменклатура._Folder imp__Группа__спрНоменклатура
        ,спрНоменклатура._Fld2306RRef FK__Вид__спрВидыНоменклатуры_спрН
        ,спрНоменклатура._Fld23716 own__КоличествоВУпаковке__спрНоменклатура
        ,спрНоменклатура._Fld25116RRef FK__Проект__спрНоменклатура
    FROM _Reference149 AS спрНоменклатура
)
,спрВидыПараметровПроизводства AS (
    SELECT
        спрВидыПараметровПроизводства._IDRRef ID_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Code Code_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Description Назва_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Marked ПоміткаВидалення_ВидиПарамПроізводства,
        спрВидыПараметровПроизводства._Folder imp__Группа__спрНоменклатура_ВидиПарамПроізводства
    FROM _Reference23884 AS спрВидыПараметровПроизводства
)
,спрВидыПараметровВыпускаПродукции AS (
    SELECT
        спрВидыПараметровВыпускаПродукции._IDRRef ID_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Code Code_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Description Назва_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Marked ПоміткаВидалення_ВидиПарамВипускПрод,
        спрВидыПараметровВыпускаПродукции._Folder imp__Группа__спрНоменклатура_ВидиПарамВипускПрод
    FROM _Reference56 AS спрВидыПараметровВыпускаПродукции
)
,спрЕдиницыИзмерения AS (
    SELECT
        спрЕдиницыИзмерения._IDRRef ID_ЕдиницьіИзмерения
        ,спрЕдиницыИзмерения._Code Code_ЕдиницьіИзмерения
        ,спрЕдиницыИзмерения._Description Назва_ЕдиницьіИзмерения
        ,спрЕдиницыИзмерения._Marked ПоміткаВидалення_ЕдиницьіИзмерения
    FROM _Reference89 AS спрЕдиницыИзмерения
)
,спрСтатьиЗатрат AS (
    SELECT
        спрСтатьиЗатрат._IDRRef ID_СтатьиЗатрат
        ,спрСтатьиЗатрат._Code Код_СтатьиЗатрат
        ,спрСтатьиЗатрат._Description Наименование_СтатьиЗатрат
        ,спрСтатьиЗатрат._Marked ПометкаУдаления_СтатьиЗатрат
    FROM _Reference216 AS спрСтатьиЗатрат
)
,Props__ГосподиПрости__спрСН AS (
    SELECT
        спрСпецификацииНоменклатуры.FK__Номенклатура__спрНоменклатура_TbptВИ_спрСН FK__Номенклатура__спрНоменклатура_TbptВИ_спрСН_Специфікації
        ,спрСпецификацииНоменклатуры.own__Количество__TbptВыходИзделия_спрСН own__Количество__TbptВыходИзделия_спрСН
        ,спрСпецификацииНоменклатуры.Code КодСпецифікації
        ,спрСпецификацииНоменклатуры.Назва НазваСпецифікації
        ,спрСпецификацииНоменклатуры.Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
        ,'ПараметриВипуску' ТипСписку
        ,спрВидыПараметровВыпускаПродукции.Назва_ВидиПарамВипускПрод ВидПараметра_ВипускПродукції
        ,TbptПараметрыВыпускаПродукции__спрСН.Значення Значення_ВипускПродукції
        ,NULL ВидПроізводства_Комплектуючої
        ,NULL Кратність_Комплектуючої
        ,NULL Кількість_Комплектуючої
        ,NULL Номенклатура_Комплектуючої
        ,NULL ОдиницяВиміру_Комплектуючої
        ,NULL Специфікація_Комплектуючої
        ,NULL СтаттяЗатрат_Комплектуючої
    FROM 
        спрСпецификацииНоменклатуры
        INNER JOIN TbptПараметрыВыпускаПродукции__спрСН
            ON спрСпецификацииНоменклатуры.ID__Ссылка__спрСпецификацииНоменклатуры 
                = TbptПараметрыВыпускаПродукции__спрСН.FK_спрСпецификацииНоменклатуры
        LEFT JOIN спрВидыПараметровВыпускаПродукции
            ON TbptПараметрыВыпускаПродукции__спрСН.ВидПараметраFK = спрВидыПараметровВыпускаПродукции.ID_ВидиПарамВипускПрод
UNION ALL
    SELECT
        спрСпецификацииНоменклатуры.FK__Номенклатура__спрНоменклатура_TbptВИ_спрСН FK__Номенклатура__спрНоменклатура_TbptВИ_спрСН_Специфікації
        ,спрСпецификацииНоменклатуры.own__Количество__TbptВыходИзделия_спрСН own__Количество__TbptВыходИзделия_спрСН
        ,спрСпецификацииНоменклатуры.Code КодСпецифікації
        ,спрСпецификацииНоменклатуры.Назва НазваСпецифікації
        ,спрСпецификацииНоменклатуры.Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН Agr__Більше1ВиходнеІздПомилка__TbptВИ_спрСН
        ,'ІсходніКомплектуючі' ТипСписку
        ,NULL ВидПараметра_ВипускПродукції
        ,NULL Значення_ВипускПродукції
        ,спрВидыПараметровПроизводства.Назва_ВидиПарамПроізводства ВидПроізводства_Комплектуючої
        ,TbptИсходныеКомплектующие__спрСН.Кратність Кратність_Комплектуючої
        ,TbptИсходныеКомплектующие__спрСН.Кількість Кількість_Комплектуючої
        ,спрНоменклатура_Комплектуючі.own__Наименование__спрНоменклатура НоменклатураКомплектуючої
        ,спрЕдиницыИзмерения.Назва_ЕдиницьіИзмерения ОдиницяВиміру_Комплектуючої
        ,спрСпецификацииНоменклатуры_Комплектуючі.Назва СпецифікаціяКомплектуючої
        ,спрСтатьиЗатрат.Наименование_СтатьиЗатрат СтаттяЗатрат_Комплектуючої
    FROM 
        спрСпецификацииНоменклатуры
        INNER JOIN 
            TbptИсходныеКомплектующие__спрСН
            ON 
                спрСпецификацииНоменклатуры.ID__Ссылка__спрСпецификацииНоменклатуры = TbptИсходныеКомплектующие__спрСН.FK_спрСпецификацииНоменклатуры
        LEFT JOIN 
            спрВидыПараметровПроизводства
            ON 
                TbptИсходныеКомплектующие__спрСН.ВидПроізводстваFK = спрВидыПараметровПроизводства.ID_ВидиПарамПроізводства
        LEFT JOIN 
            спрЕдиницыИзмерения
            ON 
                TbptИсходныеКомплектующие__спрСН.ОдиницяВиміруFK = спрЕдиницыИзмерения.ID_ЕдиницьіИзмерения
        LEFT JOIN 
            спрСтатьиЗатрат
            ON 
                TbptИсходныеКомплектующие__спрСН.СтаттяЗатратFK = спрСтатьиЗатрат.ID_СтатьиЗатрат
        LEFT JOIN 
            спрНоменклатура AS спрНоменклатура_Комплектуючі
            ON 
                TbptИсходныеКомплектующие__спрСН.НоменклатураFK = спрНоменклатура_Комплектуючі.НоменклатураID
        LEFT JOIN 
            спрСпецификацииНоменклатуры AS спрСпецификацииНоменклатуры_Комплектуючі
            ON 
                TbptИсходныеКомплектующие__спрСН.СпецифікаціяFK = спрСпецификацииНоменклатуры_Комплектуючі.ID__Ссылка__спрСпецификацииНоменклатуры
)
SELECT * FROM Props__ГосподиПрости__спрСН