;WITH 

-------------------------------------------------------------------------------------------------------
---------------------------------------------- BASE ---------------------------------------------------
---
спр_ПричиныПростоевПроизводственныхЛиний AS ( -- .../.../спр_ПричиныПростоевПроизводственныхЛиний.sql
    SELECT
        спр_ПричиныПростоевПроизводственныхЛиний._IDRRef AS ID_спр_ПричиныПростоевПроизводственныхЛиний,
        спр_ПричиныПростоевПроизводственныхЛиний._Description AS Наименование_спр_ПричиныПростоевПроизводственныхЛиний
    FROM 
        _Reference25189 AS спр_ПричиныПростоевПроизводственныхЛиний

    WHERE
        спр_ПричиныПростоевПроизводственныхЛиний._Marked = 0
)
--------------------------------------------- TABLEPARTS ----------------------------------------------
---

-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------
---

-------------------------------------------------------------------------------------------------------
---------------------------------------------- OPS ----------------------------------------------------
---


SELECT * FROM спр_ПричиныПростоевПроизводственныхЛиний