;WITH 



-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------

регсведПростои AS ( -- ../рег/регСвед/регсведПростои.sql
    SELECT
        регсведПростои._Fld25202RRef FK__докОтчетПроизводстваЗаСмену__регсведПростои
        ,регсведПростои._Fld25197RRef FK__Подразделение__спрВидыПодразделений_регсведР
        -- ,DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)) 
        --     own__НачалоПростоя_регсведПростои
        -- ,DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)))
        --     calc__НачалоПростояМінусДень_регсведПростои
        ,регсведПростои._Fld25199
        ,CASE
            WHEN регсведПростои._Fld25199 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)) 
        END own__НачалоПростоя_регсведПростои
        ,CASE
            WHEN регсведПростои._Fld25199 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)))
        END calc__НачалоПростояМінусДень_регсведПростои
        ,DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25200 AS datetime2)) 
            own__КонецПростоя_регсведПростои
    FROM 
        _InfoRg25196 AS регсведПростои
)

---- BASE ---------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
---- TABLEPARTS ---------------------------------------------------------------------------
-- ,Tbpt__
-- ParentID__
---- TABLEPARTS ---------------------------------------------------------------------------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------
----------------------------------------- VIEWS -------------------------------------------

,спр_ВидыПодразделений_Прост AS ( -- ../spr/спр_ВидыПодразделений_Прост.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений_Прост._IDRRef AS ID_ВидыПодразделений__регсведПростои
        -- imp
        -- ,спр_ВидыПодразделений_Прост._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений_Прост._Description AS Назва_ВидыПодразделений__регсведПростои
        -- other
        -- system
        -- ,спр_ВидыПодразделений_Прост._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений_Прост

    WHERE 
        спр_ВидыПодразделений_Прост._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений_Прост._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений_Прост._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений_Прост._Description <> 'Цех №2 (Лінія1)' -- вже нема
)

----------------------------------------- VIEWS -------------------------------------------
-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------- BaseView Joins 1:1 ------------------------------------
-- ,Join__
----------------------------------- BaseView Joins 1:1 ------------------------------------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------- PRJCT ----------
,Join__спр_ВидыПодразделений_Прост__регсведПростои AS (
    SELECT
        *
    FROM
        регсведПростои
        LEFT JOIN
            спр_ВидыПодразделений_Прост
            ON
                регсведПростои.FK__Подразделение__спрВидыПодразделений_регсведР
                    = спр_ВидыПодразделений_Прост.ID_ВидыПодразделений__регсведПростои
)

,Props__ТривалістьПростоїв__регсведПростои AS (
    SELECT
        *
        ,CASE 
            WHEN Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои IS NULL 
            OR Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои IS NULL 
            OR Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои <= Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои
            OR 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои
                ) > 720
                THEN 
                    0
            ELSE 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои
                )
        END AS DurationMinutes_Простои
    FROM 
        Join__спр_ВидыПодразделений_Прост__регсведПростои
)

,Props__ПростойЗміна__регсведПростои AS (
    SELECT
        *
        ,CASE 
            WHEN 
                DATEPART(
                    HOUR, own__НачалоПростоя_регсведПростои
                ) >= 6 
            AND 
                DATEPART(
                    HOUR, own__НачалоПростоя_регсведПростои
                ) < 18
                THEN 
                    CONVERT(
                        nvarchar(10), 
                            own__НачалоПростоя_регсведПростои
                    ) + N', Денна, ' + Назва_ВидыПодразделений__регсведПростои
            ELSE 
                CASE 
                    WHEN 
                        DATEPART(
                                HOUR, own__НачалоПростоя_регсведПростои
                        ) >= 18
                        THEN
                        CONVERT(
                            nvarchar(10), 
                                own__НачалоПростоя_регсведПростои
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПростои
                    ELSE
                        CONVERT(
                            nvarchar(10), 
                                calc__НачалоПростояМінусДень_регсведПростои
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПростои
                END
        END AS Зміна_Простои
    FROM 
        Props__ТривалістьПростоїв__регсведПростои
)

,Agr__СумаПростоївПоЗміні__регсведПростои AS (
    SELECT
        Зміна_Простои
        ,SUM(DurationMinutes_Простои) AS TotalDurationMinutes_Простои
    FROM 
        Props__ПростойЗміна__регсведПростои
    GROUP BY
        Зміна_Простои
)

---------------------------------------------------------- ProjectJoin --------------------
-- ,Join__
-------------------------------------------------------------------------- PRJCT ----------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Projects Vizes ----------
-- ,Viz__
----------------------------------------------------------------- Projects Vizes ----------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Working Vizes -----------
,working__Main AS (
    SELECT  
        *
    FROM
        Agr__СумаПростоївПоЗміні__регсведПростои
)

,working AS (
    SELECT
        working__Main.Зміна_Простои
        ,working__Main.TotalDurationMinutes_Простои
    FROM
        working__Main
)
----------------------------------------------------------------- Working Vizes -----------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
----------------------------------------------------------------- SELECTS -----------------
SELECT *
FROM working

-- WHERE
--     Props__СумаПростоївПоЗміні__регсведПростои.Назва_ВидыПодразделений__регсведПростои = 'Цех №7 (Лінія1) прихід червень 2024'

ORDER BY 
    Зміна_Простои DESC
----------------------------------------------------------------- SELECTS -----------------
-------------------------------------------------------------------------------------------