;WITH 

регСвед_Простои AS ( -- ../рег/регСвед/регСвед_Простои.sql
    SELECT
        регСвед_Простои._Fld25202RRef AS FK_док_ОтчетПроизводстваЗаСмену_Простои
        ,DATEADD(YEAR, -2000, CAST(регСвед_Простои._Fld25199 AS datetime2)) AS Начало_Простои
        ,DATEADD(YEAR, -2000, CAST(регСвед_Простои._Fld25200 AS datetime2)) AS Конец_Простои
        ,регСвед_Простои._Fld25201 AS FK_спр_ПричиныПростоевПроизводственныхЛиний_Простои
    FROM 
        _InfoRg25196 AS регСвед_Простои
)

--------------------------------------------- TABLEPARTS ----------------------------------------------
---

-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------
---
-- ,спр_ПричиныПростоевПроизводственныхЛиний AS ( -- .../.../спр_ПричиныПростоевПроизводственныхЛиний.sql
--     SELECT
--         спр_ПричиныПростоевПроизводственныхЛиний._IDRRef AS ID_спр_ПричиныПростоевПроизводственныхЛиний,
--         спр_ПричиныПростоевПроизводственныхЛиний._Description AS Наименование_спр_ПричиныПростоевПроизводственныхЛиний
--     FROM 
--         _Reference25189 AS спр_ПричиныПростоевПроизводственныхЛиний

--     WHERE
--         спр_ПричиныПростоевПроизводственныхЛиний._Marked = 0
-- )

-------------------------------------------------------------------------------------------------------
---------------------------------------------- PROPS --------------------------------------------------
---
,Props_ТривалістьПростоїв_Простои AS (
    SELECT
        *
        ,CASE 
            WHEN регСвед_Простои.Начало_Простои IS NULL 
            OR регСвед_Простои.Конец_Простои IS NULL 
            OR регСвед_Простои.Конец_Простои <= регСвед_Простои.Начало_Простои
            OR 
                DATEDIFF(
                    MINUTE, регСвед_Простои.Начало_Простои, регСвед_Простои.Конец_Простои
                ) > 720
                THEN 0
            ELSE 
                DATEDIFF(
                    MINUTE, регСвед_Простои.Начало_Простои, регСвед_Простои.Конец_Простои
                )
        END AS DurationMinutes_Простои
    FROM 
        регСвед_Простои
)
---------------------------------------------- JOINS --------------------------------------------------
---
-- ,Join_спр_ПричиныПростоевПроизводственныхЛиний AS (
--     SELECT 
--         *
--     FROM
--         Props_ТривалістьПростоїв_Простои
--         LEFT JOIN 
--             спр_ПричиныПростоевПроизводственныхЛиний
--             ON 
--                 -- Props_ТривалістьПростоїв_Простои.FK_спр_ПричиныПростоевПроизводственныхЛиний_Простои 
--                 0x01010800000000000000EFBBBF7B2255227D -- ХранилищеЗначения. функціонал по причинах ще недороблений
--                     = спр_ПричиныПростоевПроизводственныхЛиний.ID_спр_ПричиныПростоевПроизводственныхЛиний
-- )

SELECT *
FROM Props_ТривалістьПростоїв_Простои