;WITH 



-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------

регсведРемонты AS ( -- ../рег/регСвед/регсведРемонты.sql
    SELECT
        регсведРемонты._Fld24657RRef FK__докОтчетПроизводстваЗаСмену__регсведРемонты
        ,регсведРемонты._Fld24652RRef FK__Подразделение__спрВидыПодразделений_регсведР
        -- ,DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)) 
        --     own__НачалоРемонта_регсведРемонты
        -- ,DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)))
        --     calc__НачалоРемонтаМінусДень_регсведРемонты
        ,регсведРемонты._Fld24655
        ,CASE
            WHEN регсведРемонты._Fld24655 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)) 
        END own__НачалоРемонта_регсведРемонты
        ,CASE
            WHEN регсведРемонты._Fld24655 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)))
        END calc__НачалоРемонтаМінусДень_регсведРемонты
        ,DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24656 AS datetime2)) 
            own__КонецРемонта_регсведРемонты
    FROM 
        _InfoRg24651 AS регсведРемонты
)

---- BASE ---------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
---- TABLEPARTS ---------------------------------------------------------------------------
-- ,Tbpt__
-- ParentID__
---- TABLEPARTS ---------------------------------------------------------------------------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------
----------------------------------------- VIEWS -------------------------------------------

,спр_ВидыПодразделений AS ( -- ../spr/спр_ВидыПодразделений.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений._IDRRef AS ID_ВидыПодразделений__регсведРемонты
        -- imp
        -- ,спр_ВидыПодразделений._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений._Description AS Назва_ВидыПодразделений__регсведРемонты
        -- other
        -- system
        -- ,спр_ВидыПодразделений._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений

    WHERE 
        спр_ВидыПодразделений._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2 (Лінія1)' -- вже нема
)

----------------------------------------- VIEWS -------------------------------------------
-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------- BaseView Joins 1:1 ------------------------------------
-- ,Join__
----------------------------------- BaseView Joins 1:1 ------------------------------------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------- PRJCT ----------
,Join__спр_ВидыПодразделений__регсведРемонты AS (
    SELECT
        *
    FROM
        регсведРемонты
        LEFT JOIN
            спр_ВидыПодразделений
            ON
                регсведРемонты.FK__Подразделение__спрВидыПодразделений_регсведР
                    = спр_ВидыПодразделений.ID_ВидыПодразделений__регсведРемонты
)

,Props__ТривалістьРемонтів__регсведРемонты AS (
    SELECT
        *
        ,CASE 
            WHEN Join__спр_ВидыПодразделений__регсведРемонты.own__НачалоРемонта_регсведРемонты IS NULL 
            OR Join__спр_ВидыПодразделений__регсведРемонты.own__КонецРемонта_регсведРемонты IS NULL 
            OR Join__спр_ВидыПодразделений__регсведРемонты.own__КонецРемонта_регсведРемонты <= Join__спр_ВидыПодразделений__регсведРемонты.own__НачалоРемонта_регсведРемонты
            OR 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений__регсведРемонты.own__НачалоРемонта_регсведРемонты, Join__спр_ВидыПодразделений__регсведРемонты.own__КонецРемонта_регсведРемонты
                ) > 720
                THEN 
                    0
            ELSE 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений__регсведРемонты.own__НачалоРемонта_регсведРемонты, Join__спр_ВидыПодразделений__регсведРемонты.own__КонецРемонта_регсведРемонты
                )
        END AS DurationMinutes_Ремонты
    FROM 
        Join__спр_ВидыПодразделений__регсведРемонты
)

,Props__РемонтЗміна__регсведРемонты AS (
    SELECT
        *
        ,CASE 
            WHEN 
                DATEPART(
                    HOUR, own__НачалоРемонта_регсведРемонты
                ) >= 6 
            AND 
                DATEPART(
                    HOUR, own__НачалоРемонта_регсведРемонты
                ) < 18
                THEN 
                    CONVERT(
                        nvarchar(10), 
                            own__НачалоРемонта_регсведРемонты
                    ) + N', Денна, ' + Назва_ВидыПодразделений__регсведРемонты
            ELSE 
                CASE 
                    WHEN 
                        DATEPART(
                                HOUR, own__НачалоРемонта_регсведРемонты
                        ) >= 18
                        THEN
                        CONVERT(
                            nvarchar(10), 
                                own__НачалоРемонта_регсведРемонты
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведРемонты
                    ELSE
                        CONVERT(
                            nvarchar(10), 
                                calc__НачалоРемонтаМінусДень_регсведРемонты
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведРемонты
                END
        END AS Зміна_Ремонты
    FROM 
        Props__ТривалістьРемонтів__регсведРемонты
)

,Agr__СумаРемонтівПоЗміні__регсведРемонты AS (
    SELECT
        Зміна_Ремонты
        ,SUM(DurationMinutes_Ремонты) AS TotalDurationMinutes_Ремонты
    FROM 
        Props__РемонтЗміна__регсведРемонты
    GROUP BY
        Зміна_Ремонты
)

---------------------------------------------------------- ProjectJoin --------------------
-- ,Join__
-------------------------------------------------------------------------- PRJCT ----------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Projects Vizes ----------
-- ,Viz__
----------------------------------------------------------------- Projects Vizes ----------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Working Vizes -----------
,working__Main AS (
    SELECT  
        *
    FROM
        Agr__СумаРемонтівПоЗміні__регсведРемонты
)

,working AS (
    SELECT
        working__Main.Зміна_Ремонты
        ,working__Main.TotalDurationMinutes_Ремонты
    FROM
        working__Main
)
----------------------------------------------------------------- Working Vizes -----------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
----------------------------------------------------------------- SELECTS -----------------
SELECT *
FROM working

-- WHERE
--     Props__СумаРемонтівПоЗміні__регсведРемонты.Назва_ВидыПодразделений__регсведРемонты = 'Цех №7 (Лінія1) прихід червень 2024'

ORDER BY 
    Зміна_Ремонты DESC
----------------------------------------------------------------- SELECTS -----------------
-------------------------------------------------------------------------------------------