;WITH 

-------------------------------------------------------------------------------------------------------
---------------------------------------------- BASE ---------------------------------------------------
---
регСвед_ЦеныНоменклатуры AS ( -- .../.../регСвед_ЦеныНоменклатуры.sql
    SELECT
        регСвед_ЦеныНоменклатуры._RecorderRRef AS Регистратор_регСвед_ЦеныНоменклатуры
        ,регСвед_ЦеныНоменклатуры._RecorderTRef AS TRef_регСвед_ЦеныНоменклатуры
        ,регСвед_ЦеныНоменклатуры._Fld20421RRef AS FK_спр_Номенклатура_регСвед_ЦеныНоменклатуры
        ,DATEADD(YEAR,-2000,регСвед_ЦеныНоменклатуры._Period) AS Период_регСвед_ЦеныНоменклатуры
        ,регСвед_ЦеныНоменклатуры._Fld20424 AS Цена_регСвед_ЦеныНоменклатуры
    FROM 
        _InfoRg20419 AS регСвед_ЦеныНоменклатуры

    WHERE регСвед_ЦеныНоменклатуры._Active = 1
)
--------------------------------------------- TABLEPARTS ----------------------------------------------
---

-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------
---
,спр_Номенклатура AS ( -- ../спр/спр_Номенклатура.sql
    SELECT
        спр_Номенклатура._IDRRef AS ID_спр_Номенклатура
        ,спр_Номенклатура._Code AS НоменклатураCode
        ,спр_Номенклатура._Description AS НазваНоменклатури
        ,спр_Номенклатура._Marked AS ПоміткаВидаленняНоменклатури
        ,спр_Номенклатура._Folder AS ГрупаНоменклатури

        ,спр_Номенклатура._Fld2306RRef AS FK_ВидНоменклатурьі_Номенклатура
        ,спр_Номенклатура._Fld23716 AS КількістьВУпаковці_Номенклатура
        ,спр_Номенклатура._Fld25116RRef AS FK_Проект_КаналЗбуту_Номенклатура
    FROM _Reference149 AS спр_Номенклатура
)

-------------------------------------------------------------------------------------------------------
---------------------------------------------- PROPS --------------------------------------------------
---
,Agregat_МаксимальнаЦіна_регсведЦеныНоменклатуры AS (
    SELECT 
        регСвед_ЦеныНоменклатуры.FK_спр_Номенклатура_регСвед_ЦеныНоменклатуры
        ,MAX(регСвед_ЦеныНоменклатуры.Цена_регСвед_ЦеныНоменклатуры) 
            AS МаксимальнаЦіна_регСвед_ЦеныНоменклатуры
    FROM   
        регСвед_ЦеныНоменклатуры
    GROUP BY
        регСвед_ЦеныНоменклатуры.FK_спр_Номенклатура_регСвед_ЦеныНоменклатуры
)

,Viz_регСвед_ЦеныНоменклатуры AS (
    SELECT
        спр_Номенклатура.НазваНоменклатури
        ,Agregat_МаксимальнаЦіна_регсведЦеныНоменклатуры.МаксимальнаЦіна_регСвед_ЦеныНоменклатуры
    FROM   
        Agregat_МаксимальнаЦіна_регсведЦеныНоменклатуры
        LEFT JOIN
            спр_Номенклатура
            ON 
                спр_Номенклатура.ID_спр_Номенклатура 
                    = Agregat_МаксимальнаЦіна_регсведЦеныНоменклатуры.FK_спр_Номенклатура_регСвед_ЦеныНоменклатуры
)
---------------------------------------------- JOINS --------------------------------------------------
---

SELECT * FROM Viz_регСвед_ЦеныНоменклатуры