;WITH 



-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------

регсведПереходы AS ( -- ../рег/регСвед/регсведПереходы.sql
    SELECT
        регсведПереходы._Fld25191RRef FK__Подразделение__спрВидыПодразделений_регсведР
        -- ,DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)) 
        --     own__НачалоПерехода_регсведПереходы
        -- ,DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)))
        --     calc__НачалоПереходаМінусДень_регсведПереходы
        ,регсведПереходы._Fld25193
        ,CASE
            WHEN регсведПереходы._Fld25193 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)) 
        END own__НачалоПерехода_регсведПереходы
        ,CASE
            WHEN регсведПереходы._Fld25193 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)))
        END calc__НачалоПереходаМінусДень_регсведПереходы
        ,DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25194 AS datetime2)) 
            own__КонецПерехода_регсведПереходы
    FROM 
        _InfoRg25190 AS регсведПереходы
)

---- BASE ---------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
---- TABLEPARTS ---------------------------------------------------------------------------
-- ,Tbpt__
-- ParentID__
---- TABLEPARTS ---------------------------------------------------------------------------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------
----------------------------------------- VIEWS -------------------------------------------

,спр_ВидыПодразделений_Пер AS ( -- ../spr/спр_ВидыПодразделений_Пер.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений_Пер._IDRRef AS ID_ВидыПодразделений__регсведПереходы
        -- imp
        -- ,спр_ВидыПодразделений_Пер._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений_Пер._Description AS Назва_ВидыПодразделений__регсведПереходы
        -- other
        -- system
        -- ,спр_ВидыПодразделений_Пер._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений_Пер

    WHERE 
        спр_ВидыПодразделений_Пер._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений_Пер._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений_Пер._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений_Пер._Description <> 'Цех №2 (Лінія1)' -- вже нема
)

----------------------------------------- VIEWS -------------------------------------------
-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------- BaseView Joins 1:1 ------------------------------------
-- ,Join__
----------------------------------- BaseView Joins 1:1 ------------------------------------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------- PRJCT ----------
,Join__спр_ВидыПодразделений_Пер__регсведПереходы AS (
    SELECT
        *
    FROM
        регсведПереходы
        LEFT JOIN
            спр_ВидыПодразделений_Пер
            ON
                регсведПереходы.FK__Подразделение__спрВидыПодразделений_регсведР
                    = спр_ВидыПодразделений_Пер.ID_ВидыПодразделений__регсведПереходы
)

,Props__ТривалістьПереходів__регсведПереходы AS (
    SELECT
        *
        ,CASE 
            WHEN Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы IS NULL 
            OR Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы IS NULL 
            OR Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы <= Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы
            OR 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы
                ) > 720
                THEN 
                    0
            ELSE 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы
                )
        END AS DurationMinutes_Переходы
    FROM 
        Join__спр_ВидыПодразделений_Пер__регсведПереходы
)

,Props__ПереходЗміна__регсведПереходы AS (
    SELECT
        *
        ,CASE 
            WHEN 
                DATEPART(
                    HOUR, own__НачалоПерехода_регсведПереходы
                ) >= 6 
            AND 
                DATEPART(
                    HOUR, own__НачалоПерехода_регсведПереходы
                ) < 18
                THEN 
                    CONVERT(
                        nvarchar(10), 
                            own__НачалоПерехода_регсведПереходы
                    ) + N', Денна, ' + Назва_ВидыПодразделений__регсведПереходы
            ELSE 
                CASE 
                    WHEN 
                        DATEPART(
                                HOUR, own__НачалоПерехода_регсведПереходы
                        ) >= 18
                        THEN
                        CONVERT(
                            nvarchar(10), 
                                own__НачалоПерехода_регсведПереходы
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПереходы
                    ELSE
                        CONVERT(
                            nvarchar(10), 
                                calc__НачалоПереходаМінусДень_регсведПереходы
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПереходы
                END
        END AS Зміна_Переходы
    FROM 
        Props__ТривалістьПереходів__регсведПереходы
)

,Agr__СумаПереходівПоЗміні__регсведПереходы AS (
    SELECT
        Зміна_Переходы
        ,SUM(DurationMinutes_Переходы) AS TotalDurationMinutes_Переходы
    FROM 
        Props__ПереходЗміна__регсведПереходы
    GROUP BY
        Зміна_Переходы
)

---------------------------------------------------------- ProjectJoin --------------------
-- ,Join__
-------------------------------------------------------------------------- PRJCT ----------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Projects Vizes ----------
-- ,Viz__
----------------------------------------------------------------- Projects Vizes ----------
-------------------------------------------------------------------------------------------

-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Working Vizes -----------
,working__Main AS (
    SELECT  
        *
    FROM
        Agr__СумаПереходівПоЗміні__регсведПереходы
)

,working AS (
    SELECT
        working__Main.Зміна_Переходы
        ,working__Main.TotalDurationMinutes_Переходы
    FROM
        working__Main
)
----------------------------------------------------------------- Working Vizes -----------
-------------------------------------------------------------------------------------------



-------------------------------------------------------------------------------------------
----------------------------------------------------------------- SELECTS -----------------
SELECT *
FROM working

-- WHERE
--     Props__СумаПереходівПоЗміні__регсведПереходы.Назва_ВидыПодразделений__регсведПереходы = 'Цех №7 (Лінія1) прихід червень 2024'

ORDER BY 
    Зміна_Переходы DESC
----------------------------------------------------------------- SELECTS -----------------
-------------------------------------------------------------------------------------------