;WITH 

-------------------------------------------------------------------------------------------------------
---------------------------------------------- BASE ---------------------------------------------------
---
регНак_ТоварыНаСкладах AS ( -- .../.../регНак_ТоварыНаСкладах.sql
    SELECT
        -- PK
        -- нема
        -- FK
        регНак_ТоварыНаСкладах._RecorderRRef AS FK_регНак_ТоварыНаСкладах
        ,регНак_ТоварыНаСкладах._RecorderTRef AS TRef_регНак_ТоварыНаСкладах
        ,регНак_ТоварыНаСкладах._Fld22375RRef AS FK_спр_Номенклатура_ТоварыНаСкладах
        ,регНак_ТоварыНаСкладах._Fld22374RRef AS FK_спр_Склады_ТоварыНаСкладах
        -- imp
        ,регНак_ТоварыНаСкладах._Period AS Период_ТоварыНаСкладах
        -- other
        ,регНак_ТоварыНаСкладах._Fld22379 AS Количество_ТоварыНаСкладах
        ,регНак_ТоварыНаСкладах._RecordKind AS RecordKind_ТоварыНаСкладах -- 0 - приход, 1 - расход
        -- system
        ,регНак_ТоварыНаСкладах._Active AS Активность_ТоварыНаСкладах
    FROM 
        _AccumRg22373 AS регНак_ТоварыНаСкладах
)

--------------------------------------------- TABLEPARTS ----------------------------------------------
---

-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------
---
,спр_Номенклатура AS ( -- ../спр/спр_Номенклатура.sql
    SELECT
        спр_Номенклатура._IDRRef AS ID_спр_Номенклатура
        ,спр_Номенклатура._Code AS НоменклатураCode
        ,спр_Номенклатура._Description AS НазваНоменклатури
        ,спр_Номенклатура._Marked AS ПоміткаВидаленняНоменклатури
        ,спр_Номенклатура._Folder AS ГрупаНоменклатури

        ,спр_Номенклатура._Fld2306RRef AS FK_ВидНоменклатурьі_Номенклатура
        ,спр_Номенклатура._Fld23716 AS КількістьВУпаковці_Номенклатура
        ,спр_Номенклатура._Fld25116RRef AS FK_Проект_КаналЗбуту_Номенклатура
    FROM _Reference149 AS спр_Номенклатура
)

-------------------------------------------------------------------------------------------------------
-------------------------------------------- BASEJOINS ------------------------------------------------
---
------------------------------------------ BASEJOINSJOINS ---------------------------------------------
---
-------------------------------------------- PROPSCALC ------------------------------------------------
---
,Agregat_SumByEachNomenklatura_ТоварыНаСкладах AS (
    SELECT
        регНак_ТоварыНаСкладах.FK_спр_Номенклатура_ТоварыНаСкладах
        ,регНак_ТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах
        ,SUM(
            IIF(
                регНак_ТоварыНаСкладах.RecordKind_ТоварыНаСкладах = 1,
                -регНак_ТоварыНаСкладах.Количество_ТоварыНаСкладах,
                регНак_ТоварыНаСкладах.Количество_ТоварыНаСкладах
            )
        ) AS SumByEachNomenklatura_ТоварыНаСкладах
    FROM
        регНак_ТоварыНаСкладах

    GROUP BY
        регНак_ТоварыНаСкладах.FK_спр_Номенклатура_ТоварыНаСкладах
        ,регНак_ТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах
    
    HAVING регНак_ТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах = 0xB2B0001A64C7AAC211E781AB2E318DA9
    -- склад готової продукції (основний)
)
--------------------------------------------- PROPSVIZ ------------------------------------------------



-------------------------------------------------------------------------------------------------------
---------------------------------------------- ALLJOIN ------------------------------------------------
---
---------------------------------------------- ALLVIZ -------------------------------------------------
---
,Viz_SumByEachNomenklatura_ТоварыНаСкладах AS (
    SELECT
        спр_Номенклатура.НазваНоменклатури
        ,Agregat_SumByEachNomenklatura_ТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах
        ,спр_Склады._Description 
        ,ISNULL(Agregat_SumByEachNomenklatura_ТоварыНаСкладах.SumByEachNomenklatura_ТоварыНаСкладах, 0) 
            AS SumByEachNomenklatura_ТоварыНаСкладах
    FROM 
        Agregat_SumByEachNomenklatura_ТоварыНаСкладах
        LEFT JOIN
            спр_Номенклатура
                ON Agregat_SumByEachNomenklatura_ТоварыНаСкладах.FK_спр_Номенклатура_ТоварыНаСкладах = спр_Номенклатура.ID_спр_Номенклатура
        JOIN   
        _Reference199 AS спр_Склады 
        ON 
            спр_Склады._IDRRef = Agregat_SumByEachNomenklatura_ТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах

)


SELECT * FROM Agregat_SumByEachNomenklatura_ТоварыНаСкладах
-- SELECT * FROM Viz_SumByEachNomenklatura_ТоварыНаСкладах
-- WHERE SumByEachNomenklatura_ТоварыНаСкладах <> 0
ORDER BY НазваНоменклатури ASC