;WITH 

-------------------------------------------------------------------------------------------------------
---------------------------------------------- BASE ---------------------------------------------------
---
регнакПродажиСебестоимость AS ( -- .../.../регнакПродажиСебестоимость.sql
    SELECT
        регнакПродажиСебестоимость._RecorderRRef FK_Регистратор_регнакПродажиСебестоимость
        --,регнакПродажиСебестоимость._RecorderTRef TRef_Регистратор_регнакПродажиСебестоимость
        ,регнакПродажиСебестоимость._Fld22067_RRRef FK_ДокументОприходования_регнакПродажиСебестоимость
            -- це FK_докОтчетПроизводстваЗаСмену..
        --,регнакПродажиСебестоимость._Fld22067_TYPE TYPE_ДокументОприходования_регнакПродажиСебестоимость
        --,регнакПродажиСебестоимость._Fld22074_RTRef RTRef_ДокументОприходования_регнакПродажиСебестоимость
        ,регнакПродажиСебестоимость._Fld22064RRef FK_Номенклатура_регнакПродажиСебестоимость
        ,регнакПродажиСебестоимость._Period Период_регнакПродажиСебестоимость
        ,регнакПродажиСебестоимость._Fld22071 Количество_регнакПродажиСебестоимость
        ,регнакПродажиСебестоимость._Fld22072 Стоимость_регнакПродажиСебестоимость
        --,регнакПродажиСебестоимость._Active Активность_регнакПродажиСебестоимость
    FROM 
        _AccumRg22063 AS регнакПродажиСебестоимость
    WHERE
        регнакПродажиСебестоимость._Active = 1
)
--------------------------------------------- TABLEPARTS ----------------------------------------------
---


-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------

---


-------------------------------------------------------------------------------------------------------
---------------------------------------------- OPS ----------------------------------------------------

---
,Props_ВартістьОдиниці_регнакПродажиСебестоимость AS (
    SELECT
        *
        ,CASE 
            WHEN Количество_регнакПродажиСебестоимость = 0 THEN 0
            ELSE Стоимость_регнакПродажиСебестоимость / Количество_регнакПродажиСебестоимость
        END AS ВартістьОдиниці_регнакПродажиСебестоимость
    FROM
        регнакПродажиСебестоимость
)
,Props_ПорядокПеріодів_регнакПродажиСебестоимость AS (
    SELECT
        *
        ,ROW_NUMBER() OVER (
            PARTITION BY FK_Номенклатура_регнакПродажиСебестоимость
            ORDER BY Период_регнакПродажиСебестоимость DESC
        ) AS rn
    FROM Props_ВартістьОдиниці_регнакПродажиСебестоимость
)
--------
,Agregat_КрайняЦіна_регнакПродажиСебестоимость AS (
    SELECT
        *
    FROM
        Props_ПорядокПеріодів_регнакПродажиСебестоимость
    WHERE
        rn = 1
)
--------

SELECT * FROM Agregat_КрайняЦіна_регнакПродажиСебестоимость