;WITH 

регНак_ЗатратыНаВыпускПродукции AS (
    SELECT
        регНак_ЗатратыНаВыпускПродукции._RecorderRRef MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции._Period AS Период_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции._Fld21046RRef AS FK_спр_ВидыПодразделений_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции._Fld21048RRef AS FK_Номенклатура_спр_Номенклатура_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции._Fld21054RRef AS FK_спр_СтатьиЗатрат_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции._Fld21055_RRRef AS FK_Затрата_спр_Номенклатура_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции._Fld21061 AS Количество_ЗатратыНаВыпускПродукции
    FROM 
        _AccumRg21045 AS регНак_ЗатратыНаВыпускПродукции

    
    WHERE 
        регНак_ЗатратыНаВыпускПродукции._Active = 1
        AND
        регНак_ЗатратыНаВыпускПродукции._Fld21055_RTRef = 0x00000095 -- інші це 2017/2018 без значень
)

,spr_Nomenklatura AS ( -- ../spr/spr_Nomenklatura.sql
    SELECT
        spr_Nomenklatura._IDRRef AS НоменклатураID
        ,spr_Nomenklatura._Code AS НоменклатураCode
        ,spr_Nomenklatura._Description AS НазваНоменклатури
        ,spr_Nomenklatura._Marked AS ПоміткаВидаленняНоменклатури
        ,spr_Nomenklatura._Folder AS ГрупаНоменклатури

        ,spr_Nomenklatura._Fld2306RRef AS FK_ВидНоменклатурьі_Номенклатура
        ,spr_Nomenklatura._Fld23716 AS КількістьВУпаковці_Номенклатура
        ,spr_Nomenklatura._Fld25116RRef AS FK_Проект_КаналЗбуту_Номенклатура
    FROM _Reference149 AS spr_Nomenklatura
)

,Props_Count_ЗатратыНаВыпускПродукции AS (
    SELECT
        регНак_ЗатратыНаВыпускПродукции.MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции.FK_Затрата_спр_Номенклатура_ЗатратыНаВыпускПродукции
        ,COUNT(*) AS Count_ЗатратыНаВыпускПродукции
    FROM 
        регНак_ЗатратыНаВыпускПродукции

    GROUP BY 
        регНак_ЗатратыНаВыпускПродукции.MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции.FK_Затрата_спр_Номенклатура_ЗатратыНаВыпускПродукции
    HAVING 
        COUNT(*) > 1
)

,спр_СтатьиЗатрат AS ( -- ../spr/спр_СтатьиЗатрат.sql
    SELECT
        спр_СтатьиЗатрат._IDRRef AS ID_СтатьиЗатрат
        ,спр_СтатьиЗатрат._Code AS Код_СтатьиЗатрат
        ,спр_СтатьиЗатрат._Description AS Наименование_СтатьиЗатрат
        ,спр_СтатьиЗатрат._Marked AS ПометкаУдаления_СтатьиЗатрат
    FROM _Reference216 AS спр_СтатьиЗатрат
)

,Props_Brak_ЗатратыНаВыпускПродукции AS (
    SELECT
        регНак_ЗатратыНаВыпускПродукции.MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции.Период_ЗатратыНаВыпускПродукции
        ,spr_Nomenklatura.НазваНоменклатури AS Позиція
        ,SUM (
            CASE 
                WHEN спр_СтатьиЗатрат.Наименование_СтатьиЗатрат LIKE '%Технологічні%'
                    THEN Количество_ЗатратыНаВыпускПродукции
                ELSE 0
            END
        ) AS брак

        ,SUM (
            CASE 
                WHEN NOT спр_СтатьиЗатрат.Наименование_СтатьиЗатрат LIKE '%Технологічні%'
                    THEN Количество_ЗатратыНаВыпускПродукции
                ELSE 0
            END
        ) AS безБраку

        ,SUM(Количество_ЗатратыНаВыпускПродукции) AS все

        ,SUM (
            CASE 
                WHEN спр_СтатьиЗатрат.Наименование_СтатьиЗатрат = 'Технологічні витрати (сировина)'
                    THEN Количество_ЗатратыНаВыпускПродукции
                ELSE 0
            END
        ) 
        /
        NULLIF(
            SUM(
                Количество_ЗатратыНаВыпускПродукции
            ), 
        0) 
        * 100.0 AS ВідсотокБраку

    FROM регНак_ЗатратыНаВыпускПродукции
        LEFT JOIN спр_СтатьиЗатрат
            ON регНак_ЗатратыНаВыпускПродукции.FK_спр_СтатьиЗатрат_ЗатратыНаВыпускПродукции = спр_СтатьиЗатрат.ID_СтатьиЗатрат
        LEFT JOIN spr_Nomenklatura 
            ON регНак_ЗатратыНаВыпускПродукции.FK_Затрата_спр_Номенклатура_ЗатратыНаВыпускПродукции 
                = spr_Nomenklatura.НоменклатураID
    
    GROUP BY
    регНак_ЗатратыНаВыпускПродукции.MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции
    ,spr_Nomenklatura.НазваНоменклатури
    ,регНак_ЗатратыНаВыпускПродукции.Период_ЗатратыНаВыпускПродукции
    
    HAVING COUNT(*) > 1   -- тільки ті, де є брак
)

,PropsViz_ЗатратыНаВыпускПродукции AS (
    SELECT
        регНак_ЗатратыНаВыпускПродукции.MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции.Количество_ЗатратыНаВыпускПродукции
        ,spr_Nomenklatura_Номенклатура.НазваНоменклатури AS НазваНоменклатури_ЗатратыНаВыпускПродукции
        ,spr_Nomenklatura_Затрата.НазваНоменклатури AS НазваЗатрати_ЗатратыНаВыпускПродукции
    FROM регНак_ЗатратыНаВыпускПродукции
        LEFT JOIN spr_Nomenklatura spr_Nomenklatura_Номенклатура
            ON регНак_ЗатратыНаВыпускПродукции.FK_Номенклатура_спр_Номенклатура_ЗатратыНаВыпускПродукции 
                = spr_Nomenklatura_Номенклатура.НоменклатураID
        LEFT JOIN spr_Nomenklatura spr_Nomenklatura_Затрата
            ON регНак_ЗатратыНаВыпускПродукции.FK_Затрата_спр_Номенклатура_ЗатратыНаВыпускПродукции 
                = spr_Nomenklatura_Затрата.НоменклатураID
        
)

SELECT TOP 100 * FROM Props_Brak_ЗатратыНаВыпускПродукции
ORDER BY Период_ЗатратыНаВыпускПродукции DESC