;WITH 
-- VIEWS START -----------------------------------------------------------------------
-- VIEWS END -------------------------------------------------------------------------
-- BASE START ------------------------------------------------------------------------
example AS ( -- .../.../example.sql
    SELECT
        -- example._IDRRef ID__Ссылка__example
        *
        -- FK
        -- imp (important)
        -- own
        -- ,example._Description own__Наименование__example
        -- oth (other)
        -- sys (system)
        -- calc (calculated)
    FROM 
        _Acc23 AS example

    -- WHERE
    --     example._Posted = 1 -- проведений
    --     AND
    --     example._Marked = 0 -- не помічений на видалення
    --     AND
    --     example._Active = 1 -- активний
)
-- BASE END --------------------------------------------------------------------------
-- TABLEPARTS START ------------------------------------------------------------------
-- TABLEPARTS END --------------------------------------------------------------------
-- BaseView Joins 1:1 START ----------------------------------------------------------
-- BaseView Joins 1:1 END ------------------------------------------------------------
-- PRJCT START -----------------------------------------------------------------------
-- PRJCT END -------------------------------------------------------------------------
-- Working Vizes START ---------------------------------------------------------------
SELECT * FROM example
-- Working Vizes END -----------------------------------------------------------------