SELECT 

    регНак_Продажи.Рік,
    регНак_Продажи.Місяць,
    регНак_Продажи.День,
    регНак_Продажи.ДатаДокумента,
    регНак_Продажи.Контрагент,
    регНак_Продажи.Номенклатура,
    регНак_Продажи.ЗаказПокупателя,
    регНак_Продажи.Договір,
    SUM(регНак_Продажи.Кількість) AS Кількість,
    SUM(регНак_Продажи.Вартість) AS Сума,
    спр_Пользователи._Code AS Менеджер

FROM (
    SELECT 
        YEAR(регНак_Продажи._Period) - 2000 AS Рік,
        MONTH(регНак_Продажи._Period) AS Місяць,
        DAY(регНак_Продажи._Period) AS День,
        DATEFROMPARTS(YEAR(регНак_Продажи._Period) - 2000, MONTH(регНак_Продажи._Period), DAY(регНак_Продажи._Period)) AS ДатаДокумента,

        спр_Номенклатура._Code AS Номенклатура,
        спр_Контрагенты._Code AS Контрагент,
        док_ЗаказПокупателя._Number AS ЗаказПокупателя,
        спр_ДоговорыКонтрагентов._Description AS Договір,

        регНак_Продажи._Fld22012 AS Кількість,
        регНак_Продажи._Fld22013 AS Вартість,

        /* менеджер договору на дату руху */
        (
            SELECT TOP 1 регСвед_МенеджерыПоДоговорамКонтрагентов._Fld23642RRef
            FROM 
                _InfoRg23640 регСвед_МенеджерыПоДоговорамКонтрагентов
            WHERE 
                регСвед_МенеджерыПоДоговорамКонтрагентов._Fld23641RRef 
                    = регНак_Продажи._Fld22006RRef  -- договір
                AND 
                регСвед_МенеджерыПоДоговорамКонтрагентов._Period 
                    <= регНак_Продажи._Period
            ORDER BY 
                регСвед_МенеджерыПоДоговорамКонтрагентов._Period 
                DESC
        ) AS manager
    FROM 
        _AccumRg22002 AS регНак_Продажи
        /* ❗ залишаємо лише рухи, у яких реєстратор — Реалізація (Document505) */
        INNER JOIN 
            _Document505 AS док_РеализацияТоваровУслуг  
            ON док_РеализацияТоваровУслуг._IDRRef = регНак_Продажи._RecorderRRef
        JOIN 
            _Reference120 AS спр_Контрагенты   
            ON спр_Контрагенты._IDRRef = регНак_Продажи._Fld22011RRef
        JOIN 
            _Reference149 AS спр_Номенклатура   
            ON спр_Номенклатура._IDRRef = регНак_Продажи._Fld22003RRef
        LEFT JOIN 
            _Document316 AS док_ЗаказПокупателя 
            ON док_ЗаказПокупателя._IDRRef = регНак_Продажи._Fld22005_RRRef
        LEFT JOIN 
            _Reference82 AS спр_ДоговорыКонтрагентов  
            ON спр_ДоговорыКонтрагентов._IDRRef = регНак_Продажи._Fld22006RRef

    WHERE 
        регНак_Продажи._Active = 1
        AND CAST(DATEADD(YEAR,-2000, регНак_Продажи._Period) AS date) >= DATEFROMPARTS(2025,1,1)

) AS регНак_Продажи
    LEFT JOIN 
        _Reference174 AS спр_Пользователи 
            ON спр_Пользователи._IDRRef = регНак_Продажи.manager

GROUP BY
    регНак_Продажи.Контрагент, регНак_Продажи.Номенклатура, регНак_Продажи.ЗаказПокупателя, регНак_Продажи.Договір,
    регНак_Продажи.Рік, регНак_Продажи.Місяць, регНак_Продажи.День, регНак_Продажи.ДатаДокумента, спр_Пользователи._Code;
