;WITH 


-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------

--- type_name_dependency
докЗаказНаПроизводство AS ( -- .../.../докЗаказНаПроизводство.sql
    SELECT
        -- PK
        докЗаказНаПроизводство._IDRRef ID__Ссылка__докЗаказНаПроизводство
        -- FK
        -- imp
        ,DATEADD(YEAR, -2000, докЗаказНаПроизводство._Date_Time) imp__Дата__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Number imp__Номер__докЗаказНаПроизводство
        -- other
        -- system
        ,докЗаказНаПроизводство._Posted sys__Проведен__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Marked sys__ПометкаУдаления__докЗаказНаПроизводство
    FROM 
        _Document315 AS докЗаказНаПроизводство

    WHERE
        докЗаказНаПроизводство._Posted = 1
        AND
        докЗаказНаПроизводство._Marked = 0
)

,Tbpt__Продукция__докЗНП AS (
    SELECT
        *
    FROM (
        SELECT
            _Document315_IDRRef AS ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП,
            _Fld5477RRef AS FK_спрНоменклатура_Tbpt__Продукция__докЗНП,
            _Fld5486_RRRef AS FK_Заказ_Tbpt__Продукция__докЗНП,
            _Fld23758RRef AS FK_Статус_Tbpt__Продукция__докЗНП,
            _Fld5481 AS Кількість_Tbpt__Продукция__докЗНП,
            CASE 
                WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 'Виконано'
                WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 'В роботі'
                WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 'Новий'
                ELSE '-'
            END AS Статус_Tbpt__Продукция__докЗНП,
            ROW_NUMBER() OVER(
                PARTITION BY _Fld5486_RRRef, _Fld5477RRef
                ORDER BY 
                    CASE 
                        WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 1  -- Виконано
                        WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 2  -- В роботі
                        WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 3  -- Новий
                        ELSE 4
                    END
            ) AS rn__докЗНП
        FROM _Document315_VT5475
    ) t
    WHERE rn__докЗНП = 1
)

,Join__Tbpt_Продукция__докЗНП AS (
    SELECT
        *
        ,CASE 
            WHEN Статус_Tbpt__Продукция__докЗНП = 'В роботі'
                THEN Кількість_Tbpt__Продукция__докЗНП
            ELSE 0
        END AS Кількість_Tbpt__Продукция__докЗНП_Вроботі
        ,CASE 
            WHEN Статус_Tbpt__Продукция__докЗНП = 'Виконано'
                THEN Кількість_Tbpt__Продукция__докЗНП
            ELSE 0
        END AS Кількість_Tbpt__Продукция__докЗНП_Виконано
    FROM
        докЗаказНаПроизводство
        LEFT JOIN 
            Tbpt__Продукция__докЗНП 
            ON докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство 
                = Tbpt__Продукция__докЗНП.ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП
    
    WHERE 
    --     Статус_Tbpt__Продукция__докЗНП = 'В роботі'
    -- -- WHERE Статус_Tbpt__Продукция__докЗНП = 'Виконано'
    --     AND
        докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство <> 0xA66C0050569F1E6A11EF8A2413FC71A6 -- там помилка в базі

)

-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------
---

-------------------------------------------------------------------------------------------------------
----------------------------------------------- OPS ---------------------------------------------------
---




SELECT * FROM Join__Tbpt_Продукция__докЗНП