;WITH 
докЗаказПокупателя AS (
    SELECT
        докЗаказПокупателя._IDRRef AS ID_докЗаказПокупателя
        ,DATEADD(YEAR, -2000, докЗаказПокупателя._Date_Time) AS Дата_докЗаказПокупателя
        ,докЗаказПокупателя._Number AS Номер_докЗаказПокупателя
        ,докЗаказПокупателя._Fld24458RRef AS FK_спрСтатусыЗаказовПокупателя_докЗаказПокупателя
        ,докЗаказПокупателя._Fld5546RRef AS FK_спрКонтрагенты_докЗаказПокупателя
        ,докЗаказПокупателя._Fld5536RRef AS FK_ВалютаДокумента_докЗаказПокупателя
        ,DATEADD(YEAR, -2000, CAST(докЗаказПокупателя._Fld5540 AS datetime2)) AS ДатаОтгрузки_докЗаказПокупателя
        ,докЗаказПокупателя._Posted AS Проведен_докЗаказПокупателя
        ,докЗаказПокупателя._Marked AS ПометкаУдаления_докЗаказПокупателя
    FROM 
        _Document316 AS докЗаказПокупателя
    WHERE 
        докЗаказПокупателя._Posted = 1 
        AND 
        докЗаказПокупателя._Marked = 0
        AND
        докЗаказПокупателя._Date_Time >= '4025-01-01' -- надто величезні масштаби даних, щоб виводити всі роки (це вже 65к)
)
,TbptТовары__докЗПок AS (
    SELECT
        TbptТовары__докЗПок._Document316_IDRRef AS FK_докЗаказПокупателя_TbptТовары__докЗПок
        ,TbptТовары__докЗПок._Fld5576RRef AS FK_спрНоменклатура_TbptТовары__докЗПок
        ,TbptТовары__докЗПок._Fld22909 AS СначалаЗаказано_TbptТовары__докЗПок
        ,TbptТовары__докЗПок._Fld5585 AS Цена_TbptТовары__докЗПок
    FROM 
        _Document316_VT5569 AS TbptТовары__докЗПок
)
,Join__TbptТовары__докЗПок AS (
    SELECT
        *
    FROM 
        докЗаказПокупателя
        LEFT JOIN
            TbptТовары__докЗПок 
            ON докЗаказПокупателя.ID_докЗаказПокупателя
                = TbptТовары__докЗПок.FK_докЗаказПокупателя_TbptТовары__докЗПок 
)
,регнакПродажи AS (
    SELECT
        регнакПродажи._RecorderRRef AS FK_Recorder_Продажи
        ,регнакПродажи._Fld22003RRef AS FK_спрНоменклатура_Продажи
        ,регнакПродажи._Fld22005_RRRef AS FK_докЗаказПокупателя_Продажи
        ,регнакПродажи._Period AS Период_Продажи
        ,регнакПродажи._Fld22012 AS Количество_Продажи
    FROM 
        _AccumRg22002 AS регнакПродажи
    WHERE 
        регнакПродажи._Active = 1
)
,докЗаказНаПроизводство AS (
    SELECT
        докЗаказНаПроизводство._IDRRef ID__Ссылка__докЗаказНаПроизводство
        ,DATEADD(YEAR, -2000, докЗаказНаПроизводство._Date_Time) imp__Дата__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Number imp__Номер__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Posted sys__Проведен__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Marked sys__ПометкаУдаления__докЗаказНаПроизводство
    FROM 
        _Document315 AS докЗаказНаПроизводство
    WHERE
        докЗаказНаПроизводство._Posted = 1
        AND
        докЗаказНаПроизводство._Marked = 0
)
,TbptПродукция__докЗНП AS (
    SELECT
        *
    FROM (
        SELECT
            _Document315_IDRRef AS ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП,
            _Fld5477RRef AS FK_спрНоменклатура_TbptПродукция__докЗНП,
            _Fld5486_RRRef AS FK_Заказ_TbptПродукция__докЗНП,
            _Fld23758RRef AS FK_Статус_TbptПродукция__докЗНП,
            _Fld5481 AS Кількість_TbptПродукция__докЗНП,
            CASE 
                WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 'Виконано'
                WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 'В роботі'
                WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 'Новий'
                ELSE '-'
            END AS Статус_TbptПродукция__докЗНП,
            ROW_NUMBER() OVER(
                PARTITION BY _Fld5486_RRRef, _Fld5477RRef
                ORDER BY 
                    CASE 
                        WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 1  -- Виконано
                        WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 2  -- В роботі
                        WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 3  -- Новий
                        ELSE 4
                    END
            ) AS rn__докЗНП
        FROM _Document315_VT5475
    ) t
    WHERE rn__докЗНП = 1
)
,Join__TbptПродукция__докЗНП AS (
    SELECT
        *
        ,CASE 
            WHEN Статус_TbptПродукция__докЗНП = 'В роботі'
                THEN Кількість_TbptПродукция__докЗНП
            ELSE 0
        END AS Кількість_TbptПродукция__докЗНП_Вроботі
        ,CASE 
            WHEN Статус_TbptПродукция__докЗНП = 'Виконано'
                THEN Кількість_TbptПродукция__докЗНП
            ELSE 0
        END AS Кількість_TbptПродукция__докЗНП_Виконано
    FROM
        докЗаказНаПроизводство
        LEFT JOIN 
            TbptПродукция__докЗНП 
            ON докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство 
                = TbptПродукция__докЗНП.ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП
    WHERE 
        докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство <> 0xA66C0050569F1E6A11EF8A2413FC71A6 -- там помилка в базі
)
,регнакТоварыНаСкладах AS (
    SELECT
        регнакТоварыНаСкладах._RecorderRRef AS FK_Регистратор_регнакТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22375RRef AS FK_спрНоменклатура_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22374RRef AS FK_спр_Склады_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._Period AS Период_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22379 AS Количество_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._RecordKind AS RecordKind_ТоварыНаСкладах -- 0 - приход, 1 - расход
    FROM 
        _AccumRg22373 AS регнакТоварыНаСкладах
    WHERE
        регнакТоварыНаСкладах._Active = 1
)
,Agr__СумаПоНоменклатурі__регнакТНС AS (
    SELECT
        регнакТоварыНаСкладах.FK_спрНоменклатура_ТоварыНаСкладах
        ,регнакТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах
        ,SUM(
            IIF(
                регнакТоварыНаСкладах.RecordKind_ТоварыНаСкладах = 1,
                -регнакТоварыНаСкладах.Количество_ТоварыНаСкладах,
                регнакТоварыНаСкладах.Количество_ТоварыНаСкладах
            )
        ) AS SumByEachNomenklatura_ТоварыНаСкладах
    FROM
        регнакТоварыНаСкладах
    GROUP BY
        регнакТоварыНаСкладах.FK_спрНоменклатура_ТоварыНаСкладах
        ,регнакТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах
    HAVING регнакТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах = 0xB2B0001A64C7AAC211E781AB2E318DA9 -- склад готової продукції (основний)
)
,регнакВнутренниеРезервы AS (
    SELECT
        регнакВнутренниеРезервы._RecorderRRef AS FK_Recorder_регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._RecorderTRef AS TRef_регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24505RRef AS FK_спрНоменклатура_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24506_RRRef AS FK_ДокументРезерва_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24506_RTRef AS TRef_ДокументРезерва_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Period AS Период_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24507 AS Количество_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._RecordKind AS RecordKind_ВнутренниеРезервы -- 0 - приход, 1 - расход
        ,CASE
            WHEN регнакВнутренниеРезервы._RecordKind = 0 
                THEN '+'
            WHEN регнакВнутренниеРезервы._RecordKind = 1
                THEN '-'
        END AS Тип_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Active AS Активность_ВнутренниеРезервы
    FROM 
        _AccumRg24504 AS регнакВнутренниеРезервы
)
,Agr__СумаПоНоменклатурі__регнакВР AS (
    SELECT
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы AS FK_спрНоменклатура_SumByEachNomenklatura
        ,SUM(
            IIF(
                регнакВнутренниеРезервы.RecordKind_ВнутренниеРезервы = 1,
                -регнакВнутренниеРезервы.Количество_ВнутренниеРезервы,
                регнакВнутренниеРезервы.Количество_ВнутренниеРезервы
            )
        ) AS SumByEachNomenklatura_ВнутренниеРезервы
    FROM
        регнакВнутренниеРезервы
    GROUP BY
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы
)
,Agr__СтворенняРеалізація__регнакВР AS (
    SELECT
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы AS FK_спрНоменклатура_СтворенняРеалізація
        ,регнакВнутренниеРезервы.FK_ДокументРезерва_ВнутренниеРезервы AS FK_ДокументРезерва_СтворенняРеалізація
        ,SUM(
            CASE 
                WHEN регнакВнутренниеРезервы.Тип_ВнутренниеРезервы = '+'
                    THEN регнакВнутренниеРезервы.Количество_ВнутренниеРезервы
                ELSE 0
            END
        ) AS СтворенняРезерву
        ,SUM(
            CASE 
                WHEN регнакВнутренниеРезервы.Тип_ВнутренниеРезервы = '-'
                    THEN регнакВнутренниеРезервы.Количество_ВнутренниеРезервы
                ELSE 0
            END
        ) AS РеалізаціяРезерву
    FROM
        регнакВнутренниеРезервы
    GROUP BY
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы
        ,регнакВнутренниеРезервы.FK_ДокументРезерва_ВнутренниеРезервы
)
,спрСтатусыЗаказовПокупателя AS (
    SELECT
        спрСтатусыЗаказовПокупателя._IDRRef AS ID_спрСтатусыЗаказовПокупателя
        ,спрСтатусыЗаказовПокупателя._Description AS Наименование_спрСтатусыЗаказовПокупателя
    FROM 
        _Reference24457 AS спрСтатусыЗаказовПокупателя
)
,спрКонтрагенты AS (
    SELECT
        спрКонтрагенты._IDRRef AS ID_спрКонтрагенты
        ,спрКонтрагенты._Description AS Наименование_спрКонтрагенты
    FROM 
        _Reference120 AS спрКонтрагенты
)
,спрВалюты AS (
    SELECT
        спрВалюты._IDRRef AS ID_спрВалюты
        ,спрВалюты._Description AS Наименование_спрВалюты
    FROM 
        _Reference35 AS спрВалюты
)
,спрНоменклатура AS (
    SELECT
        спрНоменклатура._IDRRef AS ID_спрНоменклатура
        ,спрНоменклатура._Code AS НоменклатураCode
        ,спрНоменклатура._Description AS НазваНоменклатури
        ,спрНоменклатура._Marked AS ПоміткаВидаленняНоменклатури
        ,спрНоменклатура._Folder AS ГрупаНоменклатури
        ,спрНоменклатура._Fld2306RRef AS FK_ВидНоменклатурьі_Номенклатура
        ,спрНоменклатура._Fld23716 AS КількістьВУпаковці_Номенклатура
        ,спрНоменклатура._Fld25116RRef AS FK_Проект_КаналЗбуту_Номенклатура
    FROM _Reference149 AS спрНоменклатура
)
,докМаршрут AS (
    SELECT
        докМаршрут._IDRRef ID_докМаршрут
        ,DATEADD(YEAR, -2000, докМаршрут._Date_Time) Дата_докМаршрут
        ,докМаршрут._Number Номер_докМаршрут
    FROM 
        _Document23052 AS докМаршрут
    WHERE 
        докМаршрут._Posted = 0
        AND
        докМаршрут._Marked = 0
)
,TbptТочки__докМ AS ( -- це я відрізаю дублі заказів в одному маршруті
    SELECT DISTINCT
        TbptТочки__докМ._Document23052_IDRRef ID_докМаршрут_TbptТочки__докМ
        ,TbptТочки__докМ._Fld23056_RRRef FK_Заказ_TbptТочки__докМ -- тут докЗаказПокупателя
    FROM
        _Document23052_VT23054 AS TbptТочки__докМ
)
,Join__TbptТочки__докМ AS (
    SELECT
        *
        ,ROW_NUMBER() OVER ( -- це я беру останній маршрут по дублях заказів в зірних маршрутах
            PARTITION BY FK_Заказ_TbptТочки__докМ
            ORDER BY Дата_докМаршрут DESC
        ) rn
    FROM
        TbptТочки__докМ
        LEFT JOIN 
            докМаршрут 
            ON 
                докМаршрут.ID_докМаршрут 
                    = TbptТочки__докМ.ID_докМаршрут_TbptТочки__докМ
)
,Agr__MaxЗаказ__Join_TbptТ_докМ AS (
    SELECT
        *
    FROM
        Join__TbptТочки__докМ

    WHERE rn = 1
)
,Join__регнакПродажи__докЗПок AS ( -- 1:1
    SELECT 
        *
    FROM
        Join__TbptТовары__докЗПок
            LEFT JOIN 
                регнакПродажи
                ON регнакПродажи.FK_докЗаказПокупателя_Продажи
                    = Join__TbptТовары__докЗПок.ID_докЗаказПокупателя
                    AND
                    регнакПродажи.FK_спрНоменклатура_Продажи
                    = Join__TbptТовары__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок
)
,Props__НеВідвантажено__докЗПок AS (
    SELECT
        *
        ,ISNULL(Join__регнакПродажи__докЗПок.СначалаЗаказано_TbptТовары__докЗПок,0)
            -
            ISNULL(Join__регнакПродажи__докЗПок.Количество_Продажи,0)
                AS НеВідвантажено
    FROM
        Join__регнакПродажи__докЗПок
)
,Join__Join_TbptПродукция_докЗНП__докЗПок AS (
    SELECT
        *
    FROM
        Props__НеВідвантажено__докЗПок
        LEFT JOIN
            Join__TbptПродукция__докЗНП
            ON 
                Props__НеВідвантажено__докЗПок.ID_докЗаказПокупателя
                    = Join__TbptПродукция__докЗНП.FK_Заказ_TbptПродукция__докЗНП
                AND
                Props__НеВідвантажено__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок
                    = Join__TbptПродукция__докЗНП.FK_спрНоменклатура_TbptПродукция__докЗНП
)
,Join__Agr_СумаПоНоменклатурі_регнакТНС__докЗПок AS (
    SELECT
        *
    FROM
        Join__Join_TbptПродукция_докЗНП__докЗПок
        LEFT JOIN
            Agr__СумаПоНоменклатурі__регнакТНС
            ON 
                Agr__СумаПоНоменклатурі__регнакТНС.FK_спрНоменклатура_ТоварыНаСкладах
                    = Join__Join_TbptПродукция_докЗНП__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок
)
,Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок AS (
    SELECT
        *
    FROM
        Join__Agr_СумаПоНоменклатурі_регнакТНС__докЗПок
        LEFT JOIN
            Agr__СумаПоНоменклатурі__регнакВР
            ON Agr__СумаПоНоменклатурі__регнакВР.FK_спрНоменклатура_SumByEachNomenklatura
                = Join__Agr_СумаПоНоменклатурі_регнакТНС__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок
)
,Join__регнакВнутренниеРезервы__докЗПок AS (
    SELECT
        *
    FROM
        Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок
        LEFT JOIN
            регнакВнутренниеРезервы
            ON 
                регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы 
                    = Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок
                AND
                регнакВнутренниеРезервы.FK_Recorder_регнакВнутренниеРезервы
                    = Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок.ID_докЗаказПокупателя
)
,Join__Agr_СтворенняРеалізація_регнакВР__докЗПок AS (
    SELECT
        *
    FROM
        Join__регнакВнутренниеРезервы__докЗПок
        LEFT JOIN
            Agr__СтворенняРеалізація__регнакВР
            ON 
                Agr__СтворенняРеалізація__регнакВР.FK_спрНоменклатура_СтворенняРеалізація
                    = Join__регнакВнутренниеРезервы__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок
                AND
                Agr__СтворенняРеалізація__регнакВР.FK_ДокументРезерва_СтворенняРеалізація
                    = Join__регнакВнутренниеРезервы__докЗПок.ID_докЗаказПокупателя
)
,Props__ВільнийЗалишок__докЗПок AS (
    SELECT
        *
        ,ISNULL(Join__Agr_СтворенняРеалізація_регнакВР__докЗПок.SumByEachNomenklatura_ТоварыНаСкладах, 0)
            - ISNULL(Join__Agr_СтворенняРеалізація_регнакВР__докЗПок.SumByEachNomenklatura_ВнутренниеРезервы, 0)
                AS ВільнийЗалишок
    FROM
        Join__Agr_СтворенняРеалізація_регнакВР__докЗПок
)
,Props__МожливоЗарезервувати_Значення__докЗПок AS (
    SELECT
        *
        ,CASE 
            WHEN Props__ВільнийЗалишок__докЗПок.ВільнийЗалишок >
                (ISNULL(Props__ВільнийЗалишок__докЗПок.НеВідвантажено,0) - ISNULL(Props__ВільнийЗалишок__докЗПок.СтворенняРезерву,0))
                THEN (ISNULL(Props__ВільнийЗалишок__докЗПок.НеВідвантажено,0) - ISNULL(Props__ВільнийЗалишок__докЗПок.СтворенняРезерву,0))

            WHEN Props__ВільнийЗалишок__докЗПок.ВільнийЗалишок <=
                (ISNULL(Props__ВільнийЗалишок__докЗПок.НеВідвантажено,0) - ISNULL(Props__ВільнийЗалишок__докЗПок.СтворенняРезерву,0))
                THEN Props__ВільнийЗалишок__докЗПок.ВільнийЗалишок
        END AS МожливоЗарезервувати_Значення
    FROM
        Props__ВільнийЗалишок__докЗПок
)
,Props__МожливоЗарезервувати__докЗПок AS (
    SELECT
        *
        ,CASE 
            WHEN Props__МожливоЗарезервувати_Значення__докЗПок.МожливоЗарезервувати_Значення > 0 
                THEN Props__МожливоЗарезервувати_Значення__докЗПок.МожливоЗарезервувати_Значення
            ELSE 0
        END AS МожливоЗарезервувати
    FROM
        Props__МожливоЗарезервувати_Значення__докЗПок
)
,Props__ДоВиготовлення_Значення__докЗПок AS (
    SELECT
        * 
        ,Props__МожливоЗарезервувати__докЗПок.НеВідвантажено
            - ISNULL(Props__МожливоЗарезервувати__докЗПок.ВільнийЗалишок, 0)
                - ISNULL(Props__МожливоЗарезервувати__докЗПок.СтворенняРезерву, 0)
                    AS ДоВиготовлення_Значення
    FROM
        Props__МожливоЗарезервувати__докЗПок
)
,Props__ДоВиготовлення__докЗПок AS (
    SELECT
        *
        ,CASE 
            WHEN Props__ДоВиготовлення_Значення__докЗПок.ДоВиготовлення_Значення > 0 
                THEN Props__ДоВиготовлення_Значення__докЗПок.ДоВиготовлення_Значення
            ELSE 0
        END AS ДоВиготовлення
    FROM
        Props__ДоВиготовлення_Значення__докЗПок
)
,Join__спрСтатусыЗаказовПокупателя__докЗПок AS (
    SELECT
        *
    FROM
        Props__ДоВиготовлення__докЗПок
        LEFT JOIN 
            спрСтатусыЗаказовПокупателя
            ON 
                Props__ДоВиготовлення__докЗПок.FK_спрСтатусыЗаказовПокупателя_докЗаказПокупателя 
                    = спрСтатусыЗаказовПокупателя.ID_спрСтатусыЗаказовПокупателя
)
,Join__спрКонтрагенты__докЗПок AS (
    SELECT
        *
    FROM
        Join__спрСтатусыЗаказовПокупателя__докЗПок
        LEFT JOIN 
            спрКонтрагенты
            ON 
                Join__спрСтатусыЗаказовПокупателя__докЗПок.FK_спрКонтрагенты_докЗаказПокупателя 
                    = спрКонтрагенты.ID_спрКонтрагенты
)
,Join__спрВалюты__докЗПок AS (
    SELECT
        *
    FROM
        Join__спрКонтрагенты__докЗПок
        LEFT JOIN 
            спрВалюты
            ON 
                Join__спрКонтрагенты__докЗПок.FK_ВалютаДокумента_докЗаказПокупателя 
                    = спрВалюты.ID_спрВалюты
)
,Join__Agr_MaxЗаказ_Join_TbptТ_докМ__докЗПок AS (
    SELECT
        *
    FROM
        Join__спрВалюты__докЗПок
        LEFT JOIN
            Agr__MaxЗаказ__Join_TbptТ_докМ
            ON
                Join__спрВалюты__докЗПок.ID_докЗаказПокупателя
                    = Agr__MaxЗаказ__Join_TbptТ_докМ.FK_Заказ_TbptТочки__докМ
)
,Join__спрНоменклатура__докЗПок AS (
    SELECT
        *
    FROM 
        Join__Agr_MaxЗаказ_Join_TbptТ_докМ__докЗПок
        LEFT JOIN
            спрНоменклатура
            ON  
                Join__Agr_MaxЗаказ_Join_TbptТ_докМ__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок
                    = спрНоменклатура.ID_спрНоменклатура
)
,Viz__Pbix_ЗамовленняПокупця_Номенклатура__докЗПок AS (
    SELECT
        Join__спрНоменклатура__докЗПок.FK_спрНоменклатура_TbptТовары__докЗПок                     [FK_Номенклатура]
        ,Join__спрНоменклатура__докЗПок.SumByEachNomenklatura_ВнутренниеРезервы                   [Резерв Номенклатури]
        ,Join__спрНоменклатура__докЗПок.SumByEachNomenklatura_ТоварыНаСкладах                     [Залишок Номенклатури На Складі]
        ,Join__спрНоменклатура__докЗПок.ВільнийЗалишок                                            [Вільний Залишок Номенклатури]
        ,Join__спрНоменклатура__докЗПок.imp__Дата__докЗаказНаПроизводство                         [Дата Заказу На Виробництво]
        ,Join__спрНоменклатура__докЗПок.Дата_докЗаказПокупателя                                   [Дата Заказу Покупця]
        ,Join__спрНоменклатура__докЗПок.ДатаОтгрузки_докЗаказПокупателя                           [Планова Дата Відвантаження]
        ,Join__спрНоменклатура__докЗПок.Количество_Продажи                                        [Відвантажено]
        ,Join__спрНоменклатура__докЗПок.НазваНоменклатури                                         [Назва Номенклатури]
        ,Join__спрНоменклатура__докЗПок.Наименование_спрВалюты                                    [Валюта]
        ,Join__спрНоменклатура__докЗПок.Наименование_спрКонтрагенты                               [Контрагент]
        ,Join__спрНоменклатура__докЗПок.Наименование_спрСтатусыЗаказовПокупателя                  [Статус Заказу Покупця]
        ,Join__спрНоменклатура__докЗПок.НеВідвантажено                                            [Не Відвантажено]
        ,Join__спрНоменклатура__докЗПок.Номер_докЗаказПокупателя                                  [Номер Заказу Покупця]
        ,Join__спрНоменклатура__докЗПок.imp__Номер__докЗаказНаПроизводство                        [Номер Заказу На Виробництво]
        ,Join__спрНоменклатура__докЗПок.СначалаЗаказано_TbptТовары__докЗПок                       [Сначала Заказано]
        ,Join__спрНоменклатура__докЗПок.Цена_TbptТовары__докЗПок                                  [Ціна]
        ,Join__спрНоменклатура__докЗПок.СтворенняРезерву                                          [Резерв Поточного Заказу]
        ,Join__спрНоменклатура__докЗПок.Кількість_TbptПродукция__докЗНП_Вроботі                   [Кількість в Роботі]
        ,Join__спрНоменклатура__докЗПок.Кількість_TbptПродукция__докЗНП_Виконано                  [Кількість Виконано]
        ,Join__спрНоменклатура__докЗПок.Дата_докМаршрут                                           [Плановий Час Відвантеження]
    FROM
        Join__спрНоменклатура__докЗПок
)
SELECT * FROM Viz__Pbix_ЗамовленняПокупця_Номенклатура__докЗПок
ORDER BY [Дата Заказу Покупця] DESC