;WITH 



-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------





-- type__name__dependency
докОтчетПроизводстваЗаСмену AS ( -- ../док/докОтчетПроизводстваЗаСмену.sql
    SELECT
        докОтчетПроизводстваЗаСмену._IDRRef ID__Ссылка__докОтчетПроизводстваЗаСмену
        ,докОтчетПроизводстваЗаСмену._Fld9847RRef FK__Подразделение__спрВидыПодразделений_докОПЗС
        ,докОтчетПроизводстваЗаСмену._Fld23062RRef FK__Смена__спрСмена_докОтчетПроизводстваЗаСмену
        ,докОтчетПроизводстваЗаСмену._Fld23714RRef FK__ВидСмены__enumВидыСмен_докОПЗС
        ,CASE
            WHEN докОтчетПроизводстваЗаСмену._Fld23714RRef = 0x959D17BEC1C13F294F4BE6B360904893
                THEN 'Денна'
            WHEN докОтчетПроизводстваЗаСмену._Fld23714RRef = 0xBC49332AA2C993244640128E3A54CB6C
                THEN 'Нічна'
            ELSE 'Невідомо'
        END calc__ВидЗміни__докОтчетПроизводстваЗаСмену
        ,докОтчетПроизводстваЗаСмену._Number imp__Номер__докОтчетПроизводстваЗаСмену
        ,DATEADD(YEAR, -2000, докОтчетПроизводстваЗаСмену._Date_Time) 
            imp__ДатаЧас__докОтчетПроизводстваЗаСмену
        ,DATEADD(YEAR, -2000, CAST(докОтчетПроизводстваЗаСмену._Fld23192 AS datetime2)) 
            own__НачалоСмены__докОтчетПроизводстваЗаСмену
        ,DATEADD(YEAR, -2000, CAST(докОтчетПроизводстваЗаСмену._Fld23193 AS datetime2)) 
            own__КонецСмены__докОтчетПроизводстваЗаСмену
    FROM 
        _Document426 AS докОтчетПроизводстваЗаСмену
    WHERE 
        докОтчетПроизводстваЗаСмену._Marked = 0
        AND
        докОтчетПроизводстваЗаСмену._Posted = 1
        AND
        DATEADD(YEAR, -2000, докОтчетПроизводстваЗаСмену._Date_Time) 
            >= DATEADD(MONTH, -4, DATEADD(DAY, 1 - DAY(GETDATE()), GETDATE()))
)





---- BASE ---------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
---- TABLEPARTS ---------------------------------------------------------------------------





,TbptМатериалы__докОПЗС AS (
    SELECT
        TbptМатериалы__докОПЗС._Document426_IDRRef 
            ParentID__докОтчетПроизводстваЗаСмену__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        ,TbptМатериалы__докОПЗС._Fld10061RRef 
            FK__Номенклатура__спрНоменклатура_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        ,TbptМатериалы__докОПЗС._Fld10070RRef 
            FK__СтатьяЗатрат__спрСтатьиЗатрат_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        ,TbptМатериалы__докОПЗС._Fld10068 
            own__Количество__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
    FROM
        _Document426_VT10059 AS TbptМатериалы__докОПЗС
)

-------------------------------------------------------------------------------------------

,TbptИсполнители__докОПЗС AS (
    SELECT
        TbptИсполнители__докОПЗС._Document426_IDRRef 
            ParentID__докОтчетПроизводстваЗаСмену__TbptИ_докОПЗС
        ,TbptИсполнители__докОПЗС._Fld9998RRef 
            FK__Сотрудник__TbptИсполнители_докОПЗС
        ,TbptИсполнители__докОПЗС._Fld23715RRef
            FK__Должность__TbptИсполнители_докОПЗС
    FROM
        _Document426_VT9992 AS TbptИсполнители__докОПЗС
)





---- TABLEPARTS ---------------------------------------------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------
----------------------------------------- VIEWS -------------------------------------------





,регНак_ВыпускПродукции AS ( -- рег/регНак/Join__регнакВыпускПродукции__докОтчетПроизводстваЗаСмену.sql
    SELECT
        -- join on (PK)
        регНак_ВыпускПродукции._RecorderRRef FK__Регистратор__регнакВыпускПродукции
        ,регНак_ВыпускПродукции._RecorderRRef MainFK_0x000001F6_док_РасчетСебестоимостиВыпуска_ВыпускПродукции
        ,регНак_ВыпускПродукции._RecorderTRef AS TRef
        -- FK
        ,регНак_ВыпускПродукции._Fld20665RRef AS FK_спр_ВидыПодразделений_ВыпускПродукции
        ,регНак_ВыпускПродукции._Fld20667RRef AS FK_спр_Номенклатура_ВыпускПродукции
        -- imp
        ,регНак_ВыпускПродукции._Period AS Период_ВыпускПродукции
        -- other
        ,регНак_ВыпускПродукции._Fld20674 AS Количество_ВыпускПродукции
    FROM 
        _AccumRg20664 AS регНак_ВыпускПродукции
    
    WHERE 
        NOT регНак_ВыпускПродукции._RecorderTRef = 0x0000016F -- я хз, шо це, але воно тут тільки одне
        AND
        регНак_ВыпускПродукции._Active = 1
)

,регНак_ВремяИзготовления AS ( -- рег/регНак/регНак_ВремяИзготовления.sql
    SELECT
        -- join on PK (немає MainFK)
        регНак_ВремяИзготовления._Fld25310RRef AS FK_спр_Номенклатура_ВремяИзготовления
        ,регНак_ВремяИзготовления._Fld24500RRef AS FK_спр_ВидыПодразделений_ВремяИзготовления
        -- FK
        -- imp
        ,регНак_ВремяИзготовления._Period AS Период_ВремяИзготовления
        -- other
        ,регНак_ВремяИзготовления._Fld24502 AS Скорость_ВремяИзготовления

        ,ROW_NUMBER() OVER (
            PARTITION BY 
                регНак_ВремяИзготовления._Fld25310RRef,
                регНак_ВремяИзготовления._Fld24500RRef
            ORDER BY 
                регНак_ВремяИзготовления._Period DESC
        ) AS rn__регНак_ВремяИзготовления
    FROM 
        _InfoRg24499 AS регНак_ВремяИзготовления

    -- немає Active
)

,регСвед_Простои AS ( -- ../рег/регСвед/регСвед_Простои.sql
    SELECT
        регСвед_Простои._Fld25202RRef AS FK_докОтчетПроизводстваЗаСмену_Простои
        ,DATEADD(YEAR, -2000, CAST(регСвед_Простои._Fld25199 AS datetime2)) AS Начало_Простои
        ,DATEADD(YEAR, -2000, CAST(регСвед_Простои._Fld25200 AS datetime2)) AS Конец_Простои
        ,регСвед_Простои._Fld25201 AS FK_спр_ПричиныПростоевПроизводственныхЛиний_Простои
    FROM 
        _InfoRg25196 AS регСвед_Простои
)

,Props_ТривалістьПростоїв_Простои AS (
    SELECT
        *
        ,CASE 
            WHEN регСвед_Простои.Начало_Простои IS NULL 
            OR регСвед_Простои.Конец_Простои IS NULL 
            OR регСвед_Простои.Конец_Простои <= регСвед_Простои.Начало_Простои
            OR 
                DATEDIFF(
                    MINUTE, регСвед_Простои.Начало_Простои, регСвед_Простои.Конец_Простои
                ) > 720
                THEN 0
            ELSE 
                DATEDIFF(
                    MINUTE, регСвед_Простои.Начало_Простои, регСвед_Простои.Конец_Простои
                )
        END AS DurationMinutes_Простои
    FROM 
        регСвед_Простои
)

,регСвед_ЦеныНоменклатуры AS ( -- .../.../регСвед_ЦеныНоменклатуры.sql
    SELECT
        регСвед_ЦеныНоменклатуры._RecorderRRef AS Регистратор_регСвед_ЦеныНоменклатуры
        ,регСвед_ЦеныНоменклатуры._RecorderTRef AS TRef_регСвед_ЦеныНоменклатуры
        ,регСвед_ЦеныНоменклатуры._Fld20421RRef AS FK_спр_Номенклатура_регСвед_ЦеныНоменклатуры
        ,DATEADD(YEAR,-2000,регСвед_ЦеныНоменклатуры._Period) AS Период_регСвед_ЦеныНоменклатуры
        ,регСвед_ЦеныНоменклатуры._Fld20424 AS Цена_регСвед_ЦеныНоменклатуры
    FROM 
        _InfoRg20419 AS регСвед_ЦеныНоменклатуры

    WHERE регСвед_ЦеныНоменклатуры._Active = 1
)
,спрСмена AS ( -- ../spr/спрСмена.sql
    SELECT
        спрСмена._IDRRef AS PK__Ссылка__спрСмена
        ,спрСмена._Code AS imp__Код__спрСмена
        ,спрСмена._Description AS imp__Наименование__спрСмена
        ,спрСмена._Marked AS sys__ПомечеткаНаУдаление__спрСмена
    FROM 
        _Reference200 AS спрСмена

    WHERE 
        спрСмена._Marked = 0 -- не помічений на видалення
)
,спр_СтатьиЗатрат AS ( -- ../spr/спр_СтатьиЗатрат.sql
    SELECT
        спр_СтатьиЗатрат._IDRRef AS ID_СтатьиЗатрат
        -- ,спр_СтатьиЗатрат._Code AS Код_СтатьиЗатрат
        ,спр_СтатьиЗатрат._Description AS Наименование_СтатьиЗатрат
        -- ,спр_СтатьиЗатрат._Marked AS ПометкаУдаления_СтатьиЗатрат
    FROM _Reference216 AS спр_СтатьиЗатрат

    WHERE спр_СтатьиЗатрат._Marked = 0
)
,спрНоменклатура AS ( -- ../спр/спрНоменклатура.sql
    SELECT
        спрНоменклатура._IDRRef AS ID_спрНоменклатура
        -- ,спрНоменклатура._Code AS НоменклатураCode
        ,спрНоменклатура._Description AS НазваНоменклатури
        -- ,спрНоменклатура._Marked AS ПоміткаВидаленняНоменклатури
        -- ,спрНоменклатура._Folder AS ГрупаНоменклатури

        -- ,спрНоменклатура._Fld2306RRef AS FK_ВидНоменклатурьі_Номенклатура
        -- ,спрНоменклатура._Fld23716 AS КількістьВУпаковці_Номенклатура
        -- ,спрНоменклатура._Fld25116RRef AS FK_Проект_КаналЗбуту_Номенклатура
    FROM _Reference149 AS спрНоменклатура

    WHERE спрНоменклатура._Marked = 0
)

,докТарифыОплатыТрудаПроизводства AS ( -- .../.../докТарифыОплатыТрудаПроизводства.sql
    SELECT
        докТарифыОплатыТрудаПроизводства._IDRRef ID__Ссылка__докТарифыОплатыТрудаПроизводства
        ,докТарифыОплатыТрудаПроизводства._Fld23694RRef FK__Подразделение__спрПодразделение_докТОТП
        ,докТарифыОплатыТрудаПроизводства._Fld23697 imp__ДатаИзменений__докТарифыОплатыТрудаПроизводства
        -- own
        -- oth (other)
        -- sys (system)
        -- calc (calculated)
    FROM 
        _Document23691 AS докТарифыОплатыТрудаПроизводства

    WHERE
        докТарифыОплатыТрудаПроизводства._Posted = 1 -- проведений
        AND
        докТарифыОплатыТрудаПроизводства._Marked = 0 -- не помічений на видалення
    --     AND
    --     докТарифыОплатыТрудаПроизводства._Active = 1 -- активний
)
,TbptТарифы__докТОТП AS (
    SELECT
        Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Document23691_IDRRef 
            ParentID__докТарифыОплатыТрудаПроизводства__TbptДолжности_докТОТП
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23703RRef
            FK__Должность__спрДолжностиОрганизаций_TbptТ_докТОТП -- треба перевірити, бо я хз, чи це фк на спр
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23704RRef
            FK__НормаОплаты__спрНормыОплатыТруда_TbptТ_докТОТП
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23705
            own__Сумма__TbptТарифы_докТОТП
    FROM
        _Document23691_VT23701 AS Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства
)
,Join__TbptТарифы__докТОТП AS (
    SELECT
        *
    FROM
        докТарифыОплатыТрудаПроизводства
        LEFT JOIN
            TbptТарифы__докТОТП
            ON
                докТарифыОплатыТрудаПроизводства.ID__Ссылка__докТарифыОплатыТрудаПроизводства
                    = TbptТарифы__докТОТП.ParentID__докТарифыОплатыТрудаПроизводства__TbptДолжности_докТОТП
)
,спрДолжностиОрганизаций AS ( -- .../.../спрДолжностиОрганизаций.sql
    SELECT
        спрДолжностиОрганизаций._IDRRef ID__Ссылка__спрДолжностиОрганизаций
        -- FK
        -- imp (important)
        ,спрДолжностиОрганизаций._Description imp__Наименование__спрДолжностиОрганизаций
        -- own
        -- oth (other)
        -- sys (system)
        -- calc (calculated)
    FROM 
        _Reference87 AS спрДолжностиОрганизаций

    WHERE
    --     спрДолжностиОрганизаций._Posted = 1 -- проведений
    --     AND
        спрДолжностиОрганизаций._Marked = 0 -- не помічений на видалення
    --     AND
    --     спрДолжностиОрганизаций._Active = 1 -- активний
)
,спр_ВидыПодразделений AS ( -- ../spr/спр_ВидыПодразделений.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений._IDRRef AS ID_ВидыПодразделений
        -- imp
        -- ,спр_ВидыПодразделений._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений._Description AS Назва_ВидыПодразделений
        -- other
        -- system
        -- ,спр_ВидыПодразделений._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений

    WHERE 
        спр_ВидыПодразделений._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2 (Лінія1)' -- вже нема
)
,спрНормыОплатыТруда AS ( -- .../.../спрНормыОплатыТруда.sql
    SELECT
        спрНормыОплатыТруда._IDRRef ID__Ссылка__спрНормыОплатыТруда
        -- FK
        -- imp (important)
        ,спрНормыОплатыТруда._Description imp__Наименование__спрНормыОплатыТруда
        -- own
        -- oth (other)
        -- sys (system)
        -- calc (calculated)
    FROM 
        _Reference23690 AS спрНормыОплатыТруда

    WHERE
    --     спрНормыОплатыТруда._Posted = 1 -- проведений
    --     AND
        спрНормыОплатыТруда._Marked = 0 -- не помічений на видалення
    --     AND
    --     спрНормыОплатыТруда._Active = 1 -- активний
)
,Join__спрДолжности__докТОТП AS ( -- 1:1
    SELECT
        *
    FROM
        Join__TbptТарифы__докТОТП
        LEFT JOIN
            спрДолжностиОрганизаций
            ON
                Join__TbptТарифы__докТОТП.FK__Должность__спрДолжностиОрганизаций_TbptТ_докТОТП
                    = спрДолжностиОрганизаций.ID__Ссылка__спрДолжностиОрганизаций
)
,Join__спрНормыОплатыТруда__докТОТП AS (
    SELECT
        *
    FROM
        Join__спрДолжности__докТОТП
        LEFT JOIN
            спрНормыОплатыТруда
            ON
                Join__спрДолжности__докТОТП.FK__НормаОплаты__спрНормыОплатыТруда_TbptТ_докТОТП
                    = спрНормыОплатыТруда.ID__Ссылка__спрНормыОплатыТруда
)

,спрСотрудникиОрганизаций AS ( -- ../spr/спрСотрудникиОрганизаций.sql
    SELECT
    
        спрСотрудникиОрганизаций._IDRRef AS ID_СотрудникиОрганизаций
        -- ,спрСотрудникиОрганизаций._Code AS Код_СотрудникиОрганизаций

        -- ,спрСотрудникиОрганизаций._Fld2677RRef AS FK_ФизЛицо_СотрудникиОрганизаций
        -- ,спрСотрудникиОрганизаций._Fld2679RRef AS FK_Организация_СотрудникиОрганизаций
        -- ,спрСотрудникиОрганизаций._Fld2686RRef AS FK_ПодразделениеОрганизации_СотрудникиОрганизаций
        -- ,спрСотрудникиОрганизаций._Fld2687RRef AS FK_Должность_СотрудникиОрганизаций

        -- ,спр_Организации._Description AS Наименование_СотрудникиОрганизации
        -- ,спр_Должности._Description AS Наименование_Должности
        -- ,спр_Подразделения._Description AS Наименование_Подразделения

        ,спрСотрудникиОрганизаций._Description AS Наименование_СотрудникиОрганизаций
        -- ,спрСотрудникиОрганизаций._Fld24754 AS ЕлПошта_СотрудникиОрганизаций

    FROM _Reference205 AS спрСотрудникиОрганизаций
        -- LEFT JOIN
        --     _Reference159 AS спр_Организации
        --         ON спрСотрудникиОрганизаций._Fld2679RRef = спр_Организации._IDRRef
        -- LEFT JOIN
        --     _Reference87 AS спр_Должности
        --         ON спрСотрудникиОрганизаций._Fld2687RRef = спр_Должности._IDRRef
        -- LEFT JOIN
        --     _Reference171 AS спр_Подразделения
        --         ON спрСотрудникиОрганизаций._Fld2686RRef = спр_Подразделения._IDRRef

    WHERE 
        спрСотрудникиОрганизаций._Marked = 0 -- не помічений на видалення
)

,регсведРемонты AS ( -- ../рег/регСвед/регсведРемонты.sql
    SELECT
        регсведРемонты._Fld24657RRef FK__докОтчетПроизводстваЗаСмену__регсведРемонты
        ,регсведРемонты._Fld24652RRef FK__Подразделение__спрВидыПодразделений_регсведР
        -- ,DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)) 
        --     own__НачалоРемонта_регсведРемонты
        -- ,DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)))
        --     calc__НачалоРемонтаМінусДень_регсведРемонты
        ,регсведРемонты._Fld24655
        ,CASE
            WHEN регсведРемонты._Fld24655 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)) 
        END own__НачалоРемонта_регсведРемонты
        ,CASE
            WHEN регсведРемонты._Fld24655 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24655 AS datetime2)))
        END calc__НачалоРемонтаМінусДень_регсведРемонты
        ,DATEADD(YEAR, -2000, CAST(регсведРемонты._Fld24656 AS datetime2)) 
            own__КонецРемонта_регсведРемонты
    FROM 
        _InfoRg24651 AS регсведРемонты
)
,спр_ВидыПодразделений_Рем AS ( -- ../spr/спр_ВидыПодразделений_Рем.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений_Рем._IDRRef AS ID_ВидыПодразделений__регсведРемонты
        -- imp
        -- ,спр_ВидыПодразделений_Рем._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений_Рем._Description AS Назва_ВидыПодразделений__регсведРемонты
        -- other
        -- system
        -- ,спр_ВидыПодразделений_Рем._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений_Рем

    WHERE 
        спр_ВидыПодразделений_Рем._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений_Рем._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений_Рем._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений_Рем._Description <> 'Цех №2 (Лінія1)' -- вже нема
)
,Join__спр_ВидыПодразделений_Рем__регсведРемонты AS (
    SELECT
        *
    FROM
        регсведРемонты
        LEFT JOIN
            спр_ВидыПодразделений_Рем
            ON
                регсведРемонты.FK__Подразделение__спрВидыПодразделений_регсведР
                    = спр_ВидыПодразделений_Рем.ID_ВидыПодразделений__регсведРемонты
)
,Props__ТривалістьРемонтів__регсведРемонты AS (
    SELECT
        *
        ,CASE 
            WHEN Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__НачалоРемонта_регсведРемонты IS NULL 
            OR Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__КонецРемонта_регсведРемонты IS NULL 
            OR Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__КонецРемонта_регсведРемонты <= Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__НачалоРемонта_регсведРемонты
            OR 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__НачалоРемонта_регсведРемонты, Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__КонецРемонта_регсведРемонты
                ) > 720
                THEN 
                    0
            ELSE 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__НачалоРемонта_регсведРемонты, Join__спр_ВидыПодразделений_Рем__регсведРемонты.own__КонецРемонта_регсведРемонты
                )
        END AS DurationMinutes_Ремонты
    FROM 
        Join__спр_ВидыПодразделений_Рем__регсведРемонты
)
,Props__РемонтЗміна__регсведРемонты AS (
    SELECT
        *
        ,CASE 
            WHEN 
                DATEPART(
                    HOUR, own__НачалоРемонта_регсведРемонты
                ) >= 6 
            AND 
                DATEPART(
                    HOUR, own__НачалоРемонта_регсведРемонты
                ) < 18
                THEN 
                    CONVERT(
                        nvarchar(10), 
                            own__НачалоРемонта_регсведРемонты
                    ) + N', Денна, ' + Назва_ВидыПодразделений__регсведРемонты
            ELSE 
                CASE 
                    WHEN 
                        DATEPART(
                                HOUR, own__НачалоРемонта_регсведРемонты
                        ) >= 18
                        THEN
                        CONVERT(
                            nvarchar(10), 
                                own__НачалоРемонта_регсведРемонты
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведРемонты
                    ELSE
                        CONVERT(
                            nvarchar(10), 
                                calc__НачалоРемонтаМінусДень_регсведРемонты
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведРемонты
                END
        END AS Зміна_Ремонты
    FROM 
        Props__ТривалістьРемонтів__регсведРемонты
)
,Agr__СумаРемонтівПоЗміні__регсведРемонты AS (
    SELECT
        Зміна_Ремонты
        ,SUM(DurationMinutes_Ремонты) AS TotalDurationMinutes_Ремонты
    FROM 
        Props__РемонтЗміна__регсведРемонты
    GROUP BY
        Зміна_Ремонты
)

,регсведПростои AS ( -- ../рег/регСвед/регсведПростои.sql
    SELECT
        регсведПростои._Fld25202RRef FK__докОтчетПроизводстваЗаСмену__регсведПростои
        ,регсведПростои._Fld25197RRef FK__Подразделение__спрВидыПодразделений_регсведР
        -- ,DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)) 
        --     own__НачалоПростоя_регсведПростои
        -- ,DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)))
        --     calc__НачалоПростояМінусДень_регсведПростои
        ,регсведПростои._Fld25199
        ,CASE
            WHEN регсведПростои._Fld25199 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)) 
        END own__НачалоПростоя_регсведПростои
        ,CASE
            WHEN регсведПростои._Fld25199 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25199 AS datetime2)))
        END calc__НачалоПростояМінусДень_регсведПростои
        ,DATEADD(YEAR, -2000, CAST(регсведПростои._Fld25200 AS datetime2)) 
            own__КонецПростоя_регсведПростои
    FROM 
        _InfoRg25196 AS регсведПростои
)
,спр_ВидыПодразделений_Прост AS ( -- ../spr/спр_ВидыПодразделений_Прост.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений_Прост._IDRRef AS ID_ВидыПодразделений__регсведПростои
        -- imp
        -- ,спр_ВидыПодразделений_Прост._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений_Прост._Description AS Назва_ВидыПодразделений__регсведПростои
        -- other
        -- system
        -- ,спр_ВидыПодразделений_Прост._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений_Прост

    WHERE 
        спр_ВидыПодразделений_Прост._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений_Прост._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений_Прост._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений_Прост._Description <> 'Цех №2 (Лінія1)' -- вже нема
)
,Join__спр_ВидыПодразделений_Прост__регсведПростои AS (
    SELECT
        *
    FROM
        регсведПростои
        LEFT JOIN
            спр_ВидыПодразделений_Прост
            ON
                регсведПростои.FK__Подразделение__спрВидыПодразделений_регсведР
                    = спр_ВидыПодразделений_Прост.ID_ВидыПодразделений__регсведПростои
)
,Props__ТривалістьПростоїв__регсведПростои AS (
    SELECT
        *
        ,CASE 
            WHEN Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои IS NULL 
            OR Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои IS NULL 
            OR Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои <= Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои
            OR 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои
                ) > 720
                THEN 
                    0
            ELSE 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__НачалоПростоя_регсведПростои, Join__спр_ВидыПодразделений_Прост__регсведПростои.own__КонецПростоя_регсведПростои
                )
        END AS DurationMinutes_Простои
    FROM 
        Join__спр_ВидыПодразделений_Прост__регсведПростои
)
,Props__ПростойЗміна__регсведПростои AS (
    SELECT
        *
        ,CASE 
            WHEN 
                DATEPART(
                    HOUR, own__НачалоПростоя_регсведПростои
                ) >= 6 
            AND 
                DATEPART(
                    HOUR, own__НачалоПростоя_регсведПростои
                ) < 18
                THEN 
                    CONVERT(
                        nvarchar(10), 
                            own__НачалоПростоя_регсведПростои
                    ) + N', Денна, ' + Назва_ВидыПодразделений__регсведПростои
            ELSE 
                CASE 
                    WHEN 
                        DATEPART(
                                HOUR, own__НачалоПростоя_регсведПростои
                        ) >= 18
                        THEN
                        CONVERT(
                            nvarchar(10), 
                                own__НачалоПростоя_регсведПростои
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПростои
                    ELSE
                        CONVERT(
                            nvarchar(10), 
                                calc__НачалоПростояМінусДень_регсведПростои
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПростои
                END
        END AS Зміна_Простои
    FROM 
        Props__ТривалістьПростоїв__регсведПростои
)
,Agr__СумаПростоївПоЗміні__регсведПростои AS (
    SELECT
        Зміна_Простои
        ,SUM(DurationMinutes_Простои) AS TotalDurationMinutes_Простои
    FROM 
        Props__ПростойЗміна__регсведПростои
    GROUP BY
        Зміна_Простои
)

,регсведПереходы AS ( -- ../рег/регСвед/регсведПереходы.sql
    SELECT
        регсведПереходы._Fld25191RRef FK__Подразделение__спрВидыПодразделений_регсведР
        -- ,DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)) 
        --     own__НачалоПерехода_регсведПереходы
        -- ,DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)))
        --     calc__НачалоПереходаМінусДень_регсведПереходы
        ,регсведПереходы._Fld25193
        ,CASE
            WHEN регсведПереходы._Fld25193 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)) 
        END own__НачалоПерехода_регсведПереходы
        ,CASE
            WHEN регсведПереходы._Fld25193 < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(DAY, -1, DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25193 AS datetime2)))
        END calc__НачалоПереходаМінусДень_регсведПереходы
        ,DATEADD(YEAR, -2000, CAST(регсведПереходы._Fld25194 AS datetime2)) 
            own__КонецПерехода_регсведПереходы
    FROM 
        _InfoRg25190 AS регсведПереходы
)
,спр_ВидыПодразделений_Пер AS ( -- ../spr/спр_ВидыПодразделений_Пер.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений_Пер._IDRRef AS ID_ВидыПодразделений__регсведПереходы
        -- imp
        -- ,спр_ВидыПодразделений_Пер._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений_Пер._Description AS Назва_ВидыПодразделений__регсведПереходы
        -- other
        -- system
        -- ,спр_ВидыПодразделений_Пер._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений_Пер

    WHERE 
        спр_ВидыПодразделений_Пер._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений_Пер._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений_Пер._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений_Пер._Description <> 'Цех №2 (Лінія1)' -- вже нема
)
,Join__спр_ВидыПодразделений_Пер__регсведПереходы AS (
    SELECT
        *
    FROM
        регсведПереходы
        LEFT JOIN
            спр_ВидыПодразделений_Пер
            ON
                регсведПереходы.FK__Подразделение__спрВидыПодразделений_регсведР
                    = спр_ВидыПодразделений_Пер.ID_ВидыПодразделений__регсведПереходы
)
,Props__ТривалістьПереходів__регсведПереходы AS (
    SELECT
        *
        ,CASE 
            WHEN Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы IS NULL 
            OR Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы IS NULL 
            OR Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы <= Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы
            OR 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы
                ) > 720
                THEN 
                    0
            ELSE 
                DATEDIFF(
                    MINUTE, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__НачалоПерехода_регсведПереходы, Join__спр_ВидыПодразделений_Пер__регсведПереходы.own__КонецПерехода_регсведПереходы
                )
        END AS DurationMinutes_Переходы
    FROM 
        Join__спр_ВидыПодразделений_Пер__регсведПереходы
)
,Props__ПереходЗміна__регсведПереходы AS (
    SELECT
        *
        ,CASE 
            WHEN 
                DATEPART(
                    HOUR, own__НачалоПерехода_регсведПереходы
                ) >= 6 
            AND 
                DATEPART(
                    HOUR, own__НачалоПерехода_регсведПереходы
                ) < 18
                THEN 
                    CONVERT(
                        nvarchar(10), 
                            own__НачалоПерехода_регсведПереходы
                    ) + N', Денна, ' + Назва_ВидыПодразделений__регсведПереходы
            ELSE 
                CASE 
                    WHEN 
                        DATEPART(
                                HOUR, own__НачалоПерехода_регсведПереходы
                        ) >= 18
                        THEN
                        CONVERT(
                            nvarchar(10), 
                                own__НачалоПерехода_регсведПереходы
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПереходы
                    ELSE
                        CONVERT(
                            nvarchar(10), 
                                calc__НачалоПереходаМінусДень_регсведПереходы
                        ) + N', Нічна, ' + Назва_ВидыПодразделений__регсведПереходы
                END
        END AS Зміна_Переходы
    FROM 
        Props__ТривалістьПереходів__регсведПереходы
)
,Agr__СумаПереходівПоЗміні__регсведПереходы AS (
    SELECT
        Зміна_Переходы
        ,SUM(DurationMinutes_Переходы) AS TotalDurationMinutes_Переходы
    FROM 
        Props__ПереходЗміна__регсведПереходы
    GROUP BY
        Зміна_Переходы
)

,регНак_ЗатратыНаВыпускПродукции AS (
    SELECT
        регНак_ЗатратыНаВыпускПродукции._RecorderRRef MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции._Period AS Период_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции._Fld21046RRef AS FK_спр_ВидыПодразделений_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции._Fld21048RRef AS FK_Номенклатура_спр_Номенклатура_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции._Fld21054RRef AS FK_спр_СтатьиЗатрат_ЗНВП_ЗатратыНаВыпускПродукции
        ,регНак_ЗатратыНаВыпускПродукции._Fld21055_RRRef AS FK_Затрата_спр_Номенклатура_ЗатратыНаВыпускПродукции

        ,регНак_ЗатратыНаВыпускПродукции._Fld21061 AS Количество_ЗатратыНаВыпускПродукции
    FROM 
        _AccumRg21045 AS регНак_ЗатратыНаВыпускПродукции

    
    WHERE 
        регНак_ЗатратыНаВыпускПродукции._Active = 1
        AND
        регНак_ЗатратыНаВыпускПродукции._Fld21055_RTRef = 0x00000095 -- інші це 2017/2018 без значень
)
,спр_СтатьиЗатрат_ЗНВП AS ( -- ../spr/спр_СтатьиЗатрат_ЗНВП.sql
    SELECT
        спр_СтатьиЗатрат_ЗНВП._IDRRef AS ID_СтатьиЗатрат_ЗНВП
        -- ,спр_СтатьиЗатрат_ЗНВП._Code AS Код_СтатьиЗатрат_ЗНВП
        ,спр_СтатьиЗатрат_ЗНВП._Description AS Наименование_СтатьиЗатрат_ЗНВП
        -- ,спр_СтатьиЗатрат_ЗНВП._Marked AS ПометкаУдаления_СтатьиЗатрат_ЗНВП
    FROM _Reference216 AS спр_СтатьиЗатрат_ЗНВП

    WHERE спр_СтатьиЗатрат_ЗНВП._Marked = 0
)
,Join__спр_СтатьиЗатрат_ЗНВП__регнакЗНВП AS (
    SELECT
        *
    FROM 
        регНак_ЗатратыНаВыпускПродукции
        LEFT JOIN
            спр_СтатьиЗатрат_ЗНВП
            ON
                регНак_ЗатратыНаВыпускПродукции.FK_спр_СтатьиЗатрат_ЗНВП_ЗатратыНаВыпускПродукции
                    = спр_СтатьиЗатрат_ЗНВП.ID_СтатьиЗатрат_ЗНВП
)
,Props_СумаБракуЗагальна_ЗатратыНаВыпускПродукции AS (
    SELECT
        MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции

        ,SUM (
            CASE 
                WHEN Наименование_СтатьиЗатрат_ЗНВП LIKE '%Технологічні%'
                    THEN Количество_ЗатратыНаВыпускПродукции
                ELSE 0
            END
        ) props_СумаБраку_ЗатратыНаВыпускПродукции

        ,SUM(Количество_ЗатратыНаВыпускПродукции) props_СумаЗагальна_ЗатратыНаВыпускПродукции


    FROM Join__спр_СтатьиЗатрат_ЗНВП__регнакЗНВП
    
    GROUP BY
    MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции
)





----------------------------------------- VIEWS -------------------------------------------
-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
----------------------------------- BaseView Joins 1:1 ------------------------------------





,Join__регнакВыпускПродукции__докОтчетПроизводстваЗаСмену AS ( -- 1:1
    SELECT -- агрегації немає, бо зараз по структурі 1:1, але може бути 1:N колись десь
        *
    FROM 
        докОтчетПроизводстваЗаСмену
        LEFT JOIN 
            регНак_ВыпускПродукции
            ON 
                докОтчетПроизводстваЗаСмену.ID__Ссылка__докОтчетПроизводстваЗаСмену 
                    = регНак_ВыпускПродукции.FK__Регистратор__регнакВыпускПродукции
    WHERE регНак_ВыпускПродукции.TRef = 0x000001AA -- докОтчетПроизводстваЗаСмену 
)

,Join__спрВидыПодразделений__докОтчетПроизводстваЗаСмену AS (  -- 1:1
    SELECT
        *
    FROM 
        Join__регнакВыпускПродукции__докОтчетПроизводстваЗаСмену
        LEFT JOIN 
            спр_ВидыПодразделений
            ON 
                Join__регнакВыпускПродукции__докОтчетПроизводстваЗаСмену.FK__Подразделение__спрВидыПодразделений_докОПЗС 
                    = спр_ВидыПодразделений.ID_ВидыПодразделений
)

,Join__спрСмена__докОтчетПроизводстваЗаСмену AS ( -- 1:1
    SELECT
        *
    FROM
        Join__спрВидыПодразделений__докОтчетПроизводстваЗаСмену
        LEFT JOIN
            спрСмена
            ON
                Join__спрВидыПодразделений__докОтчетПроизводстваЗаСмену.FK__Смена__спрСмена_докОтчетПроизводстваЗаСмену
                    = спрСмена.PK__Ссылка__спрСмена
)

,Join__регнакВремяИзготовления__докОПЗС AS ( -- 1:1
    SELECT
        *
    FROM 
        Join__спрСмена__докОтчетПроизводстваЗаСмену
        LEFT JOIN 
            регНак_ВремяИзготовления
            ON 
                Join__спрСмена__докОтчетПроизводстваЗаСмену.FK_спр_ВидыПодразделений_ВыпускПродукции
                    = регНак_ВремяИзготовления.FK_спр_ВидыПодразделений_ВремяИзготовления
                AND
                Join__спрСмена__докОтчетПроизводстваЗаСмену.FK_спр_Номенклатура_ВыпускПродукции 
                    = регНак_ВремяИзготовления.FK_спр_Номенклатура_ВремяИзготовления
    WHERE rn__регНак_ВремяИзготовления = 1
)

,Join__Props_СумаБракуЗагальна_ЗатратыНаВыпускПродукции__докОПЗС AS (
    SELECT
        *
    FROM
        Join__регнакВремяИзготовления__докОПЗС
        LEFT JOIN
            Props_СумаБракуЗагальна_ЗатратыНаВыпускПродукции
            ON 
                Join__регнакВремяИзготовления__докОПЗС.ID__Ссылка__докОтчетПроизводстваЗаСмену
                    = Props_СумаБракуЗагальна_ЗатратыНаВыпускПродукции.MainFK_док_ОтчетПроизводстваЗаСмену_ЗатратыНаВыпускПродукции
)

,Basejoins__докОПЗС AS (
    SELECT 
        *
    FROM
        Join__Props_СумаБракуЗагальна_ЗатратыНаВыпускПродукции__докОПЗС
)





----------------------------------- BaseView Joins 1:1 ------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
------------------------------------ TABLEPARTSJOINS --------------------------------------





,Join__TbptИсполнители__докОПЗС AS ( -- 1:N
    SELECT
        *
    FROM
        Basejoins__докОПЗС
        LEFT JOIN
            TbptИсполнители__докОПЗС
            ON 
                Basejoins__докОПЗС.ID__Ссылка__докОтчетПроизводстваЗаСмену
                    = TbptИсполнители__докОПЗС.ParentID__докОтчетПроизводстваЗаСмену__TbptИ_докОПЗС
)





------------------------------------ TABLEPARTSJOINS --------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
------------------------------------------------------------------------ OLD OEE ----------





,Props__ПереходиХв__докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
        ,DATEDIFF(
            MINUTE,
                LAG(Join__регнакВремяИзготовления__докОПЗС.own__КонецСмены__докОтчетПроизводстваЗаСмену) OVER (
                    PARTITION BY Join__регнакВремяИзготовления__докОПЗС.FK__Подразделение__спрВидыПодразделений_докОПЗС
                    ORDER BY Join__регнакВремяИзготовления__докОПЗС.own__НачалоСмены__докОтчетПроизводстваЗаСмену
                ),
            Join__регнакВремяИзготовления__докОПЗС.own__НачалоСмены__докОтчетПроизводстваЗаСмену
        ) AS ПереходиХв
    FROM
        Join__регнакВремяИзготовления__докОПЗС
)



,Join_Props_ТривалістьПростоїв_Простои_докОтчетПроизводстваЗаСмену AS ( -- 1:N
    SELECT 
        *
    FROM 
        Props__ПереходиХв__докОтчетПроизводстваЗаСмену
        LEFT JOIN 
            Props_ТривалістьПростоїв_Простои
            ON
                Props__ПереходиХв__докОтчетПроизводстваЗаСмену.ID__Ссылка__докОтчетПроизводстваЗаСмену 
                    = Props_ТривалістьПростоїв_Простои.FK_докОтчетПроизводстваЗаСмену_Простои
)

,Join_Props__ТривалістьРемонтів__регсведРемонты AS ( -- 1:N
    SELECT
        *
    FROM
        Join_Props_ТривалістьПростоїв_Простои_докОтчетПроизводстваЗаСмену
        LEFT JOIN
            Props__ТривалістьРемонтів__регсведРемонты
            ON
                Join_Props_ТривалістьПростоїв_Простои_докОтчетПроизводстваЗаСмену.ID__Ссылка__докОтчетПроизводстваЗаСмену
                    = Props__ТривалістьРемонтів__регсведРемонты.FK__докОтчетПроизводстваЗаСмену__регсведРемонты
)


,Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
        ,DATEDIFF(
            MINUTE, Join_Props__ТривалістьРемонтів__регсведРемонты.own__НачалоСмены__докОтчетПроизводстваЗаСмену, Join_Props__ТривалістьРемонтів__регсведРемонты.own__КонецСмены__докОтчетПроизводстваЗаСмену
        ) props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену
    FROM 
        Join_Props__ТривалістьРемонтів__регсведРемонты
)

,Props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
        ,CASE
            WHEN
                Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену.props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену
                    - ISNULL(Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену.DurationMinutes_Простои, 0)
                        - ISNULL(Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену.DurationMinutes_Ремонты, 0)
                            < 0
                THEN 0 -- перевірка на <0 тіпа
            ELSE
                Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену.props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену -- трохи копіпаст, але не страшно
                    - ISNULL(Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену.DurationMinutes_Простои, 0)
                        - ISNULL(Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену.DurationMinutes_Ремонты, 0)
        END props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену
    FROM
        Props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену
)

,Props__ФактШтХв__докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
        ,Props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену.Количество_ВыпускПродукции
            / 
                NULLIF(Props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену.props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену, 0)
                    props__ФактШтХв__докОтчетПроизводстваЗаСмену
    FROM
        Props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену
)

,Props__ДоступністьOEE__докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
        ,CASE
            WHEN (
                NULLIF(Props__ФактШтХв__докОтчетПроизводстваЗаСмену.props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену, 0)
                    * 1.0
                        /   
                            NULLIF(Props__ФактШтХв__докОтчетПроизводстваЗаСмену.props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену, 0)
            ) > 1
                THEN 1
            ELSE (
                NULLIF(Props__ФактШтХв__докОтчетПроизводстваЗаСмену.props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену, 0)
                    * 1.0
                        /   
                            NULLIF(Props__ФактШтХв__докОтчетПроизводстваЗаСмену.props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену, 0)
            )
        END props__ДоступністьOEE__докОтчетПроизводстваЗаСмену
    FROM
        Props__ФактШтХв__докОтчетПроизводстваЗаСмену
)

,Props__ПродуктивністьOEE__докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
        ,CASE
            WHEN (
                NULLIF(Props__ДоступністьOEE__докОтчетПроизводстваЗаСмену.props__ФактШтХв__докОтчетПроизводстваЗаСмену, 0)
                    * 1.0
                        / 
                            NULLIF(Props__ДоступністьOEE__докОтчетПроизводстваЗаСмену.Скорость_ВремяИзготовления, 0)
            ) > 1
                THEN 1
            ELSE (
                NULLIF(Props__ДоступністьOEE__докОтчетПроизводстваЗаСмену.props__ФактШтХв__докОтчетПроизводстваЗаСмену, 0)
                    * 1.0
                        / 
                            NULLIF(Props__ДоступністьOEE__докОтчетПроизводстваЗаСмену.Скорость_ВремяИзготовления, 0)
            )
        END props__ПродуктивністьOEE__докОтчетПроизводстваЗаСмену
    FROM
        Props__ДоступністьOEE__докОтчетПроизводстваЗаСмену
)





------------------------------------------------------------------------ OLD OEE ----------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
-------------------------------------------------------------------- Доступність ----------





,Agr__БезВидЗміниНевідомо__докОПЗС AS (
    SELECT
        *
    FROM
        Join__Props_СумаБракуЗагальна_ЗатратыНаВыпускПродукции__докОПЗС
    WHERE
        calc__ВидЗміни__докОтчетПроизводстваЗаСмену <> 'Невідомо'
)

,Agr__PreОднаЗміна__докОПЗС AS (
    SELECT
        *

        ,CAST(imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date) AS date__ДатаЗміни__ОднаЗміна_докОПЗС

        ,COUNT(*) OVER (
            PARTITION BY 
                CAST(imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date),
                calc__ВидЗміни__докОтчетПроизводстваЗаСмену,
                Назва_ВидыПодразделений
        ) AS КількістьЗвітів

        ,AVG(Скорость_ВремяИзготовления) OVER (
            PARTITION BY 
                CAST(imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date),
                calc__ВидЗміни__докОтчетПроизводстваЗаСмену,
                Назва_ВидыПодразделений
        ) AS Avg__СкоростьВремяИзготовления

        ,SUM(Количество_ВыпускПродукции) OVER (
            PARTITION BY 
                CAST(imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date),
                calc__ВидЗміни__докОтчетПроизводстваЗаСмену,
                Назва_ВидыПодразделений
        ) AS SUM__КоличествоПоЛінії_ВыпускПродукции

        ,SUM(props_СумаБраку_ЗатратыНаВыпускПродукции) OVER (
            PARTITION BY 
                CAST(imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date),
                calc__ВидЗміни__докОтчетПроизводстваЗаСмену,
                Назва_ВидыПодразделений
        ) AS SUM__СумаБракуЛінія_ЗатратыНаВыпускПродукции

        ,SUM(props_СумаЗагальна_ЗатратыНаВыпускПродукции) OVER (
            PARTITION BY 
                CAST(imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date),
                calc__ВидЗміни__докОтчетПроизводстваЗаСмену,
                Назва_ВидыПодразделений
        ) AS SUM__СумаЗагальнаЛінія_ЗатратыНаВыпускПродукции

        ,ROW_NUMBER() OVER (
            PARTITION BY 
                CAST(imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date),
                calc__ВидЗміни__докОтчетПроизводстваЗаСмену,
                Назва_ВидыПодразделений
            ORDER BY 
                imp__ДатаЧас__докОтчетПроизводстваЗаСмену DESC
        ) AS rn

    FROM Agr__БезВидЗміниНевідомо__докОПЗС
)

,Agr__ОднаЗміна__докОПЗС AS (
    SELECT 
        *
    FROM 
        Agr__PreОднаЗміна__докОПЗС
    WHERE rn = 1
)

,Props__ДатаВидЛінія__Agr_ОднаЗміна_докОПЗС AS (
    SELECT
        *
        ,CONVERT(
                nvarchar(10), 
                    Agr__ОднаЗміна__докОПЗС.date__ДатаЗміни__ОднаЗміна_докОПЗС
        ) + ', ' + Agr__ОднаЗміна__докОПЗС.calc__ВидЗміни__докОтчетПроизводстваЗаСмену + ', ' + Agr__ОднаЗміна__докОПЗС.Назва_ВидыПодразделений
            props__ДатаВидЛінія__Agr_ОднаЗміна_докОПЗС
    FROM
        Agr__ОднаЗміна__докОПЗС
)

,Props__АктивнийЧас__Agr_ОднаЗміна_докОПЗС AS (
    SELECT
        *
        ,600 AS props__АктивнийЧас__Agr_ОднаЗміна_докОПЗС

        -- зміна 06:00-18:00 Денна / 18:00-06:00 Нічна -- 12год -- 720хв. 
        -- Перерви (am/pm):
        -- 6:00-6:20 1Перезмінка 20хв
        -- 9:00-9:20 1Перерва 20хв
        -- 12:00-1:00 Обід 60хв
        -- 4:00-4:20 2Перерва 20хв
        -- 720 - 20 - 60 - 20*2 = 600

    FROM
        Props__ДатаВидЛінія__Agr_ОднаЗміна_докОПЗС
)

,Join__Agr_СумаРемонтівПоЗміні_регсведРемонты__докОПЗС AS (
    SELECT
        *
    FROM
        Props__АктивнийЧас__Agr_ОднаЗміна_докОПЗС
        LEFT JOIN
            Agr__СумаРемонтівПоЗміні__регсведРемонты
            ON
                Props__АктивнийЧас__Agr_ОднаЗміна_докОПЗС.props__ДатаВидЛінія__Agr_ОднаЗміна_докОПЗС
                    = Agr__СумаРемонтівПоЗміні__регсведРемонты.Зміна_Ремонты
)

,Join__Agr_СумаПростоївПоЗміні_регсведРемонты__докОПЗС AS (
    SELECT
        *
    FROM
        Join__Agr_СумаРемонтівПоЗміні_регсведРемонты__докОПЗС
        LEFT JOIN
            Agr__СумаПростоївПоЗміні__регсведПростои
            ON
                Join__Agr_СумаРемонтівПоЗміні_регсведРемонты__докОПЗС.props__ДатаВидЛінія__Agr_ОднаЗміна_докОПЗС
                    = Agr__СумаПростоївПоЗміні__регсведПростои.Зміна_Простои
)

,Join__Agr_СумаПереходівПоЗміні_регсведРемонты__докОПЗС AS (
    SELECT
        *
    FROM
        Join__Agr_СумаПростоївПоЗміні_регсведРемонты__докОПЗС
        LEFT JOIN
            Agr__СумаПереходівПоЗміні__регсведПереходы
            ON
                Join__Agr_СумаПростоївПоЗміні_регсведРемонты__докОПЗС.props__ДатаВидЛінія__Agr_ОднаЗміна_докОПЗС
                    = Agr__СумаПереходівПоЗміні__регсведПереходы.Зміна_Переходы
)

,Props__СумаПауз__докОПЗС AS (
    SELECT
        *
        ,ISNULL(Join__Agr_СумаПереходівПоЗміні_регсведРемонты__докОПЗС.TotalDurationMinutes_Ремонты,0) + ISNULL(Join__Agr_СумаПереходівПоЗміні_регсведРемонты__докОПЗС.TotalDurationMinutes_Простои, 0) + ISNULL(Join__Agr_СумаПереходівПоЗміні_регсведРемонты__докОПЗС.TotalDurationMinutes_Переходы, 0)
            props__СумаПауз__докОПЗС
    FROM
        Join__Agr_СумаПереходівПоЗміні_регсведРемонты__докОПЗС
)

,Props__ФактичнийЧас__докОПЗС AS (
    SELECT
        *
        ,Props__СумаПауз__докОПЗС.props__АктивнийЧас__Agr_ОднаЗміна_докОПЗС 
            - ISNULL(Props__СумаПауз__докОПЗС.props__СумаПауз__докОПЗС, 0)
            props__ФактичнийЧас__докОПЗС
    FROM 
        Props__СумаПауз__докОПЗС
)

,Props__ДоступністьOEE__докОПЗС AS (
    SELECT
        *
        ,props__ФактичнийЧас__докОПЗС * 1.0
            / props__АктивнийЧас__Agr_ОднаЗміна_докОПЗС
            props__ДоступністьOEE__докОПЗС
    FROM
        Props__ФактичнийЧас__докОПЗС
)





-------------------------------------------------------------------- Доступність ----------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Продуктивність ----------





,Props__ФактичнаШвидкістьВиготовлення__докОПЗС AS (
    SELECT
        *
        ,Props__ДоступністьOEE__докОПЗС.SUM__КоличествоПоЛінії_ВыпускПродукции
            / NULLIF(Props__ДоступністьOEE__докОПЗС.props__ФактичнийЧас__докОПЗС, 0)
            props__ФактичнаШвидкістьВиготовлення__докОПЗС
    FROM 
        Props__ДоступністьOEE__докОПЗС
)

,Props__ПродуктивністьОЕЕ__докОПЗС AS (
    SELECT
        *
        ,IIF(
            props__ФактичнаШвидкістьВиготовлення__докОПЗС 
                / NULLIF(Avg__СкоростьВремяИзготовления, 0) > 100,
                100,
                    props__ФактичнаШвидкістьВиготовлення__докОПЗС 
                        / NULLIF(Avg__СкоростьВремяИзготовления, 0)
        ) AS props__ПродуктивністьОЕЕ__докОПЗС
    FROM
        Props__ФактичнаШвидкістьВиготовлення__докОПЗС
)




----------------------------------------------------------------- Продуктивність ----------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
------------------------------------------------------------------------- Якість, OEE -----





,Props__СобівартістьОдиниці__докОПЗС AS (
    SELECT
        *
        ,Props__ПродуктивністьОЕЕ__докОПЗС.SUM__СумаЗагальнаЛінія_ЗатратыНаВыпускПродукции
            / Props__ПродуктивністьОЕЕ__докОПЗС.SUM__КоличествоПоЛінії_ВыпускПродукции
            props__СобівартістьОдиниці__докОПЗС
    FROM
        Props__ПродуктивністьОЕЕ__докОПЗС
)

,Props__КількістьБраку__докОПЗС AS (
    SELECT
        *
        ,Props__СобівартістьОдиниці__докОПЗС.SUM__СумаБракуЛінія_ЗатратыНаВыпускПродукции
            / ISNULL(Props__СобівартістьОдиниці__докОПЗС.props__СобівартістьОдиниці__докОПЗС, 0)
            props__КількістьБраку__докОПЗС
    FROM
        Props__СобівартістьОдиниці__докОПЗС
)

,Props__НеБрак__докОПЗС AS (
    SELECT
        *
        ,ISNULL(SUM__КоличествоПоЛінії_ВыпускПродукции, 0) - ISNULL(props__КількістьБраку__докОПЗС, 0)
            props__НеБрак__докОПЗС
    FROM
        Props__КількістьБраку__докОПЗС
)

,Props__ЯкістьОЕЕ__докОПЗС AS (
    SELECT
        *
        ,props__НеБрак__докОПЗС
            / NULLIF(SUM__КоличествоПоЛінії_ВыпускПродукции, 0)
            props__ЯкістьОЕЕ__докОПЗС
    FROM
        Props__НеБрак__докОПЗС
)

,Props__OEE__докОПЗС AS (
    SELECT
        *
        ,Props__ЯкістьОЕЕ__докОПЗС.props__ДоступністьOEE__докОПЗС
            * Props__ЯкістьОЕЕ__докОПЗС.props__ПродуктивністьОЕЕ__докОПЗС
                * Props__ЯкістьОЕЕ__докОПЗС.props__ЯкістьОЕЕ__докОПЗС
            props__OEE__докОПЗС
    FROM
        Props__ЯкістьОЕЕ__докОПЗС
)





------------------------------------------------------------------------- Якість, OEE -----
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
------------------------------- Оплата Працівникам Виробництва ----------------------------





,Join__Join_спрНормыОплатыТруда_докТОТП__докОПЗС AS (
    SELECT
        *
    FROM
        Join__TbptИсполнители__докОПЗС
        LEFT JOIN
            Join__спрНормыОплатыТруда__докТОТП
            ON
                Join__TbptИсполнители__докОПЗС.FK__Подразделение__спрВидыПодразделений_докОПЗС
                    = Join__спрНормыОплатыТруда__докТОТП.FK__Подразделение__спрПодразделение_докТОТП
                AND
                Join__TbptИсполнители__докОПЗС.FK__Должность__TbptИсполнители_докОПЗС
                    = Join__спрНормыОплатыТруда__докТОТП.FK__Должность__спрДолжностиОрганизаций_TbptТ_докТОТП
    WHERE 
        Join__спрНормыОплатыТруда__докТОТП.imp__Наименование__спрНормыОплатыТруда = 'Ставка'
)

,Join__спрСотрудникиОрганизаций__докОПЗС AS (
    SELECT
        *
    FROM 
        Join__Join_спрНормыОплатыТруда_докТОТП__докОПЗС
        LEFT JOIN
            спрСотрудникиОрганизаций
            ON 
                Join__Join_спрНормыОплатыТруда_докТОТП__докОПЗС.FK__Сотрудник__TbptИсполнители_докОПЗС
                    = спрСотрудникиОрганизаций.ID_СотрудникиОрганизаций
)

,Agr__МаксЛініяПоЗміні__докОПЗС AS (
    SELECT
        Join__спрСотрудникиОрганизаций__докОПЗС.Наименование_СотрудникиОрганизаций
        ,Join__спрСотрудникиОрганизаций__докОПЗС.imp__Наименование__спрДолжностиОрганизаций
        ,CAST(Join__спрСотрудникиОрганизаций__докОПЗС.imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date) date__Дата__докОтчетПроизводстваЗаСмену
        ,MAX(Join__спрСотрудникиОрганизаций__докОПЗС.own__Сумма__TbptТарифы_докТОТП) MAX__Сумма__TbptТарифы_докТОТП
    FROM
        Join__спрСотрудникиОрганизаций__докОПЗС
    GROUP BY
        Join__спрСотрудникиОрганизаций__докОПЗС.Наименование_СотрудникиОрганизаций
        ,CAST(Join__спрСотрудникиОрганизаций__докОПЗС.imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date)
        ,Join__спрСотрудникиОрганизаций__докОПЗС.imp__Наименование__спрДолжностиОрганизаций
)





------------------------------- Оплата Працівникам Виробництва ----------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
------------------------------------------------------------ Відсоток Браку Матеріалу ----- 





,Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
    FROM
        TbptМатериалы__докОПЗС
        LEFT JOIN
            спр_СтатьиЗатрат
            ON
                TbptМатериалы__докОПЗС.FK__СтатьяЗатрат__спрСтатьиЗатрат_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
                    = спр_СтатьиЗатрат.ID_СтатьиЗатрат
)

,Agregat__КількістьБракЗагальна__Tbpt_Материалы_докОтчетПроизводстваЗаСмену AS (
    SELECT
        Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.FK__Номенклатура__спрНоменклатура_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        ,Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.ParentID__докОтчетПроизводстваЗаСмену__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        ,SUM(
            CASE 
                WHEN
                    Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.Наименование_СтатьиЗатрат
                        LIKE '%Технологіч%'
                THEN
                    Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.own__Количество__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
                ELSE 0
            END
        ) oth__КількістьБрак__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        ,SUM(Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.own__Количество__Tbpt_Материалы_докОтчетПроизводстваЗаСмену) 
            oth__КількістьЗагальна__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
    FROM
        Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
    GROUP BY
        Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.FK__Номенклатура__спрНоменклатура_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        ,Join__спр_СтатьиЗатрат__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.ParentID__докОтчетПроизводстваЗаСмену__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
)

,Props__ВідсотокБракуМатеріалу__Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
        ,Agregat__КількістьБракЗагальна__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.oth__КількістьБрак__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
            * 1.0
                / 
                    NULLIF(Agregat__КількістьБракЗагальна__Tbpt_Материалы_докОтчетПроизводстваЗаСмену.oth__КількістьЗагальна__Tbpt_Материалы_докОтчетПроизводстваЗаСмену, 0)
            props__ВідсотокБракуМатеріалу__Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
    FROM
        Agregat__КількістьБракЗагальна__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
)

,Props__ЯкістьOEE__Agr_КількістьЗагальна_Tbpt_МдокОПЗС AS (
    SELECT
        *
        ,1 - Props__ВідсотокБракуМатеріалу__Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену.props__ВідсотокБракуМатеріалу__Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
            ЯкістьOEE
    FROM
        Props__ВідсотокБракуМатеріалу__Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
)

,Join_спрНоменклатура_докОПЗС AS (
    SELECT
        *
    FROM
        Props__ЯкістьOEE__Agr_КількістьЗагальна_Tbpt_МдокОПЗС
        LEFT JOIN
            спрНоменклатура
            ON
                Props__ЯкістьOEE__Agr_КількістьЗагальна_Tbpt_МдокОПЗС.FK__Номенклатура__спрНоменклатура_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
                    = спрНоменклатура.ID_спрНоменклатура
)

---------------------------------------------------------- ProjectJoin --------------------

,Join__Брак__Props_ВідсотокБракуМатеріалу_Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
    FROM
        Props__ПродуктивністьOEE__докОтчетПроизводстваЗаСмену
        LEFT JOIN
            Join_спрНоменклатура_докОПЗС
            ON
                Props__ПродуктивністьOEE__докОтчетПроизводстваЗаСмену.ID__Ссылка__докОтчетПроизводстваЗаСмену
                    = Join_спрНоменклатура_докОПЗС.ParentID__докОтчетПроизводстваЗаСмену__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
)





------------------------------------------------------------ Відсоток Браку Матеріалу ----- 
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Projects Vizes ----------



------------------------------------------------------------------------ OLD OEE ----------


,Main__докОтчетПроизводстваЗаСмену AS (
    SELECT
        *
    FROM
        Props__ПродуктивністьOEE__докОтчетПроизводстваЗаСмену
        -- Join__Брак__Props_ВідсотокБракуМатеріалу_Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
)
,Viz__OEE_ОтчетПроизводстваЗаСмену__докОтчетПроизводстваЗаСмену AS (
    SELECT
        Main__докОтчетПроизводстваЗаСмену.FK_спр_Номенклатура_ВыпускПродукции                           [FK Номенклатура]
        ,Main__докОтчетПроизводстваЗаСмену.Назва_ВидыПодразделений                                      [Підрозділ]
        ,Main__докОтчетПроизводстваЗаСмену.imp__Номер__докОтчетПроизводстваЗаСмену                      [Номер Зміни]
        ,Main__докОтчетПроизводстваЗаСмену.imp__Наименование__спрСмена                                  [Зміна]
        ,Main__докОтчетПроизводстваЗаСмену.calc__ВидЗміни__докОтчетПроизводстваЗаСмену                  [Вид Зміни]
        ,CAST(Main__докОтчетПроизводстваЗаСмену.imp__ДатаЧас__докОтчетПроизводстваЗаСмену AS date)      [Дата Зміни]
        ,Main__докОтчетПроизводстваЗаСмену.imp__ДатаЧас__докОтчетПроизводстваЗаСмену                    [ДатаЧас Зміни]
        ,Main__докОтчетПроизводстваЗаСмену.own__НачалоСмены__докОтчетПроизводстваЗаСмену                [Початок Зміни]
        ,Main__докОтчетПроизводстваЗаСмену.own__КонецСмены__докОтчетПроизводстваЗаСмену                 [Кінець Зміни]
        ,Main__докОтчетПроизводстваЗаСмену.props__ПланТривалістьЗміни__докОтчетПроизводстваЗаСмену      [План Тривалість Зміни хв]
        ,Main__докОтчетПроизводстваЗаСмену.Начало_Простои                                               [Початок Простою]
        ,Main__докОтчетПроизводстваЗаСмену.Конец_Простои                                                [Кінець Простою]
        ,Main__докОтчетПроизводстваЗаСмену.DurationMinutes_Простои                                      [Тривалість Простою хв]
        ,Main__докОтчетПроизводстваЗаСмену.own__НачалоРемонта_регсведРемонты                            [Початок Ремонту]
        ,Main__докОтчетПроизводстваЗаСмену.own__КонецРемонта_регсведРемонты                             [Кінець Ремонту]
        ,Main__докОтчетПроизводстваЗаСмену.ПереходиХв                                                   [Час між Звітами ДО хв]
        ,Main__докОтчетПроизводстваЗаСмену.DurationMinutes_Ремонты                                      [Тривалість Ремонту хв]
        ,Main__докОтчетПроизводстваЗаСмену.props__ФактТривалістьЗміни__докОтчетПроизводстваЗаСмену      [Факт Тривалість Зміни хв]
        ,Main__докОтчетПроизводстваЗаСмену.props__ДоступністьOEE__докОтчетПроизводстваЗаСмену           [Доступність %]
        ,Main__докОтчетПроизводстваЗаСмену.Количество_ВыпускПродукции                                   [К-сть Виготовленої Продукції]
        ,Main__докОтчетПроизводстваЗаСмену.Скорость_ВремяИзготовления                                   [План шт/хв]
        ,Main__докОтчетПроизводстваЗаСмену.props__ФактШтХв__докОтчетПроизводстваЗаСмену                 [Факт шт/хв]
        ,Main__докОтчетПроизводстваЗаСмену.props__ПродуктивністьOEE__докОтчетПроизводстваЗаСмену        [Продуктивність %]
        -- ,Main__докОтчетПроизводстваЗаСмену.НазваНоменклатури                                            [Матеріал]
        -- ,Main__докОтчетПроизводстваЗаСмену.oth__КількістьБрак__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        --                                                                                                 [Кількість Брак]
        -- ,Main__докОтчетПроизводстваЗаСмену.oth__КількістьЗагальна__Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        --                                                                                                 [Загальна Кількість]
        -- ,Main__докОтчетПроизводстваЗаСмену.props__ВідсотокБракуМатеріалу__Agregat_КількістьЗагальна_Tbpt_Материалы_докОтчетПроизводстваЗаСмену
        --                                                                                                 [Відсоток Браку]
        -- ,Main__докОтчетПроизводстваЗаСмену.ЯкістьOEE                                                    [Якість %]
    FROM
        Main__докОтчетПроизводстваЗаСмену
)



------------------------------- Оплата Працівникам Виробництва ----------------------------


,Main__pbixТарифиОплатПрацівникам__докОПЗС AS (
    SELECT
        *
    FROM
        Join__спрСотрудникиОрганизаций__докОПЗС
)

,Viz__pbixТарифиОплатПрацівникам__докОПЗС AS (
    SELECT 
        Main__pbixТарифиОплатПрацівникам__докОПЗС.own__НачалоСмены__докОтчетПроизводстваЗаСмену     [Дата Початку Звіту]
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__Наименование__спрДолжностиОрганизаций       [Посада]
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__Наименование__спрНормыОплатыТруда           [Норма Оплати]
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.own__Сумма__TbptТарифы_докТОТП                   [Сума]
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.Наименование_СотрудникиОрганизаций               [Співробітник]
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.calc__ВидЗміни__докОтчетПроизводстваЗаСмену      [Вид Зміни]
		,Main__pbixТарифиОплатПрацівникам__докОПЗС.Назва_ВидыПодразделений                          [Лінія]

        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.calc__ВидЗміни__докОтчетПроизводстваЗаСмену
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__ДатаЧас__докОтчетПроизводстваЗаСмену
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__ДатаИзменений__докТарифыОплатыТрудаПроизводства
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__Код__спрСмена
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__Наименование__спрДолжностиОрганизаций
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__Наименование__спрНормыОплатыТруда
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__Наименование__спрСмена
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.imp__Номер__докОтчетПроизводстваЗаСмену
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.own__НачалоСмены__докОтчетПроизводстваЗаСмену
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.own__КонецСмены__докОтчетПроизводстваЗаСмену
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.own__Сумма__TbptТарифы_докТОТП
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.Количество_ВыпускПродукции
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.Назва_ВидыПодразделений
        ,Main__pbixТарифиОплатПрацівникам__докОПЗС.Наименование_СотрудникиОрганизаций
    FROM
        Main__pbixТарифиОплатПрацівникам__докОПЗС
)

-- SELECT *
-- FROM Agr__МаксЛініяПоЗміні__докОПЗС
-- ORDER BY date__Дата__докОтчетПроизводстваЗаСмену DESC


------------------------------------------------------------------------- Якість, OEE -----


,Viz__Main_OEE__докОПЗС AS (
    SELECT
        Props__OEE__докОПЗС.date__ДатаЗміни__ОднаЗміна_докОПЗС                  [Дата Зміни]
        ,Props__OEE__докОПЗС.Avg__СкоростьВремяИзготовления                     [Середня Планова Швидкість Виготовлення по Лінії]
        ,Props__OEE__докОПЗС.calc__ВидЗміни__докОтчетПроизводстваЗаСмену        [Денна/Нічна Зміна]
        ,Props__OEE__докОПЗС.props__OEE__докОПЗС                                [ОЕЕ]
        ,Props__OEE__докОПЗС.props__АктивнийЧас__Agr_ОднаЗміна_докОПЗС          [Активний Час 600хв]
        ,Props__OEE__докОПЗС.props__ДатаВидЛінія__Agr_ОднаЗміна_докОПЗС         [Одиниця Звіту]
        ,Props__OEE__докОПЗС.props__ДоступністьOEE__докОПЗС                     [Доступність % по Лінії]
        ,Props__OEE__докОПЗС.props__КількістьБраку__докОПЗС                     [Кількість Браку по Лінії]
        ,Props__OEE__докОПЗС.props__ПродуктивністьОЕЕ__докОПЗС                  [Продуктивність % по Лінії]
        ,Props__OEE__докОПЗС.props__СобівартістьОдиниці__докОПЗС                [Собівартість Одиниці по Лінії]
        ,Props__OEE__докОПЗС.props__СумаПауз__докОПЗС                           [Сума Пауз по Лінії]
        ,Props__OEE__докОПЗС.props__ФактичнаШвидкістьВиготовлення__докОПЗС      [Фактична Швидкість Виготовлення по Лінії]
        ,Props__OEE__докОПЗС.props__ФактичнийЧас__докОПЗС                       [Фактичний Час Зміни по Лінії]
        ,Props__OEE__докОПЗС.props__ЯкістьОЕЕ__докОПЗС                          [Якість % по Лінії]
        ,Props__OEE__докОПЗС.SUM__КоличествоПоЛінії_ВыпускПродукции             [К-сть Виготовленої Продукції по Лінії]
        ,Props__OEE__докОПЗС.SUM__СумаБракуЛінія_ЗатратыНаВыпускПродукции       [Сума Браку по Лінії]
        ,Props__OEE__докОПЗС.SUM__СумаЗагальнаЛінія_ЗатратыНаВыпускПродукции    [Загальна собівартість по Лінії]
        ,Props__OEE__докОПЗС.TotalDurationMinutes_Переходы                      [Тривалість Переходів по Лінії]
        ,Props__OEE__докОПЗС.TotalDurationMinutes_Простои                       [Тривалість Простоїв по Лінії]
        ,Props__OEE__докОПЗС.TotalDurationMinutes_Ремонты                       [Тривалість Ремонтів по Лінії]
        ,Props__OEE__докОПЗС.КількістьЗвітів                                    [Кількість Звітів за Зміну]
        ,Props__OEE__докОПЗС.Назва_ВидыПодразделений                            [Лінія]
    FROM
        Props__OEE__докОПЗС
)

SELECT 
    *
FROM
    Viz__Main_OEE__докОПЗС
ORDER BY
    [Дата Зміни] DESC
--

-- working

-- SELECT 
--     *
-- FROM
--     Viz__Main_OEE__докОПЗС
-- WHERE
--     Лінія = 'Цех №5 (Лінія1)'
-- ORDER BY
--     [Дата Зміни] DESC

-- SELECT
--     *
-- FROM
--     Agr__PreОднаЗміна__докОПЗС


----------------------------------------------------------------- Projects Vizes ----------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Working Viz -------------





-- ,workingMain AS (
--     SELECT
--         *
--     FROM
--         Join__спрСотрудникиОрганизаций__докОПЗС
-- )


-- ,working AS (
--     SELECT 
--         workingMain.imp__ДатаЧас__докОтчетПроизводстваЗаСмену
--         ,workingMain.Назва_ВидыПодразделений
--         ,workingMain.imp__Наименование__спрСмена
--         ,workingMain.own__НачалоСмены__докОтчетПроизводстваЗаСмену
--         ,workingMain.own__КонецСмены__докОтчетПроизводстваЗаСмену
--         ,workingMain.imp__Наименование__спрДолжностиОрганизаций
--         ,workingMain.imp__Наименование__спрНормыОплатыТруда
--         ,workingMain.own__Сумма__TbptТарифы_докТОТП
--         ,workingMain.Наименование_СотрудникиОрганизаций
--     FROM
--         workingMain
-- )



-- FROM working
-- WHERE Назва_ВидыПодразделений <> 'Виробництво CЕРВЕТОК'
-- AND Назва_ВидыПодразделений = 'Цех №7 (Лінія1) прихід червень 2024'
-- AND 
--     DATEDIFF(
--         MINUTE, working.own__НачалоСмены__докОтчетПроизводстваЗаСмену, working.own__КонецСмены__докОтчетПроизводстваЗаСмену
--     ) > 5
-- ORDER BY own__НачалоСмены__докОтчетПроизводстваЗаСмену DESC
-- ORDER BY imp__ДатаЧас__докОтчетПроизводстваЗаСмену DESC


