;WITH 
докЗаказПокупателя AS (
    SELECT
        докЗаказПокупателя._IDRRef ID__Ссылка__докЗаказПокупателя
        ,докЗаказПокупателя._Fld24458RRef FK__Статус__спрСтатусыЗаказовПокупателя_докЗПок
        ,докЗаказПокупателя._Fld5546RRef FK__Контрагент__спрКонтрагенты_докЗПок
        ,докЗаказПокупателя._Fld5536RRef FK__ВалютаДокумента__спрВалюты_докЗПок
        ,DATEADD(YEAR, -2000, докЗаказПокупателя._Date_Time) imp__Дата__докЗаказПокупателя
        ,докЗаказПокупателя._Number imp__Номер__докЗаказПокупателя
        ,DATEADD(YEAR, -2000, CAST(докЗаказПокупателя._Fld5540 AS datetime2)) own__ДатаОтгрузки__докЗаказПокупателя
        ,докЗаказПокупателя._Posted sys__Проведен__докЗаказПокупателя
        ,докЗаказПокупателя._Marked sys__ПометкаУдаления__докЗаказПокупателя
    FROM 
        _Document316 AS докЗаказПокупателя
    WHERE 
        докЗаказПокупателя._Posted = 1 
        AND 
        докЗаказПокупателя._Marked = 0
        AND
        докЗаказПокупателя._Date_Time >= '4025-01-01' -- надто величезні масштаби даних, щоб виводити всі роки (це вже 65к)
)
,TbptТовары__докЗПок AS (
    SELECT
        TbptТовары__докЗПок._Document316_IDRRef ParentID__докЗаказПокупателя__TbptТ_докЗПок
        ,TbptТовары__докЗПок._Fld5576RRef FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
        ,TbptТовары__докЗПок._Fld22909 own__СначалаЗаказано__TbptТ_докЗПок
        ,TbptТовары__докЗПок._Fld5585 own__Цена__TbptТ_докЗПок
    FROM 
        _Document316_VT5569 AS TbptТовары__докЗПок
)
,Join__TbptТовары__докЗПок AS (
    SELECT
        *
    FROM 
        докЗаказПокупателя
        LEFT JOIN
            TbptТовары__докЗПок 
            ON докЗаказПокупателя.ID__Ссылка__докЗаказПокупателя
                = TbptТовары__докЗПок.ParentID__докЗаказПокупателя__TbptТ_докЗПок 
)
,регнакПродажи AS (
    SELECT
        регнакПродажи._RecorderRRef FK__Регистратор__регнакПродажи
        ,регнакПродажи._Fld22003RRef FK__Номенклатура__спрНоменклатура_регнакП
        ,регнакПродажи._Fld22005_RRRef FK__Заказ__докЗаказПокупателя_регнакП
        ,регнакПродажи._Period imp__Период__регнакПродажи
        ,регнакПродажи._Fld22012 own__Количество__регнакПродажи
    FROM 
        _AccumRg22002 AS регнакПродажи
    WHERE 
        регнакПродажи._Active = 1
)
,докЗаказНаПроизводство AS (
    SELECT
        докЗаказНаПроизводство._IDRRef ID__Ссылка__докЗаказНаПроизводство
        ,DATEADD(YEAR, -2000, докЗаказНаПроизводство._Date_Time) imp__Дата__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Number imp__Номер__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Posted sys__Проведен__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Marked sys__ПометкаУдаления__докЗаказНаПроизводство
    FROM 
        _Document315 AS докЗаказНаПроизводство
    WHERE
        докЗаказНаПроизводство._Posted = 1
        AND
        докЗаказНаПроизводство._Marked = 0
)
,TbptПродукция__докЗНП AS (
    SELECT
        *
    FROM (
        SELECT
            _Document315_VT5475._Document315_IDRRef ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП,
            _Document315_VT5475._Fld5477RRef FK__Номенклатура__спрНоменклатура_TbptП_докЗНП,
            _Document315_VT5475._Fld5486_RRRef FK__Заказ__TbptПродукция_докЗНП,
            _Document315_VT5475._Fld23758RRef FK__Статус__TbptПродукция_докЗНП,
            _Document315_VT5475._Fld5481 own__Кількість__TbptПродукция_докЗНП,
            CASE 
                WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 'Виконано'
                WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 'В роботі'
                WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 'Новий'
                ELSE '-'
            END AS calc__Статус__TbptПродукция_докЗНП, -- це з.. статусиЗаказовНаПроизв шось таке. може трохи інакше називається
            ROW_NUMBER() OVER(
                PARTITION BY _Fld5486_RRRef, _Fld5477RRef
                ORDER BY 
                    CASE 
                        WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 1  -- Виконано
                        WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 2  -- В роботі
                        WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 3  -- Новий
                        ELSE 4
                    END
            ) calc__RowNumber__TbptПродукция_докЗНП
        FROM _Document315_VT5475
    ) TbptПродукция__докЗНП
    WHERE calc__RowNumber__TbptПродукция_докЗНП = 1
)
,Join__TbptПродукция__докЗНП AS (
    SELECT
        *
        ,CASE 
            WHEN calc__Статус__TbptПродукция_докЗНП = 'В роботі'
                THEN own__Кількість__TbptПродукция_докЗНП
            ELSE 0
        END AS own__Кількість__TbptПродукция_докЗНП_ВРоботі
        ,CASE 
            WHEN calc__Статус__TbptПродукция_докЗНП = 'Виконано'
                THEN own__Кількість__TbptПродукция_докЗНП
            ELSE 0
        END AS own__Кількість__TbptПродукция_докЗНП_Виконано
    FROM
        докЗаказНаПроизводство
        LEFT JOIN 
            TbptПродукция__докЗНП 
            ON докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство 
                = TbptПродукция__докЗНП.ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП
    WHERE 
        докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство <> 0xA66C0050569F1E6A11EF8A2413FC71A6 -- там помилка в базі
)
,регнакТоварыНаСкладах AS (
    SELECT
        регнакТоварыНаСкладах._RecorderRRef FK__Регистратор__регнакТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22375RRef FK__спрНоменклатура__ТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22374RRef FK__Склад__спрСклады_регнакТНС
        ,регнакТоварыНаСкладах._Period imp__Период__регнакТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22379 own__Количество__регнакТоварыНаСкладах
        ,регнакТоварыНаСкладах._RecordKind sys__RecordKind__регнакТоварыНаСкладах -- 0 - приход, 1 - расход
    FROM 
        _AccumRg22373 AS регнакТоварыНаСкладах
    WHERE
        регнакТоварыНаСкладах._Active = 1
)
,Agr__СумаПоНоменклатурі__регнакТНС AS (
    SELECT
        регнакТоварыНаСкладах.FK__спрНоменклатура__ТоварыНаСкладах
        ,регнакТоварыНаСкладах.FK__Склад__спрСклады_регнакТНС
        ,SUM(
            IIF(
                регнакТоварыНаСкладах.sys__RecordKind__регнакТоварыНаСкладах = 1,
                -регнакТоварыНаСкладах.own__Количество__регнакТоварыНаСкладах,
                регнакТоварыНаСкладах.own__Количество__регнакТоварыНаСкладах
            )
        ) AS SumByEachNomenklatura_ТоварыНаСкладах
    FROM
        регнакТоварыНаСкладах
    GROUP BY
        регнакТоварыНаСкладах.FK__спрНоменклатура__ТоварыНаСкладах
        ,регнакТоварыНаСкладах.FK__Склад__спрСклады_регнакТНС
    HAVING регнакТоварыНаСкладах.FK__Склад__спрСклады_регнакТНС = 0xB2B0001A64C7AAC211E781AB2E318DA9 -- склад готової продукції (основний)
)
,регнакВнутренниеРезервы AS (
    SELECT
        регнакВнутренниеРезервы._RecorderRRef FK__Регистратор__регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._RecorderTRef TRef__регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24505RRef FK__Номенклатура__спрНоменклатура_регнакВР
        ,регнакВнутренниеРезервы._Fld24506_RRRef FK__ДокументРезерва__регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24506_RTRef TRef__ДокументРезерва__регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._Period imp__Период__регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24507 own__Количество__регнакВнутренниеРезервы
        ,CASE
            WHEN регнакВнутренниеРезервы._RecordKind = 0 
                THEN '+'
            WHEN регнакВнутренниеРезервы._RecordKind = 1
                THEN '-'
        END AS calc__Тип__регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._RecordKind sys__RecordKind__регнакВнутренниеРезервы -- 0 - приход, 1 - расход
        ,регнакВнутренниеРезервы._Active sys__Активность__регнакВнутренниеРезервы
    FROM 
        _AccumRg24504 AS регнакВнутренниеРезервы
)
,Agr__СумаПоНоменклатурі__регнакВнутренниеРезервы AS (
    SELECT
        регнакВнутренниеРезервы.FK__Номенклатура__спрНоменклатура_регнакВР FK__Номенклатура__спрНоменклатура_Agr_СПН_регнакВР
        ,SUM(
            IIF(
                регнакВнутренниеРезервы.sys__RecordKind__регнакВнутренниеРезервы = 1,
                -регнакВнутренниеРезервы.own__Количество__регнакВнутренниеРезервы,
                регнакВнутренниеРезервы.own__Количество__регнакВнутренниеРезервы
            )
        ) AS agr__СумаПоНоменклатурі__регнакВнутренниеРезервы
    FROM
        регнакВнутренниеРезервы
    GROUP BY
        регнакВнутренниеРезервы.FK__Номенклатура__спрНоменклатура_регнакВР
)
,Agr__СтворенняРеалізація__регнакВР AS (
    SELECT
        регнакВнутренниеРезервы.FK__Номенклатура__спрНоменклатура_регнакВР FK__Номенклатура__спрНоменклатура__Agr_СР_регнакВР
        ,регнакВнутренниеРезервы.FK__ДокументРезерва__регнакВнутренниеРезервы FK__ДокументРезерва__Agr_СР_регнакВР
        ,SUM(
            CASE 
                WHEN регнакВнутренниеРезервы.calc__Тип__регнакВнутренниеРезервы = '+'
                    THEN регнакВнутренниеРезервы.own__Количество__регнакВнутренниеРезервы
                ELSE 0
            END
        ) AS calc__СтворенняРезерву__Agr_СР_регнакВР
        ,SUM(
            CASE 
                WHEN регнакВнутренниеРезервы.calc__Тип__регнакВнутренниеРезервы = '-'
                    THEN регнакВнутренниеРезервы.own__Количество__регнакВнутренниеРезервы
                ELSE 0
            END
        ) AS calc__РеалізаціяРезерву__Agr_СР_регнакВР
    FROM
        регнакВнутренниеРезервы
    GROUP BY
        регнакВнутренниеРезервы.FK__Номенклатура__спрНоменклатура_регнакВР
        ,регнакВнутренниеРезервы.FK__ДокументРезерва__регнакВнутренниеРезервы
)
,спрСтатусыЗаказовПокупателя AS (
    SELECT
        спрСтатусыЗаказовПокупателя._IDRRef ID__Ссылка__спрСтатусыЗаказовПокупателя
        ,спрСтатусыЗаказовПокупателя._Description own__Наименование__спрСтатусыЗаказовПокупателя
    FROM 
        _Reference24457 AS спрСтатусыЗаказовПокупателя
)
,спрКонтрагенты AS (
    SELECT
        спрКонтрагенты._IDRRef ID__Ccылка__спрКонтрагенты
        ,спрКонтрагенты._Description own__Наименование__спрКонтрагенты
    FROM 
        _Reference120 AS спрКонтрагенты
)
,спрВалюты AS (
    SELECT
        спрВалюты._IDRRef ID__Ccылка__спрВалюты
        ,спрВалюты._Description own__Наименование__спрВалюты
    FROM 
        _Reference35 AS спрВалюты
)
,спрНоменклатура AS (
    SELECT
        спрНоменклатура._IDRRef ID__Ccылка__спрНоменклатура
        ,спрНоменклатура._Fld2306RRef FK__Вид__спрВидыНоменклатуры_спрН
        ,спрНоменклатура._Fld25116RRef FK__Проект__спрНоменклатура
        ,спрНоменклатура._Code imp__Код__спрНоменклатура
        ,спрНоменклатура._Folder imp__Группа__спрНоменклатура
        ,спрНоменклатура._Description own__Наименование__спрНоменклатура
        ,спрНоменклатура._Fld23716 own__КоличествоВУпаковке__спрНоменклатура
        ,спрНоменклатура._Marked sys__ПомеченоНаУдаление__спрНоменклатура
    FROM _Reference149 AS спрНоменклатура
)
,докМаршрут AS (
    SELECT
        докМаршрут._IDRRef ID__Ссылка__докМаршрут
        ,DATEADD(YEAR, -2000, докМаршрут._Date_Time) imp__Дата__докМаршрут
        ,докМаршрут._Number imp__Номер__докМаршрут
    FROM 
        _Document23052 AS докМаршрут
    WHERE 
        докМаршрут._Posted = 0
        AND
        докМаршрут._Marked = 0
)
,TbptТочки__докМ AS ( -- це я відрізаю дублі заказів в одному маршруті
    SELECT DISTINCT
        TbptТочки__докМ._Document23052_IDRRef ID__Ссылка__TbptТочки_докМ
        ,TbptТочки__докМ._Fld23056_RRRef FK__Заказ__TbptТочки_докМ -- тут докЗаказПокупателя
    FROM
        _Document23052_VT23054 AS TbptТочки__докМ
)
,Join__TbptТочки__докМ AS (
    SELECT
        *
        ,ROW_NUMBER() OVER ( -- це я беру останній маршрут по дублях заказів в зірних маршрутах
            PARTITION BY FK__Заказ__TbptТочки_докМ
            ORDER BY imp__Дата__докМаршрут DESC
        ) rn
    FROM
        TbptТочки__докМ
        LEFT JOIN 
            докМаршрут 
            ON 
                докМаршрут.ID__Ссылка__докМаршрут 
                    = TbptТочки__докМ.ID__Ссылка__TbptТочки_докМ
)
,Agr__MaxЗаказ__Join_TbptТ_докМ AS (
    SELECT
        *
    FROM
        Join__TbptТочки__докМ

    WHERE rn = 1
)
,Join__регнакПродажи__докЗПок AS ( -- 1:1
    SELECT 
        *
    FROM
        Join__TbptТовары__докЗПок
            LEFT JOIN 
                регнакПродажи
                ON регнакПродажи.FK__Заказ__докЗаказПокупателя_регнакП
                    = Join__TbptТовары__докЗПок.ID__Ссылка__докЗаказПокупателя
                    AND
                    регнакПродажи.FK__Номенклатура__спрНоменклатура_регнакП
                    = Join__TbptТовары__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
)
,Props__НеВідвантажено__докЗПок AS (
    SELECT
        *
        ,ISNULL(Join__регнакПродажи__докЗПок.own__СначалаЗаказано__TbptТ_докЗПок,0)
            -
            ISNULL(Join__регнакПродажи__докЗПок.own__Количество__регнакПродажи,0)
                AS props__НеВідвантажено__докЗаказПокупателя
    FROM
        Join__регнакПродажи__докЗПок
)
,Join__Join_TbptПродукция_докЗНП__докЗПок AS (
    SELECT
        *
    FROM
        Props__НеВідвантажено__докЗПок
        LEFT JOIN
            Join__TbptПродукция__докЗНП
            ON 
                Props__НеВідвантажено__докЗПок.ID__Ссылка__докЗаказПокупателя
                    = Join__TbptПродукция__докЗНП.FK__Заказ__TbptПродукция_докЗНП
                AND
                Props__НеВідвантажено__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
                    = Join__TbptПродукция__докЗНП.FK__Номенклатура__спрНоменклатура_TbptП_докЗНП
)
,Join__Agr_СумаПоНоменклатурі_регнакТНС__докЗПок AS (
    SELECT
        *
    FROM
        Join__Join_TbptПродукция_докЗНП__докЗПок
        LEFT JOIN
            Agr__СумаПоНоменклатурі__регнакТНС
            ON 
                Agr__СумаПоНоменклатурі__регнакТНС.FK__спрНоменклатура__ТоварыНаСкладах
                    = Join__Join_TbptПродукция_докЗНП__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
)
,Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок AS (
    SELECT
        *
    FROM
        Join__Agr_СумаПоНоменклатурі_регнакТНС__докЗПок
        LEFT JOIN
            agr__СумаПоНоменклатурі__регнакВнутренниеРезервы
            ON agr__СумаПоНоменклатурі__регнакВнутренниеРезервы.FK__Номенклатура__спрНоменклатура_Agr_СПН_регнакВР
                = Join__Agr_СумаПоНоменклатурі_регнакТНС__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
)
,Join__регнакВнутренниеРезервы__докЗПок AS (
    SELECT
        *
    FROM
        Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок
        LEFT JOIN
            регнакВнутренниеРезервы
            ON 
                регнакВнутренниеРезервы.FK__Номенклатура__спрНоменклатура_регнакВР 
                    = Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
                AND
                регнакВнутренниеРезервы.FK__Регистратор__регнакВнутренниеРезервы
                    = Join__Agr_СумаПоНоменклатурі_регнакВР__докЗПок.ID__Ссылка__докЗаказПокупателя
)
,Join__Agr_СтворенняРеалізація_регнакВР__докЗПок AS (
    SELECT
        *
    FROM
        Join__регнакВнутренниеРезервы__докЗПок
        LEFT JOIN
            Agr__СтворенняРеалізація__регнакВР
            ON 
                Agr__СтворенняРеалізація__регнакВР.FK__Номенклатура__спрНоменклатура__Agr_СР_регнакВР
                    = Join__регнакВнутренниеРезервы__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
                AND
                Agr__СтворенняРеалізація__регнакВР.FK__ДокументРезерва__Agr_СР_регнакВР
                    = Join__регнакВнутренниеРезервы__докЗПок.ID__Ссылка__докЗаказПокупателя
)
,Props__ВільнийЗалишок__докЗПок AS (
    SELECT
        *
        ,ISNULL(Join__Agr_СтворенняРеалізація_регнакВР__докЗПок.SumByEachNomenklatura_ТоварыНаСкладах, 0)
            - ISNULL(Join__Agr_СтворенняРеалізація_регнакВР__докЗПок.agr__СумаПоНоменклатурі__регнакВнутренниеРезервы, 0)
                AS props__ВільнийЗалишок__докЗаказПокупателя
    FROM
        Join__Agr_СтворенняРеалізація_регнакВР__докЗПок
)
,Props__МожливоЗарезервувати_Значення__докЗПок AS (
    SELECT
        *
        ,CASE 
            WHEN Props__ВільнийЗалишок__докЗПок.props__ВільнийЗалишок__докЗаказПокупателя >
                (ISNULL(Props__ВільнийЗалишок__докЗПок.props__НеВідвантажено__докЗаказПокупателя,0) - ISNULL(Props__ВільнийЗалишок__докЗПок.calc__СтворенняРезерву__Agr_СР_регнакВР,0))
                THEN (ISNULL(Props__ВільнийЗалишок__докЗПок.props__НеВідвантажено__докЗаказПокупателя,0) - ISNULL(Props__ВільнийЗалишок__докЗПок.calc__СтворенняРезерву__Agr_СР_регнакВР,0))

            WHEN Props__ВільнийЗалишок__докЗПок.props__ВільнийЗалишок__докЗаказПокупателя <=
                (ISNULL(Props__ВільнийЗалишок__докЗПок.props__НеВідвантажено__докЗаказПокупателя,0) - ISNULL(Props__ВільнийЗалишок__докЗПок.calc__СтворенняРезерву__Agr_СР_регнакВР,0))
                THEN Props__ВільнийЗалишок__докЗПок.props__ВільнийЗалишок__докЗаказПокупателя
        END AS props__МожливоЗарезервувати_Значення__докЗаказПокупателя
    FROM
        Props__ВільнийЗалишок__докЗПок
)
,Props__МожливоЗарезервувати__докЗПок AS (
    SELECT
        *
        ,CASE 
            WHEN Props__МожливоЗарезервувати_Значення__докЗПок.props__МожливоЗарезервувати_Значення__докЗаказПокупателя > 0 
                THEN Props__МожливоЗарезервувати_Значення__докЗПок.props__МожливоЗарезервувати_Значення__докЗаказПокупателя
            ELSE 0
        END AS props__МожливоЗарезервувати__докЗаказПокупателя
    FROM
        Props__МожливоЗарезервувати_Значення__докЗПок
)
,Props__ДоВиготовлення_Значення__докЗПок AS (
    SELECT
        * 
        ,Props__МожливоЗарезервувати__докЗПок.props__НеВідвантажено__докЗаказПокупателя
            - ISNULL(Props__МожливоЗарезервувати__докЗПок.props__ВільнийЗалишок__докЗаказПокупателя, 0)
                - ISNULL(Props__МожливоЗарезервувати__докЗПок.calc__СтворенняРезерву__Agr_СР_регнакВР, 0)
                    AS props__ДоВиготовлення_Значення__докЗаказПокупателя
    FROM
        Props__МожливоЗарезервувати__докЗПок
)
,Props__ДоВиготовлення__докЗПок AS (
    SELECT
        *
        ,CASE 
            WHEN Props__ДоВиготовлення_Значення__докЗПок.props__ДоВиготовлення_Значення__докЗаказПокупателя > 0 
                THEN Props__ДоВиготовлення_Значення__докЗПок.props__ДоВиготовлення_Значення__докЗаказПокупателя
            ELSE 0
        END AS props__ДоВиготовлення__докЗаказПокупателя
    FROM
        Props__ДоВиготовлення_Значення__докЗПок
)
,Join__спрСтатусыЗаказовПокупателя__докЗПок AS (
    SELECT
        *
    FROM
        Props__ДоВиготовлення__докЗПок
        LEFT JOIN 
            спрСтатусыЗаказовПокупателя
            ON 
                Props__ДоВиготовлення__докЗПок.FK__Статус__спрСтатусыЗаказовПокупателя_докЗПок 
                    = спрСтатусыЗаказовПокупателя.ID__Ссылка__спрСтатусыЗаказовПокупателя
)
,Join__спрКонтрагенты__докЗПок AS (
    SELECT
        *
    FROM
        Join__спрСтатусыЗаказовПокупателя__докЗПок
        LEFT JOIN 
            спрКонтрагенты
            ON 
                Join__спрСтатусыЗаказовПокупателя__докЗПок.FK__Контрагент__спрКонтрагенты_докЗПок 
                    = спрКонтрагенты.ID__Ccылка__спрКонтрагенты
)
,Join__спрВалюты__докЗПок AS (
    SELECT
        *
    FROM
        Join__спрКонтрагенты__докЗПок
        LEFT JOIN 
            спрВалюты
            ON 
                Join__спрКонтрагенты__докЗПок.FK__ВалютаДокумента__спрВалюты_докЗПок 
                    = спрВалюты.ID__Ccылка__спрВалюты
)
,Join__Agr_MaxЗаказ_Join_TbptТ_докМ__докЗПок AS (
    SELECT
        *
    FROM
        Join__спрВалюты__докЗПок
        LEFT JOIN
            Agr__MaxЗаказ__Join_TbptТ_докМ
            ON
                Join__спрВалюты__докЗПок.ID__Ссылка__докЗаказПокупателя
                    = Agr__MaxЗаказ__Join_TbptТ_докМ.FK__Заказ__TbptТочки_докМ
)
,Join__спрНоменклатура__докЗПок AS (
    SELECT
        *
    FROM 
        Join__Agr_MaxЗаказ_Join_TbptТ_докМ__докЗПок
        LEFT JOIN
            спрНоменклатура
            ON  
                Join__Agr_MaxЗаказ_Join_TbptТ_докМ__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок
                    = спрНоменклатура.ID__Ccылка__спрНоменклатура
)
,Viz__Pbix_ЗамовленняПокупця_Номенклатура__докЗПок AS (
    SELECT
        Join__спрНоменклатура__докЗПок.FK__Номенклатура__спрНоменклатура_TbptТ_докЗПок                     [FK_Номенклатура]
        ,Join__спрНоменклатура__докЗПок.agr__СумаПоНоменклатурі__регнакВнутренниеРезервы                   [Резерв Номенклатури]
        ,Join__спрНоменклатура__докЗПок.SumByEachNomenklatura_ТоварыНаСкладах                              [Залишок Номенклатури На Складі]
        ,Join__спрНоменклатура__докЗПок.props__ВільнийЗалишок__докЗаказПокупателя                                                     [Вільний Залишок Номенклатури]
        ,Join__спрНоменклатура__докЗПок.imp__Дата__докЗаказНаПроизводство                                  [Дата Заказу На Виробництво]
        ,Join__спрНоменклатура__докЗПок.imp__Дата__докЗаказПокупателя                                      [Дата Заказу Покупця]
        ,Join__спрНоменклатура__докЗПок.own__ДатаОтгрузки__докЗаказПокупателя                              [Планова Дата Відвантаження]
        ,Join__спрНоменклатура__докЗПок.own__Количество__регнакПродажи                                     [Відвантажено]
        ,Join__спрНоменклатура__докЗПок.own__Наименование__спрНоменклатура                                                  [Назва Номенклатури]
        ,Join__спрНоменклатура__докЗПок.own__Наименование__спрВалюты                                             [Валюта]
        ,Join__спрНоменклатура__докЗПок.own__Наименование__спрКонтрагенты                                        [Контрагент]
        ,Join__спрНоменклатура__докЗПок.own__Наименование__спрСтатусыЗаказовПокупателя                           [Статус Заказу Покупця]
        ,Join__спрНоменклатура__докЗПок.props__НеВідвантажено__докЗаказПокупателя                                                     [Не Відвантажено]
        ,Join__спрНоменклатура__докЗПок.imp__Номер__докЗаказПокупателя                                     [Номер Заказу Покупця]
        ,Join__спрНоменклатура__докЗПок.imp__Номер__докЗаказНаПроизводство                                 [Номер Заказу На Виробництво]
        ,Join__спрНоменклатура__докЗПок.own__СначалаЗаказано__TbptТ_докЗПок                                [Сначала Заказано]
        ,Join__спрНоменклатура__докЗПок.own__Цена__TbptТ_докЗПок                                           [Ціна]
        ,Join__спрНоменклатура__докЗПок.calc__СтворенняРезерву__Agr_СР_регнакВР                                                   [Резерв Поточного Заказу]
        ,Join__спрНоменклатура__докЗПок.own__Кількість__TbptПродукция_докЗНП_ВРоботі                       [Кількість в Роботі]
        ,Join__спрНоменклатура__докЗПок.own__Кількість__TbptПродукция_докЗНП_Виконано                      [Кількість Виконано]
        ,Join__спрНоменклатура__докЗПок.imp__Дата__докМаршрут                                                    [Плановий Час Відвантеження]
    FROM
        Join__спрНоменклатура__докЗПок
)
SELECT * FROM Viz__Pbix_ЗамовленняПокупця_Номенклатура__докЗПок
ORDER BY [Дата Заказу Покупця] DESC