;WITH 
докЗаказПокупателя AS (
    SELECT
        докЗаказПокупателя._IDRRef AS ID_докЗаказПокупателя
        ,DATEADD(YEAR, -2000, докЗаказПокупателя._Date_Time) AS Дата_докЗаказПокупателя
        ,докЗаказПокупателя._Number AS Номер_докЗаказПокупателя
        ,докЗаказПокупателя._Fld24458RRef AS FK_спрСтатусыЗаказовПокупателя_докЗаказПокупателя
        ,докЗаказПокупателя._Fld5546RRef AS FK_спрКонтрагенты_докЗаказПокупателя
        ,докЗаказПокупателя._Fld5536RRef AS FK_ВалютаДокумента_докЗаказПокупателя
        ,DATEADD(YEAR, -2000, CAST(докЗаказПокупателя._Fld5540 AS datetime2)) AS ДатаОтгрузки_докЗаказПокупателя
        ,докЗаказПокупателя._Posted AS Проведен_докЗаказПокупателя
        ,докЗаказПокупателя._Marked AS ПометкаУдаления_докЗаказПокупателя
    FROM 
        _Document316 AS докЗаказПокупателя
    WHERE 
        докЗаказПокупателя._Posted = 1 
        AND 
        докЗаказПокупателя._Marked = 0
        AND
        докЗаказПокупателя._Date_Time >= '4025-01-01' -- надто величезні масштаби даних, щоб виводити всі роки (це вже 65к)
)
,докЗаказПокупателя_Товары AS (
    SELECT
        докЗаказПокупателя_Товары._Document316_IDRRef AS FK_докЗаказПокупателя_докЗаказПокупателя_Товары
        ,докЗаказПокупателя_Товары._Fld5576RRef AS FK_спрНоменклатура_докЗаказПокупателя_Товары
        ,докЗаказПокупателя_Товары._Fld22909 AS СначалаЗаказано_докЗаказПокупателя_Товары
        ,докЗаказПокупателя_Товары._Fld5585 AS Цена_докЗаказПокупателя_Товары
    FROM 
        _Document316_VT5569 AS докЗаказПокупателя_Товары
)
,докЗаказПокупателя_Joined AS (
    SELECT
        *
    FROM 
        докЗаказПокупателя
        LEFT JOIN
            докЗаказПокупателя_Товары 
            ON докЗаказПокупателя.ID_докЗаказПокупателя
                = докЗаказПокупателя_Товары.FK_докЗаказПокупателя_докЗаказПокупателя_Товары 
)
,регнакПродажи AS (
    SELECT
        регнакПродажи._RecorderRRef AS FK_Recorder_Продажи
        ,регнакПродажи._Fld22003RRef AS FK_спрНоменклатура_Продажи
        ,регнакПродажи._Fld22005_RRRef AS FK_докЗаказПокупателя_Продажи
        ,регнакПродажи._Period AS Период_Продажи
        ,регнакПродажи._Fld22012 AS Количество_Продажи
    FROM 
        _AccumRg22002 AS регнакПродажи
    WHERE 
        регнакПродажи._Active = 1
)
,докЗаказНаПроизводство AS (
    SELECT
        докЗаказНаПроизводство._IDRRef ID__Ссылка__докЗаказНаПроизводство
        ,DATEADD(YEAR, -2000, докЗаказНаПроизводство._Date_Time) imp__Дата__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Number imp__Номер__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Posted sys__Проведен__докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Marked sys__ПометкаУдаления__докЗаказНаПроизводство
    FROM 
        _Document315 AS докЗаказНаПроизводство
    WHERE
        докЗаказНаПроизводство._Posted = 1
        AND
        докЗаказНаПроизводство._Marked = 0
)
,Tbpt__Продукция__докЗНП AS (
    SELECT
        *
    FROM (
        SELECT
            _Document315_IDRRef AS ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП,
            _Fld5477RRef AS FK_спрНоменклатура_Tbpt__Продукция__докЗНП,
            _Fld5486_RRRef AS FK_Заказ_Tbpt__Продукция__докЗНП,
            _Fld23758RRef AS FK_Статус_Tbpt__Продукция__докЗНП,
            _Fld5481 AS Кількість_Tbpt__Продукция__докЗНП,
            CASE 
                WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 'Виконано'
                WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 'В роботі'
                WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 'Новий'
                ELSE '-'
            END AS Статус_Tbpt__Продукция__докЗНП,
            ROW_NUMBER() OVER(
                PARTITION BY _Fld5486_RRRef, _Fld5477RRef
                ORDER BY 
                    CASE 
                        WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 1  -- Виконано
                        WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 2  -- В роботі
                        WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 3  -- Новий
                        ELSE 4
                    END
            ) AS rn__докЗНП
        FROM _Document315_VT5475
    ) t
    WHERE rn__докЗНП = 1
)
,Join__Tbpt_Продукция__докЗНП AS (
    SELECT
        *
        ,CASE 
            WHEN Статус_Tbpt__Продукция__докЗНП = 'В роботі'
                THEN Кількість_Tbpt__Продукция__докЗНП
            ELSE 0
        END AS Кількість_Tbpt__Продукция__докЗНП_Вроботі
        ,CASE 
            WHEN Статус_Tbpt__Продукция__докЗНП = 'Виконано'
                THEN Кількість_Tbpt__Продукция__докЗНП
            ELSE 0
        END AS Кількість_Tbpt__Продукция__докЗНП_Виконано
    FROM
        докЗаказНаПроизводство
        LEFT JOIN 
            Tbpt__Продукция__докЗНП 
            ON докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство 
                = Tbpt__Продукция__докЗНП.ParentID__докЗаказНаПроизводство__TbptПродукция_докЗНП
    WHERE 
        докЗаказНаПроизводство.ID__Ссылка__докЗаказНаПроизводство <> 0xA66C0050569F1E6A11EF8A2413FC71A6 -- там помилка в базі
)
,регнакТоварыНаСкладах AS (
    SELECT
        регнакТоварыНаСкладах._RecorderRRef AS FK_Регистратор_регнакТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22375RRef AS FK_спрНоменклатура_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22374RRef AS FK_спр_Склады_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._Period AS Период_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._Fld22379 AS Количество_ТоварыНаСкладах
        ,регнакТоварыНаСкладах._RecordKind AS RecordKind_ТоварыНаСкладах -- 0 - приход, 1 - расход
    FROM 
        _AccumRg22373 AS регнакТоварыНаСкладах
    WHERE
        регнакТоварыНаСкладах._Active = 1
)
,Agregat_SumByEachNomenklatura_регнакТоварыНаСкладах AS (
    SELECT
        регнакТоварыНаСкладах.FK_спрНоменклатура_ТоварыНаСкладах
        ,регнакТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах
        ,SUM(
            IIF(
                регнакТоварыНаСкладах.RecordKind_ТоварыНаСкладах = 1,
                -регнакТоварыНаСкладах.Количество_ТоварыНаСкладах,
                регнакТоварыНаСкладах.Количество_ТоварыНаСкладах
            )
        ) AS SumByEachNomenklatura_ТоварыНаСкладах
    FROM
        регнакТоварыНаСкладах
    GROUP BY
        регнакТоварыНаСкладах.FK_спрНоменклатура_ТоварыНаСкладах
        ,регнакТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах
    HAVING регнакТоварыНаСкладах.FK_спр_Склады_ТоварыНаСкладах = 0xB2B0001A64C7AAC211E781AB2E318DA9 -- склад готової продукції (основний)
)
,регнакВнутренниеРезервы AS (
    SELECT
        регнакВнутренниеРезервы._RecorderRRef AS FK_Recorder_регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._RecorderTRef AS TRef_регнакВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24505RRef AS FK_спрНоменклатура_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24506_RRRef AS FK_ДокументРезерва_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24506_RTRef AS TRef_ДокументРезерва_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Period AS Период_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Fld24507 AS Количество_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._RecordKind AS RecordKind_ВнутренниеРезервы -- 0 - приход, 1 - расход
        ,CASE
            WHEN регнакВнутренниеРезервы._RecordKind = 0 
                THEN '+'
            WHEN регнакВнутренниеРезервы._RecordKind = 1
                THEN '-'
        END AS Тип_ВнутренниеРезервы
        ,регнакВнутренниеРезервы._Active AS Активность_ВнутренниеРезервы
    FROM 
        _AccumRg24504 AS регнакВнутренниеРезервы
)
,Agregat_SumByEachNomenklatura_ВнутренниеРезервы AS (
    SELECT
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы AS FK_спрНоменклатура_SumByEachNomenklatura
        ,SUM(
            IIF(
                регнакВнутренниеРезервы.RecordKind_ВнутренниеРезервы = 1,
                -регнакВнутренниеРезервы.Количество_ВнутренниеРезервы,
                регнакВнутренниеРезервы.Количество_ВнутренниеРезервы
            )
        ) AS SumByEachNomenklatura_ВнутренниеРезервы
    FROM
        регнакВнутренниеРезервы
    GROUP BY
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы
)
,Agregat_СтворенняРеалізація_ВнутренниеРезервы AS (
    SELECT
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы AS FK_спрНоменклатура_СтворенняРеалізація
        ,регнакВнутренниеРезервы.FK_ДокументРезерва_ВнутренниеРезервы AS FK_ДокументРезерва_СтворенняРеалізація
        ,SUM(
            CASE 
                WHEN регнакВнутренниеРезервы.Тип_ВнутренниеРезервы = '+'
                    THEN регнакВнутренниеРезервы.Количество_ВнутренниеРезервы
                ELSE 0
            END
        ) AS СтворенняРезерву
        ,SUM(
            CASE 
                WHEN регнакВнутренниеРезервы.Тип_ВнутренниеРезервы = '-'
                    THEN регнакВнутренниеРезервы.Количество_ВнутренниеРезервы
                ELSE 0
            END
        ) AS РеалізаціяРезерву
    FROM
        регнакВнутренниеРезервы
    GROUP BY
        регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы
        ,регнакВнутренниеРезервы.FK_ДокументРезерва_ВнутренниеРезервы
)
,спрСтатусыЗаказовПокупателя AS (
    SELECT
        спрСтатусыЗаказовПокупателя._IDRRef AS ID_спрСтатусыЗаказовПокупателя
        ,спрСтатусыЗаказовПокупателя._Description AS Наименование_спрСтатусыЗаказовПокупателя
    FROM 
        _Reference24457 AS спрСтатусыЗаказовПокупателя
)
,спрКонтрагенты AS (
    SELECT
        спрКонтрагенты._IDRRef AS ID_спрКонтрагенты
        ,спрКонтрагенты._Description AS Наименование_спрКонтрагенты
    FROM 
        _Reference120 AS спрКонтрагенты
)
,спрВалюты AS (
    SELECT
        спрВалюты._IDRRef AS ID_спрВалюты
        ,спрВалюты._Description AS Наименование_спрВалюты
    FROM 
        _Reference35 AS спрВалюты
)
,спрНоменклатура AS (
    SELECT
        спрНоменклатура._IDRRef AS ID_спрНоменклатура
        ,спрНоменклатура._Code AS НоменклатураCode
        ,спрНоменклатура._Description AS НазваНоменклатури
        ,спрНоменклатура._Marked AS ПоміткаВидаленняНоменклатури
        ,спрНоменклатура._Folder AS ГрупаНоменклатури

        ,спрНоменклатура._Fld2306RRef AS FK_ВидНоменклатурьі_Номенклатура
        ,спрНоменклатура._Fld23716 AS КількістьВУпаковці_Номенклатура
        ,спрНоменклатура._Fld25116RRef AS FK_Проект_КаналЗбуту_Номенклатура
    FROM _Reference149 AS спрНоменклатура
)
,докМаршрут AS (
    SELECT
        докМаршрут._IDRRef ID_докМаршрут
        ,DATEADD(YEAR, -2000, докМаршрут._Date_Time) Дата_докМаршрут
        ,докМаршрут._Number Номер_докМаршрут
    FROM 
        _Document23052 AS докМаршрут
    WHERE 
        докМаршрут._Posted = 0
        AND
        докМаршрут._Marked = 0
)
,докМаршрут_Точки AS ( -- це я відрізаю дублі заказів в одному маршруті
    SELECT DISTINCT
        докМаршрут_Точки._Document23052_IDRRef ID_докМаршрут_докМаршрут_Точки
        ,докМаршрут_Точки._Fld23056_RRRef FK_Заказ_докМаршрут_Точки -- тут докЗаказПокупателя
    FROM
        _Document23052_VT23054 AS докМаршрут_Точки
)
,докМаршрут_Точки_Joined AS (
    SELECT
        *
        ,ROW_NUMBER() OVER ( -- це я беру останній маршрут по дублях заказів в зірних маршрутах
            PARTITION BY FK_Заказ_докМаршрут_Точки
            ORDER BY Дата_докМаршрут DESC
        ) rn
    FROM
        докМаршрут_Точки
        LEFT JOIN 
            докМаршрут 
            ON 
                докМаршрут.ID_докМаршрут 
                    = докМаршрут_Точки.ID_докМаршрут_докМаршрут_Точки
)
,Agregat_MaxЗаказ_докМаршрут_Точки_Joined AS (
    SELECT
        *
    FROM
        докМаршрут_Точки_Joined

    WHERE rn = 1
)
,регнакПродажи_Joined AS ( -- 1:1
    SELECT 
        *
    FROM
        докЗаказПокупателя_Joined
            LEFT JOIN 
                регнакПродажи
                ON регнакПродажи.FK_докЗаказПокупателя_Продажи
                    = докЗаказПокупателя_Joined.ID_докЗаказПокупателя
                    AND
                    регнакПродажи.FK_спрНоменклатура_Продажи
                    = докЗаказПокупателя_Joined.FK_спрНоменклатура_докЗаказПокупателя_Товары
)
,НеВідвантажено_J AS (
    SELECT
        *
        ,ISNULL(регнакПродажи_Joined.СначалаЗаказано_докЗаказПокупателя_Товары,0)
            -
            ISNULL(регнакПродажи_Joined.Количество_Продажи,0)
                AS НеВідвантажено
    FROM
        регнакПродажи_Joined
)
,Join_Join__Tbpt_Продукция__докЗНП AS (
    SELECT
        *
    FROM
        НеВідвантажено_J
        LEFT JOIN
            Join__Tbpt_Продукция__докЗНП
            ON 
                НеВідвантажено_J.ID_докЗаказПокупателя
                    = Join__Tbpt_Продукция__докЗНП.FK_Заказ_Tbpt__Продукция__докЗНП
                AND
                НеВідвантажено_J.FK_спрНоменклатура_докЗаказПокупателя_Товары
                    = Join__Tbpt_Продукция__докЗНП.FK_спрНоменклатура_Tbpt__Продукция__докЗНП
)
,Join_Agregat_SumByEachNomenklatura_ТоварыНаСкладах AS (
    SELECT
        *
    FROM
        Join_Join__Tbpt_Продукция__докЗНП
        LEFT JOIN
            Agregat_SumByEachNomenklatura_регнакТоварыНаСкладах
            ON 
                Agregat_SumByEachNomenklatura_регнакТоварыНаСкладах.FK_спрНоменклатура_ТоварыНаСкладах
                    = Join_Join__Tbpt_Продукция__докЗНП.FK_спрНоменклатура_докЗаказПокупателя_Товары
)
,Join_Agregat_SumByEachNomenklatura_ВнутренниеРезервы AS (
    SELECT
        *
    FROM
        Join_Agregat_SumByEachNomenklatura_ТоварыНаСкладах
        LEFT JOIN
            Agregat_SumByEachNomenklatura_ВнутренниеРезервы
            ON Agregat_SumByEachNomenklatura_ВнутренниеРезервы.FK_спрНоменклатура_SumByEachNomenklatura
                = Join_Agregat_SumByEachNomenklatura_ТоварыНаСкладах.FK_спрНоменклатура_докЗаказПокупателя_Товары
)
,Join_регнакВнутренниеРезервы AS (
    SELECT
        *
    FROM
        Join_Agregat_SumByEachNomenklatura_ВнутренниеРезервы
        LEFT JOIN
            регнакВнутренниеРезервы
            ON 
                регнакВнутренниеРезервы.FK_спрНоменклатура_ВнутренниеРезервы 
                    = Join_Agregat_SumByEachNomenklatura_ВнутренниеРезервы.FK_спрНоменклатура_докЗаказПокупателя_Товары
                AND
                регнакВнутренниеРезервы.FK_Recorder_регнакВнутренниеРезервы
                    = Join_Agregat_SumByEachNomenklatura_ВнутренниеРезервы.ID_докЗаказПокупателя
)
,Join_Agregat_СтворенняРеалізація_ВнутренниеРезервы AS (
    SELECT
        *
    FROM
        Join_регнакВнутренниеРезервы
        LEFT JOIN
            Agregat_СтворенняРеалізація_ВнутренниеРезервы
            ON 
                Agregat_СтворенняРеалізація_ВнутренниеРезервы.FK_спрНоменклатура_СтворенняРеалізація
                    = Join_регнакВнутренниеРезервы.FK_спрНоменклатура_докЗаказПокупателя_Товары
                AND
                Agregat_СтворенняРеалізація_ВнутренниеРезервы.FK_ДокументРезерва_СтворенняРеалізація
                    = Join_регнакВнутренниеРезервы.ID_докЗаказПокупателя
)
,ВільнийЗалишок_J AS (
    SELECT
        *
        ,ISNULL(Join_Agregat_СтворенняРеалізація_ВнутренниеРезервы.SumByEachNomenklatura_ТоварыНаСкладах, 0)
            - ISNULL(Join_Agregat_СтворенняРеалізація_ВнутренниеРезервы.SumByEachNomenklatura_ВнутренниеРезервы, 0)
                AS ВільнийЗалишок
    FROM
        Join_Agregat_СтворенняРеалізація_ВнутренниеРезервы
)
,Props_МожливоЗарезервувати AS (
    SELECT
        *
        ,CASE 
            WHEN ВільнийЗалишок_J.ВільнийЗалишок >
                (ISNULL(ВільнийЗалишок_J.НеВідвантажено,0) - ISNULL(ВільнийЗалишок_J.СтворенняРезерву,0))
                THEN (ISNULL(ВільнийЗалишок_J.НеВідвантажено,0) - ISNULL(ВільнийЗалишок_J.СтворенняРезерву,0))

            WHEN ВільнийЗалишок_J.ВільнийЗалишок <=
                (ISNULL(ВільнийЗалишок_J.НеВідвантажено,0) - ISNULL(ВільнийЗалишок_J.СтворенняРезерву,0))
                THEN ВільнийЗалишок_J.ВільнийЗалишок
        END AS МожливоЗарезервувати_Значення
    FROM
        ВільнийЗалишок_J
)
,Props_МожливоЗарезервувати_Next AS (
    SELECT
        *
        ,CASE 
            WHEN Props_МожливоЗарезервувати.МожливоЗарезервувати_Значення > 0 
                THEN Props_МожливоЗарезервувати.МожливоЗарезервувати_Значення
            ELSE 0
        END AS МожливоЗарезервувати
    FROM
        Props_МожливоЗарезервувати
)
,ДоВиготовлення_J AS (
    SELECT
        * 
        ,Props_МожливоЗарезервувати_Next.НеВідвантажено
            - ISNULL(Props_МожливоЗарезервувати_Next.ВільнийЗалишок, 0)
                - ISNULL(Props_МожливоЗарезервувати_Next.СтворенняРезерву, 0)
                    AS ДоВиготовлення_Значення
    FROM
        Props_МожливоЗарезервувати_Next
)
,Next_J AS (
    SELECT
        *
        ,CASE 
            WHEN ДоВиготовлення_J.ДоВиготовлення_Значення > 0 
                THEN ДоВиготовлення_J.ДоВиготовлення_Значення
            ELSE 0
        END AS ДоВиготовлення
    FROM
        ДоВиготовлення_J
)
,спрСтатусыЗаказовПокупателя_J AS (
    SELECT
        *
    FROM
        Next_J
        LEFT JOIN 
            спрСтатусыЗаказовПокупателя
            ON 
                Next_J.FK_спрСтатусыЗаказовПокупателя_докЗаказПокупателя 
                    = спрСтатусыЗаказовПокупателя.ID_спрСтатусыЗаказовПокупателя
)
,спрКонтрагенты_J AS (
    SELECT
        *
    FROM
        спрСтатусыЗаказовПокупателя_J
        LEFT JOIN 
            спрКонтрагенты
            ON 
                спрСтатусыЗаказовПокупателя_J.FK_спрКонтрагенты_докЗаказПокупателя 
                    = спрКонтрагенты.ID_спрКонтрагенты
)
,спрВалюты_J AS (
    SELECT
        *
    FROM
        спрКонтрагенты_J
        LEFT JOIN 
            спрВалюты
            ON 
                спрКонтрагенты_J.FK_ВалютаДокумента_докЗаказПокупателя 
                    = спрВалюты.ID_спрВалюты
)
,Join_Agregat_MaxЗаказ_докМаршрут_Точки_Joined AS (
    SELECT
        *
    FROM
        спрВалюты_J
        LEFT JOIN
            Agregat_MaxЗаказ_докМаршрут_Точки_Joined
            ON
                спрВалюты_J.ID_докЗаказПокупателя
                    = Agregat_MaxЗаказ_докМаршрут_Точки_Joined.FK_Заказ_докМаршрут_Точки
)
,Join_спрНоменклатура AS (
    SELECT
        *
    FROM 
        Join_Agregat_MaxЗаказ_докМаршрут_Точки_Joined
        LEFT JOIN
            спрНоменклатура
            ON  
                Join_Agregat_MaxЗаказ_докМаршрут_Точки_Joined.FK_спрНоменклатура_докЗаказПокупателя_Товары
                    = спрНоменклатура.ID_спрНоменклатура
)
,Pbix__ЗаказПокупателя_Номенклатура_v2__докЗаказПокупалеля AS (
    SELECT
        Join_спрНоменклатура.FK_спрНоменклатура_докЗаказПокупателя_Товары               [FK_Номенклатура]
        ,Join_спрНоменклатура.SumByEachNomenklatura_ВнутренниеРезервы                   [Резерв Номенклатури]
        ,Join_спрНоменклатура.SumByEachNomenklatura_ТоварыНаСкладах                     [Залишок Номенклатури На Складі]
        ,Join_спрНоменклатура.ВільнийЗалишок                                            [Вільний Залишок Номенклатури]
        ,Join_спрНоменклатура.imp__Дата__докЗаказНаПроизводство                         [Дата Заказу На Виробництво]
        ,Join_спрНоменклатура.Дата_докЗаказПокупателя                                   [Дата Заказу Покупця]
        ,Join_спрНоменклатура.ДатаОтгрузки_докЗаказПокупателя                           [Планова Дата Відвантаження]
        ,Join_спрНоменклатура.Количество_Продажи                                        [Відвантажено]
        ,Join_спрНоменклатура.НазваНоменклатури                                         [Назва Номенклатури]
        ,Join_спрНоменклатура.Наименование_спрВалюты                                    [Валюта]
        ,Join_спрНоменклатура.Наименование_спрКонтрагенты                               [Контрагент]
        ,Join_спрНоменклатура.Наименование_спрСтатусыЗаказовПокупателя                  [Статус Заказу Покупця]
        ,Join_спрНоменклатура.НеВідвантажено                                            [Не Відвантажено]
        ,Join_спрНоменклатура.Номер_докЗаказПокупателя                                  [Номер Заказу Покупця]
        ,Join_спрНоменклатура.imp__Номер__докЗаказНаПроизводство                        [Номер Заказу На Виробництво]
        ,Join_спрНоменклатура.СначалаЗаказано_докЗаказПокупателя_Товары                 [Сначала Заказано]
        ,Join_спрНоменклатура.Цена_докЗаказПокупателя_Товары                            [Ціна]
        ,Join_спрНоменклатура.СтворенняРезерву                                          [Резерв Поточного Заказу]
        ,Join_спрНоменклатура.Кількість_Tbpt__Продукция__докЗНП_Вроботі                 [Кількість в Роботі]
        ,Join_спрНоменклатура.Кількість_Tbpt__Продукция__докЗНП_Виконано                [Кількість Виконано]
        ,Join_спрНоменклатура.Дата_докМаршрут                                           [Плановий Час Відвантеження]
    FROM
        Join_спрНоменклатура
)
SELECT * FROM Pbix__ЗаказПокупателя_Номенклатура_v2__докЗаказПокупалеля
ORDER BY [Дата Заказу Покупця] DESC