;WITH 


-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------

--- type_name_dependency
докЗаказНаПроизводство AS ( -- .../.../докЗаказНаПроизводство.sql
    SELECT
        докЗаказНаПроизводство._IDRRef PK_Ссылка_докЗаказНаПроизводство
        ,DATEADD(YEAR, -2000, докЗаказНаПроизводство._Date_Time) imp_Дата_докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Number imp_Номер_докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Posted sys_Проведен_докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Marked sys_ПометкаУдаления_докЗаказНаПроизводство
    FROM 
        _Document315 AS докЗаказНаПроизводство

    WHERE
        докЗаказНаПроизводство._Posted = 1
        AND
        докЗаказНаПроизводство._Marked = 0
)

---- TABLEPARTS ---------------------------------------------------------------------------

---
,Base_Tablepart_Продукция_докЗаказНаПроизводство AS (
    SELECT
        _Document315_IDRRef AS FK_докЗаказНаПроизводство_Tablepart_Продукция_докЗаказНаПроизводство,
        _Fld5477RRef AS FK_спрНоменклатура_Tablepart_Продукция_докЗаказНаПроизводство,
        _Fld5486_RRRef AS FK_Заказ_Tablepart_Продукция_докЗаказНаПроизводство,
        _Fld23758RRef AS FK_Статус_Tablepart_Продукция_докЗаказНаПроизводство,
        _Fld5481 AS Кількість_Tablepart_Продукция_докЗаказНаПроизводство,

        CASE 
            WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 'Виконано'
            WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 'В роботі'
            WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 'Новий'
            ELSE '-'
        END AS Статус_Tablepart_Продукция_докЗаказНаПроизводство,

        ROW_NUMBER() OVER(
            PARTITION BY 
                _Fld5486_RRRef, _Fld5477RRef
            ORDER BY 
                CASE 
                    WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 1
                    WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 2
                    WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 3
                    ELSE 4
                END
        ) AS rn
    FROM _Document315_VT5475
)

,Tablepart_Продукция_докЗаказНаПроизводство AS (
    SELECT
        *
    FROM Base_Tablepart_Продукция_докЗаказНаПроизводство
    WHERE rn = 1
)
------------------------------------------ TABLEPARTSJOIN ---------------------------------------------
---
,докЗаказНаПроизводство_Joined AS (
    SELECT
        *
    FROM
        докЗаказНаПроизводство
        LEFT JOIN 
            Tablepart_Продукция_докЗаказНаПроизводство 
            ON докЗаказНаПроизводство.PK_Ссылка_докЗаказНаПроизводство 
                = Tablepart_Продукция_докЗаказНаПроизводство.FK_докЗаказНаПроизводство_Tablepart_Продукция_докЗаказНаПроизводство
    
    WHERE 
        Статус_Tablepart_Продукция_докЗаказНаПроизводство = 'В роботі'
    -- WHERE Статус_Tablepart_Продукция_докЗаказНаПроизводство = 'Виконано'
        AND
        докЗаказНаПроизводство.PK_Ссылка_докЗаказНаПроизводство <> 0xA66C0050569F1E6A11EF8A2413FC71A6 -- там помилка в базі

)

-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------
---

-------------------------------------------------------------------------------------------------------
----------------------------------------------- OPS ---------------------------------------------------
---




SELECT * FROM докЗаказНаПроизводство_Joined
ORDER BY imp_Дата_докЗаказНаПроизводство DESC