;WITH 


-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------

--- type_name_dependency
докЗаказНаПроизводство AS ( -- .../.../докЗаказНаПроизводство.sql
    SELECT
        -- PK
        докЗаказНаПроизводство._IDRRef AS ID_докЗаказНаПроизводство
        -- FK
        -- imp
        ,DATEADD(YEAR, -2000, докЗаказНаПроизводство._Date_Time) AS Дата_докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Number AS Номер_докЗаказНаПроизводство
        -- other
        -- system
        ,докЗаказНаПроизводство._Posted AS Проведен_докЗаказНаПроизводство
        ,докЗаказНаПроизводство._Marked AS ПометкаУдаления_докЗаказНаПроизводство
    FROM 
        _Document315 AS докЗаказНаПроизводство

    WHERE
        докЗаказНаПроизводство._Posted = 1
        AND
        докЗаказНаПроизводство._Marked = 0
)
,докЗаказНаПроизводство_Продукция AS (
    SELECT
        FK_докЗаказНаПроизводство_докЗаказНаПроизводство_Продукция,
        FK_спрНоменклатура_докЗаказНаПроизводство_Продукция,
        FK_Заказ_докЗаказНаПроизводство_Продукция,
        FK_Статус_докЗаказНаПроизводство_Продукция,
        Статус_докЗаказНаПроизводство_Продукция,
        Кількість_докЗаказНаПроизводство_Продукция
    FROM (
        SELECT
            _Document315_IDRRef AS FK_докЗаказНаПроизводство_докЗаказНаПроизводство_Продукция,
            _Fld5477RRef AS FK_спрНоменклатура_докЗаказНаПроизводство_Продукция,
            _Fld5486_RRRef AS FK_Заказ_докЗаказНаПроизводство_Продукция,
            _Fld23758RRef AS FK_Статус_докЗаказНаПроизводство_Продукция,
            _Fld5481 AS Кількість_докЗаказНаПроизводство_Продукция,
            CASE 
                WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 'Виконано'
                WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 'В роботі'
                WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 'Новий'
                ELSE '-'
            END AS Статус_докЗаказНаПроизводство_Продукция,
            ROW_NUMBER() OVER(
                PARTITION BY _Fld5486_RRRef, _Fld5477RRef
                ORDER BY 
                    CASE 
                        WHEN _Fld23758RRef = 0xA5ACB7012F23EC4A4A54E97C817047F3 THEN 1  -- Виконано
                        WHEN _Fld23758RRef = 0xB68AA80C992C994C434CD6290CC49AF3 THEN 2  -- В роботі
                        WHEN _Fld23758RRef = 0xB10F03D9E1E097A142E1C0456E0E25EB THEN 3  -- Новий
                        ELSE 4
                    END
            ) AS rn
        FROM _Document315_VT5475
    ) t
    WHERE rn = 1
)
,докЗаказНаПроизводство_Joined AS (
    SELECT
        *
        ,CASE 
            WHEN Статус_докЗаказНаПроизводство_Продукция = 'В роботі'
                THEN Кількість_докЗаказНаПроизводство_Продукция
            ELSE 0
        END AS Кількість_докЗаказНаПроизводство_Продукция_Вроботі
        ,CASE 
            WHEN Статус_докЗаказНаПроизводство_Продукция = 'Виконано'
                THEN Кількість_докЗаказНаПроизводство_Продукция
            ELSE 0
        END AS Кількість_докЗаказНаПроизводство_Продукция_Виконано
    FROM
        докЗаказНаПроизводство
        LEFT JOIN 
            докЗаказНаПроизводство_Продукция 
            ON докЗаказНаПроизводство.ID_докЗаказНаПроизводство 
                = докЗаказНаПроизводство_Продукция.FK_докЗаказНаПроизводство_докЗаказНаПроизводство_Продукция
    
    WHERE 
    --     Статус_докЗаказНаПроизводство_Продукция = 'В роботі'
    -- -- WHERE Статус_докЗаказНаПроизводство_Продукция = 'Виконано'
    --     AND
        докЗаказНаПроизводство.ID_докЗаказНаПроизводство <> 0xA66C0050569F1E6A11EF8A2413FC71A6 -- там помилка в базі

)

-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------
---

-------------------------------------------------------------------------------------------------------
----------------------------------------------- OPS ---------------------------------------------------
---




SELECT * FROM докЗаказНаПроизводство_Joined