;WITH 



-------------------------------------------------------------------------------------------
---- BASE ---------------------------------------------------------------------------------





--- type__name__dependency_dpnd
докТарифыОплатыТрудаПроизводства AS ( -- .../.../докТарифыОплатыТрудаПроизводства.sql
    SELECT
        докТарифыОплатыТрудаПроизводства._IDRRef ID__Ссылка__докТарифыОплатыТрудаПроизводства
        ,докТарифыОплатыТрудаПроизводства._Fld23694RRef FK__Подразделение__спрПодразделение_докТОТП
        ,докТарифыОплатыТрудаПроизводства._Fld23697 imp__ДатаИзменений__докТарифыОплатыТрудаПроизводства
        -- own
        -- oth (other)
        -- sys (system)
        -- calc (calculated)
    FROM 
        _Document23691 AS докТарифыОплатыТрудаПроизводства

    WHERE
        докТарифыОплатыТрудаПроизводства._Posted = 1 -- проведений
        AND
        докТарифыОплатыТрудаПроизводства._Marked = 0 -- не помічений на видалення
    --     AND
    --     докТарифыОплатыТрудаПроизводства._Active = 1 -- активний
)





---- BASE ---------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
---- TABLEPARTS ---------------------------------------------------------------------------





,TbptТарифы__докТОТП AS (
    SELECT
        Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Document23691_IDRRef 
            ParentID__докТарифыОплатыТрудаПроизводства__TbptДолжности_докТОТП
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23703RRef
            FK__Должность__спрДолжностиОрганизаций_TbptТ_докТОТП -- треба перевірити, бо я хз, чи це фк на спр
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23704RRef
            FK__НормаОплаты__спрНормыОплатыТруда_TbptТ_докТОТП
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23705
            own__Сумма__TbptТарифы_докТОТП
    FROM
        _Document23691_VT23701 AS Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства
)

---- TABLEPARTSJOIN -----------------------------------------------------------------------

,Join__TbptТарифы__докТОТП AS (
    SELECT
        *
    FROM
        докТарифыОплатыТрудаПроизводства
        LEFT JOIN
            TbptТарифы__докТОТП
            ON
                докТарифыОплатыТрудаПроизводства.ID__Ссылка__докТарифыОплатыТрудаПроизводства
                    = TbptТарифы__докТОТП.ParentID__докТарифыОплатыТрудаПроизводства__TbptДолжности_докТОТП
)



---- TABLEPARTS ---------------------------------------------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------
----------------------------------------- VIEWS -------------------------------------------





,спрДолжностиОрганизаций AS ( -- .../.../спрДолжностиОрганизаций.sql
    SELECT
        спрДолжностиОрганизаций._IDRRef ID__Ссылка__спрДолжностиОрганизаций
        -- FK
        -- imp (important)
        ,спрДолжностиОрганизаций._Description imp__Наименование__спрДолжностиОрганизаций
        -- own
        -- oth (other)
        -- sys (system)
        -- calc (calculated)
    FROM 
        _Reference87 AS спрДолжностиОрганизаций

    WHERE
    --     спрДолжностиОрганизаций._Posted = 1 -- проведений
    --     AND
        спрДолжностиОрганизаций._Marked = 0 -- не помічений на видалення
    --     AND
    --     спрДолжностиОрганизаций._Active = 1 -- активний
)

,спр_ВидыПодразделений AS ( -- ../spr/спр_ВидыПодразделений.sql
    SELECT
        -- join on (PK)
        спр_ВидыПодразделений._IDRRef AS ID_ВидыПодразделений
        -- imp
        -- ,спр_ВидыПодразделений._Code AS Code_ВидыПодразделений
        ,спр_ВидыПодразделений._Description AS Назва_ВидыПодразделений
        -- other
        -- system
        -- ,спр_ВидыПодразделений._Marked AS ПоміткаВидалення_ВидыПодразделений
    FROM 
        _Reference170 AS спр_ВидыПодразделений

    WHERE 
        спр_ВидыПодразделений._Marked = 0 -- не помічений на видалення
    AND
        спр_ВидыПодразделений._Description <> 'Цех №1' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2' -- вже нема
    AND 
        спр_ВидыПодразделений._Description <> 'Цех №2 (Лінія1)' -- вже нема
)

,спрНормыОплатыТруда AS ( -- .../.../спрНормыОплатыТруда.sql
    SELECT
        спрНормыОплатыТруда._IDRRef ID__Ссылка__спрНормыОплатыТруда
        -- FK
        -- imp (important)
        ,спрНормыОплатыТруда._Description imp__Наименование__спрНормыОплатыТруда
        -- own
        -- oth (other)
        -- sys (system)
        -- calc (calculated)
    FROM 
        _Reference23690 AS спрНормыОплатыТруда

    WHERE
    --     спрНормыОплатыТруда._Posted = 1 -- проведений
    --     AND
        спрНормыОплатыТруда._Marked = 0 -- не помічений на видалення
    --     AND
    --     спрНормыОплатыТруда._Active = 1 -- активний
)





----------------------------------------- VIEWS -------------------------------------------
-------------------------------------------------------------------------------------------
-------------------------------------------------------------------------------------------




--
-------------------------------------------------------------------------------------------
----------------------------------- BaseView Joins 1:1 ------------------------------------
-- ,Join__
----------------------------------- BaseView Joins 1:1 ------------------------------------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
------------------------------------------------------------------------- Тарифи ----------





,Join__спрДолжности__докТОТП AS ( -- 1:1
    SELECT
        *
    FROM
        Join__TbptТарифы__докТОТП
        LEFT JOIN
            спрДолжностиОрганизаций
            ON
                Join__TbptТарифы__докТОТП.FK__Должность__спрДолжностиОрганизаций_TbptТ_докТОТП
                    = спрДолжностиОрганизаций.ID__Ссылка__спрДолжностиОрганизаций
)

,Join__спрПодразделения__докТОТП AS ( -- 1:1
    SELECT
        *
    FROM
        Join__спрДолжности__докТОТП
        LEFT JOIN
            спр_ВидыПодразделений
            ON
                Join__спрДолжности__докТОТП.FK__Подразделение__спрПодразделение_докТОТП
                    = спр_ВидыПодразделений.ID_ВидыПодразделений
)

,Join__спрНормыОплатыТруда__докТОТП AS (
    SELECT
        *
    FROM
        Join__спрПодразделения__докТОТП
        LEFT JOIN
            спрНормыОплатыТруда
            ON
                Join__спрПодразделения__докТОТП.FK__НормаОплаты__спрНормыОплатыТруда_TbptТ_докТОТП
                    = спрНормыОплатыТруда.ID__Ссылка__спрНормыОплатыТруда
)





-- ,Props__
---------------------------------------------------------- ProjectJoin --------------------
-- ,Join__
------------------------------------------------------------------------- Тарифи ----------
-------------------------------------------------------------------------------------------




-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Projects Vizes ----------





,Main__pbixТарифиОплатПрацівникам__докТОТП AS (
    SELECT
        *
    FROM
        Join__спрНормыОплатыТруда__докТОТП
)
,Viz__pbixТарифиОплатПрацівникам__докТОТП AS (
    SELECT
        Main__pbixТарифиОплатПрацівникам__докТОТП.Назва_ВидыПодразделений
            [Лінія]
        ,Main__pbixТарифиОплатПрацівникам__докТОТП.imp__Наименование__спрДолжностиОрганизаций
            [Посада]
        ,Main__pbixТарифиОплатПрацівникам__докТОТП.imp__Наименование__спрНормыОплатыТруда
            [Норма Оплати]
        ,Main__pbixТарифиОплатПрацівникам__докТОТП.own__Сумма__TbptТарифы_докТОТП
            [Сума]
    FROM
        Main__pbixТарифиОплатПрацівникам__докТОТП
)





----------------------------------------------------------------- Projects Vizes ----------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
----------------------------------------------------------------- Working Vizes -----------





,working__Main AS (
    SELECT
        *
    FROM
        Join__спрНормыОплатыТруда__докТОТП
)

,working AS (
    SELECT
        working__Main.imp__Наименование__спрДолжностиОрганизаций
        ,working__Main.imp__Наименование__спрНормыОплатыТруда
        ,working__Main.own__Сумма__TbptТарифы_докТОТП
    FROM
        working__Main
)





----------------------------------------------------------------- Working Vizes -----------
-------------------------------------------------------------------------------------------





-------------------------------------------------------------------------------------------
----------------------------------------------------------------- SELECTS -----------------
SELECT * FROM Viz__pbixТарифиОплатПрацівникам__докТОТП
-- ORDER BY imp__Наименование__спрДолжностиОрганизаций

----------------------------------------------------------------- SELECTS -----------------
-------------------------------------------------------------------------------------------