;WITH 
докТарифыОплатыТрудаПроизводства AS (
    SELECT
        докТарифыОплатыТрудаПроизводства._IDRRef ID__Ссылка__докТарифыОплатыТрудаПроизводства
        ,докТарифыОплатыТрудаПроизводства._Fld23694RRef FK__Подразделение__спрПодразделение_докТОТП
        ,докТарифыОплатыТрудаПроизводства._Fld23697 imp__ДатаИзменений__докТарифыОплатыТрудаПроизводства
    FROM 
        _Document23691 AS докТарифыОплатыТрудаПроизводства
    WHERE
        докТарифыОплатыТрудаПроизводства._Posted = 1
        AND
        докТарифыОплатыТрудаПроизводства._Marked = 0
)
,TbptТарифы__докТОТП AS (
    SELECT
        Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Document23691_IDRRef 
            ParentID__докТарифыОплатыТрудаПроизводства__TbptДолжности_докТОТП
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23703RRef
            FK__Должность__спрДолжностиОрганизаций_TbptТ_докТОТП
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23704RRef
            FK__НормаОплаты__спрНормыОплатыТруда_TbptТ_докТОТП
        ,Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства._Fld23705
            own__Сумма__TbptТарифы_докТОТП
    FROM
        _Document23691_VT23701 AS Tbpt__Тарифы__докТарифыОплатыТрудаПроизводства
)
,Join__TbptТарифы__докТОТП AS (
    SELECT
        *
    FROM
        докТарифыОплатыТрудаПроизводства
        LEFT JOIN
            TbptТарифы__докТОТП
            ON
                докТарифыОплатыТрудаПроизводства.ID__Ссылка__докТарифыОплатыТрудаПроизводства
                    = TbptТарифы__докТОТП.ParentID__докТарифыОплатыТрудаПроизводства__TbptДолжности_докТОТП
)
,спрДолжностиОрганизаций AS (
    SELECT
        спрДолжностиОрганизаций._IDRRef ID__Ссылка__спрДолжностиОрганизаций
        ,спрДолжностиОрганизаций._Description imp__Наименование__спрДолжностиОрганизаций
    FROM 
        _Reference87 AS спрДолжностиОрганизаций
    WHERE
        спрДолжностиОрганизаций._Marked = 0
)
,спрВидыПодразделений AS (
    SELECT
        спрВидыПодразделений._IDRRef AS ID_ВидыПодразделений
        ,спрВидыПодразделений._Description AS Назва_ВидыПодразделений
    FROM 
        _Reference170 AS спрВидыПодразделений
    WHERE 
        спрВидыПодразделений._Marked = 0
    AND
        спрВидыПодразделений._Description <> 'Цех №1' -- вже нема
    AND 
        спрВидыПодразделений._Description <> 'Цех №2' -- вже нема
    AND 
        спрВидыПодразделений._Description <> 'Цех №2 (Лінія1)' -- вже нема
)
,спрНормыОплатыТруда AS (
    SELECT
        спрНормыОплатыТруда._IDRRef ID__Ссылка__спрНормыОплатыТруда
        ,спрНормыОплатыТруда._Description imp__Наименование__спрНормыОплатыТруда
    FROM 
        _Reference23690 AS спрНормыОплатыТруда
    WHERE
        спрНормыОплатыТруда._Marked = 0
)
,Join__спрДолжности__докТОТП AS ( -- 1:1
    SELECT
        *
    FROM
        Join__TbptТарифы__докТОТП
        LEFT JOIN
            спрДолжностиОрганизаций
            ON
                Join__TbptТарифы__докТОТП.FK__Должность__спрДолжностиОрганизаций_TbptТ_докТОТП
                    = спрДолжностиОрганизаций.ID__Ссылка__спрДолжностиОрганизаций
)
,Join__спрПодразделения__докТОТП AS ( -- 1:1
    SELECT
        *
    FROM
        Join__спрДолжности__докТОТП
        LEFT JOIN
            спрВидыПодразделений
            ON
                Join__спрДолжности__докТОТП.FK__Подразделение__спрПодразделение_докТОТП
                    = спрВидыПодразделений.ID_ВидыПодразделений
)
,Join__спрНормыОплатыТруда__докТОТП AS (
    SELECT
        *
    FROM
        Join__спрПодразделения__докТОТП
        LEFT JOIN
            спрНормыОплатыТруда
            ON
                Join__спрПодразделения__докТОТП.FK__НормаОплаты__спрНормыОплатыТруда_TbptТ_докТОТП
                    = спрНормыОплатыТруда.ID__Ссылка__спрНормыОплатыТруда
)
,Viz__Main_pbixТарифиОплатПрацівникам__докТОТП AS (
    SELECT
        *
    FROM
        Join__спрНормыОплатыТруда__докТОТП
)
,Viz__pbixТарифиОплатПрацівникам__докТОТП AS (
    SELECT
        Viz__Main_pbixТарифиОплатПрацівникам__докТОТП.Назва_ВидыПодразделений
            [Лінія]
        ,Viz__Main_pbixТарифиОплатПрацівникам__докТОТП.imp__Наименование__спрДолжностиОрганизаций
            [Посада]
        ,Viz__Main_pbixТарифиОплатПрацівникам__докТОТП.imp__Наименование__спрНормыОплатыТруда
            [Норма Оплати]
        ,Viz__Main_pbixТарифиОплатПрацівникам__докТОТП.own__Сумма__TbptТарифы_докТОТП
            [Сума]
    FROM
        Viz__Main_pbixТарифиОплатПрацівникам__докТОТП
)
,working__Main AS (
    SELECT
        *
    FROM
        Join__спрНормыОплатыТруда__докТОТП
)
,working AS (
    SELECT
        working__Main.imp__Наименование__спрДолжностиОрганизаций
        ,working__Main.imp__Наименование__спрНормыОплатыТруда
        ,working__Main.own__Сумма__TbptТарифы_докТОТП
    FROM
        working__Main
)
SELECT * FROM Viz__pbixТарифиОплатПрацівникам__докТОТП