;WITH 

-------------------------------------------------------------------------------------------------------
---------------------------------------------- BASE ---------------------------------------------------
---
докМаршрут AS ( -- .../.../докМаршрут.sql
    SELECT
        докМаршрут._IDRRef ID_докМаршрут
        -- FK
        -- imp
        ,DATEADD(YEAR, -2000, докМаршрут._Date_Time) Дата_докМаршрут -- оце треба буде
        ,докМаршрут._Number Номер_докМаршрут
        -- other
        -- system
        ,докМаршрут._Posted Проведен_докМаршрут
        ,докМаршрут._Marked ПометкаУдаления_докМаршрут
    FROM 
        _Document23052 AS докМаршрут

    WHERE 
        докМаршрут._Posted = 0 -- тут лажа в реалізації і проведені - це 0
        AND
        докМаршрут._Marked = 0
)
--------------------------------------------- TABLEPARTS ----------------------------------------------
---
,докМаршрут_Точки AS ( -- це я відрізаю дублі заказів в одному маршруті
    SELECT DISTINCT
        докМаршрут_Точки._Document23052_IDRRef ID_докМаршрут_докМаршрут_Точки
        ,докМаршрут_Точки._Fld23056_RRRef FK_Заказ_докМаршрут_Точки -- тут докЗаказПокупателя
    FROM
        _Document23052_VT23054 AS докМаршрут_Точки

    -- WHERE докМаршрут_Точки._Document23052_IDRRef = '00000000-0000-0000-0000-000000000000' 
)
,докМаршрут_Точки_Joined AS (
    SELECT
        *
        ,ROW_NUMBER() OVER ( -- це я беру останній маршрут по дублях заказів в зірних маршрутах
            PARTITION BY FK_Заказ_докМаршрут_Точки
            ORDER BY Дата_докМаршрут DESC
        ) rn
    FROM
        докМаршрут_Точки
        LEFT JOIN 
            докМаршрут 
            ON 
                докМаршрут.ID_докМаршрут 
                    = докМаршрут_Точки.ID_докМаршрут_докМаршрут_Точки
)
,Agregat_MaxЗаказ_докМаршрут_Точки_Joined AS (
    SELECT
        *
    FROM
        докМаршрут_Точки_Joined

    WHERE rn = 1
)


-------------------------------------------------------------------------------------------------------
---------------------------------------------- VIEWS --------------------------------------------------

---
,докЗаказПокупателя AS ( -- .../.../докЗаказПокупателя.sql
    SELECT
        -- PK
        докЗаказПокупателя._IDRRef AS ID_докЗаказПокупателя
        -- imp
        ,DATEADD(YEAR, -2000, докЗаказПокупателя._Date_Time) AS Дата_докЗаказПокупателя
        ,докЗаказПокупателя._Number AS Номер_докЗаказПокупателя
        -- FK
        -- ,докЗаказПокупателя._Fld24458RRef AS FK_спрСтатусыЗаказовПокупателя_докЗаказПокупателя
        -- ,докЗаказПокупателя._Fld5546RRef AS FK_спрКонтрагенты_докЗаказПокупателя
        -- ,докЗаказПокупателя._Fld5536RRef AS FK_ВалютаДокумента_докЗаказПокупателя
        -- other
        -- ,DATEADD(YEAR, -2000, CAST(докЗаказПокупателя._Fld5540 AS datetime2)) AS ДатаОтгрузки_докЗаказПокупателя
            -- datetime2 може мати значення типу 0001-01-01, а в datetime мінімальне - 1753-01-01
        -- system
        -- ,докЗаказПокупателя._Posted AS Проведен_докЗаказПокупателя
        -- ,докЗаказПокупателя._Marked AS ПометкаУдаления_докЗаказПокупателя
    FROM 
        _Document316 AS докЗаказПокупателя

    WHERE 
        докЗаказПокупателя._Posted = 1 
        AND 
        докЗаказПокупателя._Marked = 0
        AND
        докЗаказПокупателя._Date_Time >= '4025-01-01' -- надто величезні масштаби даних, щоб виводити всі роки (це вже 65к)
)


-------------------------------------------------------------------------------------------------------
---------------------------------------------- OPS ----------------------------------------------------

---
,viz AS (
    SELECT
        *
    FROM
        Agregat_MaxЗаказ_докМаршрут_Точки_Joined
        INNER JOIN
            докЗаказПокупателя
            ON
                Agregat_MaxЗаказ_докМаршрут_Точки_Joined.FK_Заказ_докМаршрут_Точки = докЗаказПокупателя.ID_докЗаказПокупателя
)   


SELECT * FROM viz
ORDER BY Дата_докЗаказПокупателя DESC
-- ORDER BY Дата_докМаршрут DESC