;WITH 

-- КАТАЛОГ
-- І Інші
-- ІІ РегистрыНакоплений
-- ІІІ Справочники
-- IV РегистрыСведений
-- V Документы

-- ПРОЕКТИ



------------------------------------------- І. ІНШІ ---------------------------------------------


-- А
-- Б
-- В
-- Г
-- Д
-- Е
-- Ж
-- З
-- И
-- К
КалендарРікМісяць16_30 AS (
    SELECT
        DATEFROMPARTS(
            own__Рік__КалендарРікМісяць16_30.own__Рік__КалендарРікМісяць16_30,
            own__Місяць__КалендарРікМісяць16_30.own__Місяць__КалендарРікМісяць16_30,
            1
        ) own__ДатаРікМісяць__КалендарРікМісяць16_30
    FROM (
        SELECT 
            2016 + systemTable.number own__Рік__КалендарРікМісяць16_30
        FROM 
            master..spt_values systemTable
        WHERE 
            systemTable.type = 'P'
            AND 
            systemTable.number <= 14
    ) own__Рік__КалендарРікМісяць16_30
    CROSS JOIN (
        SELECT 
            systemTable.number + 1 own__Місяць__КалендарРікМісяць16_30
        FROM 
            master..spt_values systemTable
        WHERE 
            systemTable.type = 'P'
            AND 
            systemTable.number < 12
    ) own__Місяць__КалендарРікМісяць16_30
)
-- Л
-- М
-- Н
-- О
-- П
-- Р
-- С
-- Т
-- У
-- Ф
-- Х
-- Ц
-- Ч
-- Ш
-- Щ
-- Ю
-- Я




--- інші
---------------------------------- ІІ. РЕГИСТРЫ НАКОПЛЕНИЙ -------------------------------------- 



-- А
-- Б
-- В
-- Г
-- Д
-- Е
-- Ж
-- З
-- И
-- К
-- Л
-- М
-- Н
-- О
-- П
-- Р
-- С
-- Т
-- У
-- Ф
-- Х
-- Ц
-- Ч
-- Ш
-- Щ
-- Ю
-- Я





--- регистры накопления
------------------------------------- ІІІ. СПРАВОЧНИКИ ------------------------------------------ 



-- А
-- Б
-- В
-- Г
-- Д
-- Е
-- Ж
-- З
-- И
-- К
-- Л
-- М
-- Н
-- О
-- П
-- Р
-- С
-- Т
-- У
-- Ф
-- Х
-- Ц
-- Ч
-- Ш
-- Щ
-- Ю
-- Я




--- справочники
------------------------------------- ІV. РЕГИСТРЫ СВЕДЕНИЙ --------------------------------------- 



-- А
-- Б
-- В
-- Г
-- Д
-- Е
-- Ж
-- З
-- И
-- К
-- Л
-- М
-- Н
-- О
-- П
-- Р
-- С
-- Т
-- У
-- Ф
-- Х
-- Ц
-- Ч
-- Ш
-- Щ
-- Ю
-- Я





----------------------------------------- V. ДОКУМЕНТЫ -----------------------------------------



-- А
-- Б
-- В
-- Г
-- Д
-- Е
-- Ж
-- З
-- И
-- К
-- Л
-- М
-- Н
-- О
-- П
-- Р
-- С
-- Т
-- У
-- Ф
-- Х
-- Ц
-- Ч
-- Ш
-- Щ
-- Ю
-- Я





------------------------------------------------------------------------------------------------------------
--------------------------------------------- ПРОЕКТИ ------------------------------------------------------
------------------------------------------------------------------------------------------------------------

---

---------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------

------------------------------------------ VII СЕЛЕКТ ---------------------------------------------



SELECT * FROM КалендарРікМісяць16_30