;WITH

регсведРемонты AS (
    SELECT
        регсведРемонты._Fld24657RRef FK__докОтчетПроизводстваЗаСмену__регсведРемонты
        ,регсведРемонты._Fld24652RRef FK__Подразделение__спрВидыПодразделений_регсведР
        ,регсведРемонты._Fld24655 own__НачалоРемонта__регсведРемонты
        ,регсведРемонты._Fld24656 own__КонецРемонта__регсведРемонты
    FROM 
        _InfoRg24651 AS регсведРемонты
)
,регсведПростои AS (
    SELECT
        регсведПростои._Fld25202RRef FK__докОтчетПроизводстваЗаСмену__регсведПростои
        ,регсведПростои._Fld25197RRef FK__Подразделение__спрВидыПодразделений_регсведП
        ,регсведПростои._Fld25199 own__НачалоПростоя__регсведПростои
        ,регсведПростои._Fld25199 own__КонецПростоя__регсведПростои
    FROM 
        _InfoRg25196 AS регсведПростои
)
,регсведПереходы AS (
    SELECT
        NULL FK__докОтчетПроизводстваЗаСмену__регсведПереходы -- не прив'язується до звіту станом на 31.03.26
        ,регсведПереходы._Fld25191RRef FK__Подразделение__спрВидыПодразделений_Паузи
        ,регсведПереходы._Fld25193 own__НачалоПерехода__регсведПереходы
        ,регсведПереходы._Fld25194 own__КонецПерехода__регсведПереходы
    FROM 
        _InfoRg25190 AS регсведПереходы
)

,спрВидыПодразделений_Паузи AS (
    SELECT
        спрВидыПодразделений_Паузи._IDRRef ID__Ссылка__спрВидыПодразделений_Паузи
        ,спрВидыПодразделений_Паузи._Description own__Наименование__спрВидыПодразделений_Паузи
    FROM 
        _Reference170 AS спрВидыПодразделений_Паузи
    WHERE 
        спрВидыПодразделений_Паузи._Marked = 0 
    AND
        спрВидыПодразделений_Паузи._Description <> 'Цех №1' -- вже нема
    AND 
        спрВидыПодразделений_Паузи._Description <> 'Цех №2' -- вже нема
    AND 
        спрВидыПодразделений_Паузи._Description <> 'Цех №2 (Лінія1)' -- вже нема
)

,Agr__ПаузиЛіній_РемПростПер__регсведР AS (
    SELECT
        регсведРемонты.FK__докОтчетПроизводстваЗаСмену__регсведРемонты FK__докОтчетПроизводстваЗаСмену__Agr_ПЛ_РПП_регсведР
        ,регсведРемонты.FK__Подразделение__спрВидыПодразделений_регсведР FK__Подразделение__спрВидыПодразделений_Agr_ПЛ_РПП_регсведР
        ,регсведРемонты.own__НачалоРемонта__регсведРемонты own__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
        ,регсведРемонты.own__КонецРемонта__регсведРемонты own__КінецьПаузи__Agr_ПЛ_РПП_регсведР
        ,'Ремонт' AS props__ТипПаузи__регсведР
    FROM
        регсведРемонты
    UNION ALL
    SELECT
        *
        ,'Простой' AS props__ТипПаузи__регсведР
    FROM
        регсведПростои
    UNION ALL
    SELECT
        *
        ,'Переход' AS props__ТипПаузи__регсведР
    FROM
        регсведПереходы
)
,Props__ДатиПауз__Agr_ПЛ_РПП_регсведР AS (
    SELECT
        *
        ,CASE
            WHEN Agr__ПаузиЛіній_РемПростПер__регсведР.own__ПочатокПаузи__Agr_ПЛ_РПП_регсведР < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(
                    YEAR, -2000, CAST(own__ПочатокПаузи__Agr_ПЛ_РПП_регсведР AS datetime2)
                ) 
        END calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
        ,CASE
            WHEN Agr__ПаузиЛіній_РемПростПер__регсведР.own__ПочатокПаузи__Agr_ПЛ_РПП_регсведР < '2020-01-01'
                THEN NULL
            ELSE
                DATEADD(
                    DAY, -1, DATEADD(YEAR, -2000, CAST(Agr__ПаузиЛіній_РемПростПер__регсведР.own__ПочатокПаузи__Agr_ПЛ_РПП_регсведР AS datetime2))
                )
        END calc__ПочатокПаузиМінусДень__Agr_ПЛ_РПП_регсведР
        ,DATEADD(
            YEAR, -2000, CAST(Agr__ПаузиЛіній_РемПростПер__регсведР.own__КінецьПаузи__Agr_ПЛ_РПП_регсведР AS datetime2)) 
            calc__КінецьПаузи__Agr_ПЛ_РПП_регсведР
    FROM
        Agr__ПаузиЛіній_РемПростПер__регсведР
)
,Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР AS (
    SELECT
        *
    FROM
        Props__ДатиПауз__Agr_ПЛ_РПП_регсведР
        LEFT JOIN
            спрВидыПодразделений_Паузи
            ON
                Props__ДатиПауз__Agr_ПЛ_РПП_регсведР.FK__Подразделение__спрВидыПодразделений_Agr_ПЛ_РПП_регсведР
                    = спрВидыПодразделений_Паузи.ID__Ссылка__спрВидыПодразделений_Паузи
)
,Props__ТривалістьПаузи__Agr_ПЛ_РПП_регсведР AS (
    SELECT
        *
        ,CASE 
            WHEN Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР IS NULL 
            OR Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__КінецьПаузи__Agr_ПЛ_РПП_регсведР IS NULL 
            OR Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__КінецьПаузи__Agr_ПЛ_РПП_регсведР 
                <= Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
            OR 
                DATEDIFF(
                    MINUTE, Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР, 
                        Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__КінецьПаузи__Agr_ПЛ_РПП_регсведР
                ) > 720
                THEN 
                    0
            ELSE 
                DATEDIFF(
                    MINUTE, Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР, 
                        Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР.calc__КінецьПаузи__Agr_ПЛ_РПП_регсведР
                )
        END AS props__ТривалістьПаузХв__Agr_ПЛ_РПП_регсведР
    FROM 
        Join__спрВидыПодразделений_Паузи__Agr_ПЛ_РПП_регсведР
)
,Props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР AS (
    SELECT
        *
        ,CASE 
            WHEN 
                DATEPART(
                    HOUR, calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
                ) >= 6 
            AND 
                DATEPART(
                    HOUR, calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
                ) < 18
                THEN 
                    CONVERT(
                        nvarchar(10), 
                            calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
                    ) + N', Денна, ' + own__Наименование__спрВидыПодразделений_Паузи
            ELSE 
                CASE 
                    WHEN 
                        DATEPART(
                                HOUR, calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
                        ) >= 18
                        THEN
                        CONVERT(
                            nvarchar(10), 
                                calc__ПочатокПаузи__Agr_ПЛ_РПП_регсведР
                        ) + N', Нічна, ' + own__Наименование__спрВидыПодразделений_Паузи
                    ELSE
                        CONVERT(
                            nvarchar(10), 
                                calc__ПочатокПаузиМінусДень__Agr_ПЛ_РПП_регсведР
                        ) + N', Нічна, ' + own__Наименование__спрВидыПодразделений_Паузи
                END
        END AS props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР
    FROM 
        Props__ТривалістьПаузи__Agr_ПЛ_РПП_регсведР
)
,Agr__СумаПаузиПоЗміні__Agr_ПЛ_РПП_регсведР AS (
    SELECT
        Props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР.props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР agr__ПаузаЗміна__Agr_СумаПаузиПоЗміні_Agr_ПЛ_РПП_регсведР
        ,SUM(
            Props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР.props__ТривалістьПаузХв__Agr_ПЛ_РПП_регсведР
        ) agr__ТривалістьПаузиХв__Agr_СумаПаузиПоЗміні_Agr_ПЛ_РПП_регсведР
    FROM 
        Props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР
    GROUP BY
        Props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР.props__ПаузаЗміна__Agr_ПЛ_РПП_регсведР
)

SELECT * FROM Agr__СумаПаузиПоЗміні__Agr_ПЛ_РПП_регсведР